{
    "id": "4-7-8-breathing",
    "name": "4-7-8 Breathing",
    "summary": "Breathing technique inhaling for 4 counts, holding for 7, exhaling for 8 to promote deep relaxation and sleep.",
    "explanation": "The 4-7-8 breathing technique, developed by Dr. Andrew Weil based on pranayama yoga practices, is a powerful relaxation method often called a \"natural tranquilizer for the nervous system.\" The extended exhale ratio is particularly effective for reducing anxiety and promoting sleep.\n\nHow to practice 4-7-8 breathing:\n\n1. Place the tip of your tongue against the ridge behind your upper front teeth\n2. Exhale completely through your mouth, making a whoosh sound\n3. Close your mouth and inhale quietly through your nose for 4 counts\n4. Hold your breath for 7 counts\n5. Exhale completely through your mouth (whoosh) for 8 counts\n6. This is one cycle. Repeat for 4 cycles total\n\nWhy the 4-7-8 ratio works: The extended exhale (twice as long as the inhale) strongly activates the parasympathetic nervous system. The breath hold increases CO2 levels, which paradoxically promotes calm. The specific ratio prevents hyperventilation while maximizing the relaxation effect.\n\nKey points:\n- The absolute count doesn't matter - maintain the 4:7:8 ratio\n- Start with just 4 cycles (more can cause lightheadedness initially)\n- Practice twice daily for best results\n- Effects compound with regular practice\n- Keep tongue position throughout\n\nBest uses: Falling asleep, managing acute anxiety, before stressful events, whenever you feel overwhelmed.\n\nNote: If you can't hold for 7 counts initially, speed up the count but maintain the ratio. Your capacity will increase with practice.",
    "tags": [
        "breathing",
        "relaxation",
        "sleep",
        "techniques",
        "well-being"
    ],
    "category": "Well-Being & Happiness",
    "icon": "FaMoon",
    "featured": false,
    "aliases": [
        "Relaxing breath",
        "Weil breathing technique",
        "4-7-8 method"
    ],
    "relatedConcepts": [
        "breathwork",
        "box-breathing",
        "diaphragmatic-breathing",
        "relaxation-response",
        "sleep-hygiene"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Spontaneous Happiness by Andrew Weil",
            "url": "https://www.amazon.com/dp/0316129429?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "4-7-8 breathing - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/4-7-8_breathing",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-29",
    "dateModified": "2026-01-29"
}
