{
    "id": "active-vocabulary",
    "name": "Active Vocabulary",
    "summary": "Words one can produce and use spontaneously in speech and writing.",
    "explanation": "Active vocabulary (also called productive vocabulary) refers to the set of words a person can spontaneously recall and use correctly in speech and writing. Unlike passive vocabulary (words you recognize when encountered), active vocabulary requires the ability to retrieve words from memory and deploy them appropriately in context.\n\nNative English speakers typically have an active vocabulary of around 20,000 words, compared to a passive vocabulary of 30,000 or more. For second-language learners, this gap is often much larger—learners may understand thousands of words while actively using only hundreds. A word enters active vocabulary gradually: first you recognize it, then you understand it in context, then you can use it with effort, and finally you deploy it automatically.\n\nBuilding active vocabulary requires different strategies than building passive vocabulary. Passive vocabulary grows through reading and listening, but active vocabulary requires production practice: speaking, writing, and using words in context. Flashcard systems that test in both directions (recognition and recall) help bridge this gap. The act of retrieving a word from memory strengthens the neural pathway for that word, making future retrieval easier.\n\nThe active/passive distinction applies beyond language. In programming, your active skill set is what you can write from memory; your passive set is what you recognize and understand. In music, active repertoire is what you can play without sheet music. Recognizing this distinction helps focus practice on the harder but more valuable production-oriented activities.",
    "tags": [
        "language-learning",
        "learning",
        "memory",
        "vocabulary"
    ],
    "category": "Learning & Education",
    "icon": "FaComment",
    "featured": false,
    "aliases": [
        "Productive Vocabulary",
        "Expressive Vocabulary"
    ],
    "relatedConcepts": [
        "active-recall",
        "passive-vocabulary",
        "recognition-production-gap",
        "spaced-repetition"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Vocabulary - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Vocabulary",
            "type": "website"
        },
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "DeveloPassion's Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-30",
    "dateModified": "2026-01-30"
}
