{
    "id": "affective-forecasting",
    "name": "Affective Forecasting",
    "summary": "Predicting how future events will make us feel, a process prone to systematic errors.",
    "explanation": "Affective forecasting is our attempt to predict our future emotional states—how happy, sad, or satisfied we'll feel after certain events occur. Research by Daniel Gilbert and Timothy Wilson reveals that humans are surprisingly poor at this. We consistently overestimate both the intensity and duration of our emotional reactions to future events, a phenomenon called 'impact bias.'\n\nWe imagine that getting a promotion, buying a dream house, or losing a job will have lasting effects on our happiness. In reality, we adapt faster than expected. This occurs because of 'focalism'—when predicting, we focus narrowly on the event itself and neglect all the other aspects of life that will continue and dilute its emotional impact. We also underestimate our 'psychological immune system'—the unconscious processes that help us rationalize, find silver linings, and adapt to new circumstances.\n\nThis forecasting failure has significant implications. We make major life decisions—career choices, purchases, relationships—based on how we think they'll make us feel. If those predictions are systematically wrong, we may pursue goals that won't bring expected satisfaction while avoiding paths that would actually increase well-being. We chase peak experiences instead of sustainable contentment.\n\nTo improve decision-making, recognize that emotional predictions are unreliable. Consider asking people who have already experienced what you're contemplating—their actual experience is more informative than your imagination. Also, distinguish between experienced utility (how things actually feel) and remembered utility (how we recall feeling)—these differ systematically. Most importantly, don't overweight emotional predictions when making major life choices.",
    "tags": [
        "psychology",
        "decision-making",
        "well-being",
        "happiness",
        "cognitive-biases"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaCrystalBall",
    "featured": false,
    "aliases": [
        "Emotional Forecasting",
        "Hedonic Forecasting",
        "Predicting Happiness"
    ],
    "relatedConcepts": [
        "impact-bias",
        "hedonic-adaptation",
        "focusing-effect",
        "hot-cold-empathy-gap",
        "peak-end-rule"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Stumbling on Happiness by Daniel Gilbert",
            "url": "https://www.amazon.com/dp/1400077427"
        },
        {
            "title": "Strangers to Ourselves by Timothy Wilson",
            "url": "https://www.amazon.com/dp/0674013824"
        }
    ],
    "references": [
        {
            "title": "Affective Forecasting - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Affective_forecasting",
            "type": "website"
        },
        {
            "title": "Immune Neglect - Gilbert et al.",
            "url": "https://doi.org/10.1037/0022-3514.75.3.617",
            "type": "paper"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/product/clarity-101",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-25",
    "dateModified": "2026-01-25"
}
