{
    "id": "altruism",
    "name": "Altruism",
    "summary": "The practice of selfless concern for the well-being of others, acting to benefit them without expectation of personal reward or recognition.",
    "explanation": "Altruism refers to behavior motivated by genuine concern for the welfare of others, performed without expectation of external reward or personal benefit. The term was coined by Auguste Comte in the 19th century, derived from the Italian word 'altrui' meaning 'other people.'\n\nAltruism operates at multiple levels and has been studied across several disciplines:\n\n**Biological altruism**: In evolutionary biology, altruistic behavior appears paradoxical since natural selection should favor self-interested organisms. Several theories explain its persistence: kin selection (Hamilton's rule) shows that helping relatives preserves shared genes; reciprocal altruism (Robert Trivers) explains cooperation between unrelated individuals who may reciprocate in the future; and group selection theories suggest altruistic groups may outcompete selfish ones.\n\n**Psychological altruism**: The debate between genuine altruism and psychological egoism asks whether any act is truly selfless. Research by C. Daniel Batson on the empathy-altruism hypothesis provides evidence that empathic concern can produce genuinely altruistic motivation, not merely disguised self-interest. The helper's high - the positive feeling from helping others - doesn't negate altruistic intent but may reinforce altruistic behavior.\n\n**Philosophical altruism**: Ethical frameworks differ on whether altruism is morally required (as in utilitarianism and effective altruism), morally praiseworthy but optional (supererogatory), or potentially harmful when taken to extremes (as Ayn Rand argued).\n\n**Pathological altruism**: Barbara Oakley's research highlights that altruism can become harmful when it enables destructive behavior in others, leads to burnout in the helper, or results from unhealthy self-sacrifice patterns. Setting appropriate boundaries is essential for sustainable altruistic behavior.\n\nFactors that promote altruism include empathy, moral identity, social norms, religious and philosophical values, and exposure to altruistic role models. Situational factors also matter - the bystander effect shows that the presence of others can inhibit helping behavior, while personal responsibility and proximity increase it.\n\nIn modern contexts, the effective altruism movement has applied analytical rigor to altruistic impulses, asking not just 'Should I help?' but 'How can I help the most?' This approach combines the compassionate motivation of altruism with evidence-based reasoning about impact.",
    "tags": ["ethics", "psychology", "philosophy", "behavior-change"],
    "category": "Philosophy & Wisdom",
    "icon": "FaHandHoldingHeart",
    "featured": false,
    "aliases": ["Selflessness", "Prosocial Behavior"],
    "relatedConcepts": ["effective-altruism", "generalized-reciprocity", "helpers-high", "empathy", "utilitarianism", "moral-circle-expansion", "social-exchange"],
    "relatedNotes": [],
    "references": [{"title": "Altruism - Wikipedia", "url": "https://en.wikipedia.org/wiki/Altruism", "type": "website"}],
    "articles": [],
    "books": [{"title": "The Altruistic Brain by Donald Pfaff", "url": "https://www.amazon.com/dp/0199377464?tag=dsebastien00-20"}, {"title": "Pathological Altruism by Barbara Oakley", "url": "https://www.amazon.com/dp/0199738572?tag=dsebastien00-20"}],
    "tutorials": [],
    "datePublished": "2026-02-08",
    "dateModified": "2026-02-08"
}
