{
    "id": "aspiration",
    "name": "Aspiration",
    "summary": "The process of acquiring new values through proleptic reasoning, cultivating desires and capacities you don't yet fully possess.",
    "explanation": "Aspiration is the process by which we develop new values and desires through what philosopher Agnes Callard calls proleptic reasoning - reasoning toward a value you don't yet fully hold. When you aspire to appreciate classical music, master a craft, or cultivate wisdom, you're trying to become someone who genuinely values something you don't yet fully understand or desire.\n\nAspiration differs from ordinary goal pursuit because you cannot evaluate success from your current position. Someone aspiring to appreciate philosophy cannot judge philosophical work using their pre-philosophical values - they must provisionally adopt philosophical standards before they fully understand why those standards matter. This creates a bootstrapping problem: how do you pursue what you cannot yet value?\n\nCallard argues aspiration requires acting on behalf of your future self while acknowledging uncertainty about whether that self will endorse your current efforts. The aspiring musician practices scales not because they currently find value in the activity, but because they trust the process will eventually reveal that value. This distinguishes aspiration from both ordinary desire (wanting what you already value) and mere change (becoming different without intentional cultivation).\n\nFor knowledge workers, understanding aspiration illuminates the patient, uncertain work of developing expertise and taste. It explains why learning feels different from applying existing knowledge - you're not just acquiring information but transforming your values and capacities. Aspiration requires tolerance for incompetence, trust in transformative processes, and willingness to pursue value you don't yet fully perceive. It's fundamentally a thick desire - you cannot aspire without being changed by the aspiration itself.",
    "tags": [
        "philosophies",
        "self-improvement",
        "learning",
        "growth",
        "values",
        "transformation",
        "intentionality",
        "expertise"
    ],
    "category": "Philosophy & Wisdom",
    "icon": "FaMountain",
    "featured": false,
    "aliases": [
        "Proleptic reasoning",
        "Value acquisition",
        "Transformative aspiration"
    ],
    "relatedConcepts": [
        "thick-desires",
        "growth-mindset",
        "deliberate-practice",
        "learning-by-doing",
        "eudaimonia",
        "self-actualization"
    ],
    "relatedNotes": [],
    "articles": [
        {
            "title": "Thin Desires Are Eating Your Life by JA Westenberg",
            "url": "https://www.joanwestenberg.com/thin-desires-are-eating-your-life/",
            "type": "website"
        }
    ],
    "references": [
        {
            "title": "Aspiration - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Aspiration",
            "type": "website"
        },
        {
            "title": "Agnes Callard - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Agnes_Callard",
            "type": "website"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/l/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://knowledge-management-for-beginners.com",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/l/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "books": [
        {
            "title": "Aspiration: The Agency of Becoming by Agnes Callard",
            "url": "https://www.amazon.com/dp/0190881518?tag=dsebastien00-20"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-06",
    "dateModified": "2026-01-18"
}
