{
    "id": "assumption-reversal",
    "name": "Assumption Reversal",
    "summary": "Creative technique that challenges existing assumptions by deliberately reversing them to generate new perspectives and breakthrough ideas.",
    "explanation": "Assumption Reversal is a creativity technique that systematically identifies the assumptions underlying a situation and then deliberately reverses them to generate new perspectives. By questioning what we take for granted, we discover opportunities hidden by conventional thinking.\n\nThe Process:\n\n1. State the problem or situation clearly\n2. List all assumptions about how things work, what's required, what's impossible\n3. Reverse each assumption (if you assume X, consider not-X)\n4. Explore the implications of each reversal\n5. Identify which reversals suggest viable innovations\n\nExample: Restaurant industry assumption: \"Customers come to us.\" Reversal: \"We go to customers.\" This reversal led to food trucks, delivery services, and ghost kitchens.\n\nTypes of assumptions to reverse:\n- Process assumptions: \"It must be done this way\"\n- Role assumptions: \"These people do this task\"\n- Time assumptions: \"It takes this long\"\n- Resource assumptions: \"You need these inputs\"\n- Value assumptions: \"Customers want this\"\n- Constraint assumptions: \"This is impossible\"\n\nWhy Assumption Reversal works: Most problems are defined within invisible boundaries of assumptions. These assumptions feel like facts but are often arbitrary conventions. Reversing them reveals that many \"rules\" are negotiable.\n\nRelated techniques: Assumption reversal connects to reframing (changing how you see a problem), challenging the brief (questioning whether you're solving the right problem), and first principles thinking (rebuilding from fundamentals).\n\nCaution: Not all reversals are feasible. The goal is to generate possibilities, which then require evaluation through convergent thinking.",
    "tags": [
        "creativity",
        "problem-solving",
        "critical-thinking",
        "techniques"
    ],
    "category": "Techniques",
    "icon": "FaExchangeAlt",
    "featured": false,
    "aliases": [
        "Reverse assumptions",
        "Assumption challenging",
        "Flip the assumption"
    ],
    "relatedConcepts": [
        "first-principles",
        "lateral-thinking",
        "divergent-thinking"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "What If? by Steve Rivkin",
            "url": "https://www.amazon.com/dp/B0BZWDS5C6?tag=dsebastien00-20"
        },
        {
            "title": "Lateral Thinking by Edward de Bono",
            "url": "https://www.amazon.com/dp/0060903252?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Assumption reversal - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Assumption_reversal",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-29",
    "dateModified": "2026-01-29"
}
