{
    "id": "barriers-to-entry",
    "name": "Barriers to Entry",
    "summary": "Obstacles that make it difficult for new competitors to enter a market or industry.",
    "explanation": "Barriers to entry are obstacles that make it difficult or expensive for new firms to enter an industry and compete with established players. Common barriers include: economies of scale (established firms have cost advantages), capital requirements (high upfront investment needed), switching costs (customers locked to incumbents), regulatory barriers (licenses, permits, compliance), network effects (value increases with existing users), brand loyalty and reputation, access to distribution channels, and proprietary technology or patents. Barriers can be structural (inherent to the industry) or strategic (deliberately created by incumbents). High barriers protect incumbents' profits but can reduce innovation and consumer choice. In disruption theory, new entrants often circumvent barriers by targeting overlooked market segments with simpler solutions. For entrepreneurs, understanding barriers helps identify which markets to enter and how. For incumbents, barriers are moats to maintain and strengthen.",
    "tags": [
        "strategies",
        "businesses",
        "competition",
        "markets",
        "economics"
    ],
    "category": "Business & Economics",
    "icon": "FaDoorClosed",
    "featured": false,
    "aliases": [
        "Entry Barriers",
        "Market Entry Barriers"
    ],
    "relatedConcepts": [
        "moat",
        "competitive-advantage",
        "economies-of-scale",
        "network-effects",
        "switching-costs",
        "disruptive-innovation"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Barriers to entry - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Barriers_to_entry",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-03",
    "dateModified": "2026-02-03"
}
