{
    "id": "behavioral-integrity",
    "name": "Behavioral Integrity",
    "summary": "The consistency between a person's words and their actions - doing what you say you will do.",
    "explanation": "Behavioral integrity is the perceived alignment between a person's words and their actions. Coined by organizational behavior researcher Tony Simons, it captures the simple but powerful principle: say what you do, and do what you say. It is not about having the 'right' values but about the consistency between espoused values and enacted behavior.\n\nBehavioral integrity matters enormously because it is the foundation of trust. Research by Simons found that a one-eighth point improvement in a hotel's behavioral integrity score (on a 5-point scale) correlated with a 2.5% increase in revenue per available room. Employees who perceive their leaders as behaviorally integrated show higher commitment, engagement, and willingness to go above and beyond. Conversely, perceived gaps between words and actions are among the fastest destroyers of trust and credibility.\n\nThe concept operates at multiple levels. At the personal level, behavioral integrity means keeping promises to yourself and others, following through on commitments, and ensuring your daily actions reflect your stated values and priorities. At the leadership level, it means modeling the behaviors you expect from others, honoring commitments to your team, and being transparent when circumstances force changes. At the organizational level, it means the company's culture and practices match its stated values and mission.\n\nCommon failures of behavioral integrity include: saying you value work-life balance while rewarding only long hours, claiming to welcome feedback while punishing dissent, espousing innovation while penalizing failure, and making promises you cannot keep. The gap does not need to be intentional to be damaging. Leaders often make aspirational statements that they genuinely intend to follow but fail to act on, creating a credibility deficit.\n\nBuilding behavioral integrity requires: making fewer and more careful commitments, following through reliably on the commitments you make, acknowledging openly when you cannot fulfill a promise, aligning systems and incentives with stated values, and regularly auditing whether your actions match your words. The principle is deceptively simple but profoundly difficult to maintain consistently.",
    "tags": [
        "integrity",
        "leadership",
        "trust",
        "values",
        "accountability"
    ],
    "category": "Leadership & Management",
    "icon": "FaHandshake",
    "featured": false,
    "aliases": [
        "Walk the talk",
        "Say what you do, do what you say",
        "Words-action alignment",
        "Practice what you preach"
    ],
    "relatedConcepts": [
        "accountability-principle",
        "values-clarification",
        "values-and-beliefs",
        "decision-congruence",
        "servant-leadership",
        "leading-by-example"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Behavioral integrity - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Behavioral_integrity",
            "type": "website"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/product/clarity-101",
            "type": "other"
        }
    ],
    "books": [],
    "tutorials": [],
    "datePublished": "2026-02-13",
    "dateModified": "2026-02-13"
}
