{
    "id": "behavioral-momentum",
    "name": "Behavioral Momentum",
    "summary": "The tendency for established behavior patterns to persist and resist change, analogous to physical momentum in Newtonian mechanics.",
    "explanation": "Behavioral momentum is a concept from behavioral psychology that describes the tendency for a behavior to persist in the face of disruption or change. Just as a heavy, fast-moving object is harder to stop than a light, slow one, well-established behaviors with strong reinforcement histories are more resistant to disruption than weakly reinforced ones.\n\n**The Physics Analogy**:\n\nIn Newtonian mechanics, momentum equals mass times velocity. In behavioral momentum theory, the 'mass' corresponds to the reinforcement context (how richly a behavior has been rewarded), while 'velocity' corresponds to the response rate. A behavior with a rich reinforcement history (high 'mass') will persist longer when challenged.\n\n**Key Principles**:\n\n1. **Resistance to change**: Behaviors maintained by richer reinforcement schedules are more resistant to disruption\n2. **Context dependence**: The overall reinforcement context matters, not just the specific behavior-reinforcement relationship\n3. **Disruption types**: Behavioral momentum applies to various disruptions including extinction, punishment, satiation, and competing behaviors\n\n**Practical Applications**:\n\n- **Education**: Teachers can build behavioral momentum by starting with easy, high-success tasks before introducing harder ones (high-probability request sequences)\n- **Habit formation**: Understanding that well-rewarded habits are harder to break explains why deeply ingrained routines persist even when no longer useful\n- **Change management**: Organizations can leverage behavioral momentum by building on existing successful patterns rather than attempting wholesale change\n- **Therapy**: Behavioral interventions can be designed to build momentum toward desired behaviors through progressive reinforcement\n\n**The High-Probability Request Sequence**:\n\nOne practical technique derived from behavioral momentum research is issuing several easy-to-comply requests before a difficult one. Compliance with the easy requests builds behavioral momentum that carries over to increase compliance with the harder request.\n\n**Relationship to Other Concepts**:\n\nBehavioral momentum connects to the broader concept of momentum in productivity and personal development. While general momentum focuses on the subjective experience of flow and progress, behavioral momentum provides the scientific framework explaining why established patterns resist change at a fundamental level.",
    "tags": [
        "psychology",
        "behaviors",
        "habits",
        "change-management",
        "behavioral-economics"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaRunning",
    "featured": false,
    "aliases": [
        "Response momentum",
        "Behavioral persistence"
    ],
    "relatedConcepts": [
        "momentum",
        "habit-loop",
        "status-quo-bias",
        "sunk-cost-fallacy",
        "overcoming-inertia"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Behavioral momentum - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Behavioral_momentum",
            "type": "website"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Journaling Deep Dive Workshop",
            "url": "https://store.dsebastien.net/product/journaling-deep-dive",
            "type": "other"
        },
        {
            "title": "Personal Organization 101 Workshop",
            "url": "https://store.dsebastien.net/product/personal-organization-101",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-20",
    "dateModified": "2026-02-20"
}
