{
    "id": "behaviorism",
    "name": "Behaviorism",
    "summary": "A psychological approach that focuses exclusively on observable behavior and environmental stimuli, rejecting the study of internal mental states.",
    "explanation": "Behaviorism is a school of psychology founded in the early 20th century that studies observable behavior rather than internal mental processes. The approach emerged as a reaction against introspective psychology, which relied on subjective reports of conscious experience. Behaviorists argued that psychology should be a natural science, studying only what can be objectively measured and observed.\n\nJohn B. Watson is credited as the founder of behaviorism, publishing his manifesto 'Psychology as the Behaviorist Views It' in 1913. Watson famously claimed that given a dozen healthy infants, he could train any one of them to become any type of specialist regardless of their talents or ancestry. This radical environmentalism emphasized that behavior is entirely shaped by conditioning rather than innate traits.\n\nThe behaviorist approach centers on two main types of conditioning. Classical conditioning, discovered by Ivan Pavlov through his famous experiments with dogs, involves learning through association. A neutral stimulus (like a bell) paired repeatedly with an unconditioned stimulus (food) eventually produces a conditioned response (salivation) on its own. Operant conditioning, developed primarily by B.F. Skinner, focuses on how consequences shape behavior. Behaviors followed by positive reinforcement increase in frequency, while those followed by punishment or removal of rewards decrease.\n\nSkinner became the most influential behaviorist of the 20th century, developing the concept of radical behaviorism and designing the 'Skinner box' to study operant conditioning in controlled environments. He applied these principles to propose behavioral engineering of society, controversial ideas explored in his utopian novel 'Walden Two' and his book 'Beyond Freedom and Dignity.'\n\nWhile strict behaviorism declined after the cognitive revolution of the 1950s-60s, its influence persists. Applied Behavior Analysis (ABA) remains a major therapeutic approach, particularly for autism. Behavioral principles underpin habit formation strategies, gamification, and the design of reward systems in apps and products. Understanding behaviorism helps explain why certain incentive structures work and how environmental design shapes human action.",
    "tags": [
        "psychology",
        "learning",
        "behavior-change"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaBrain",
    "featured": false,
    "aliases": [
        "Behavioral Psychology",
        "Behaviourism"
    ],
    "relatedConcepts": [
        "cognitive-psychology",
        "habit-formation",
        "behavioral-economics"
    ],
    "relatedNotes": [
        "https://notes.dsebastien.net/30+Areas/33+Permanent+notes/33.02+Content/Behaviorism"
    ],
    "articles": [],
    "books": [
        {
            "title": "About Behaviorism by B.F. Skinner",
            "url": "https://www.amazon.com/dp/0394716183?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Behaviorism - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Behaviorism",
            "type": "website"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "DeveloPassion's Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-28",
    "dateModified": "2026-01-29"
}
