{
    "id": "behavior-change",
    "name": "Behavior Change",
    "summary": "The field studying how to help people adopt new behaviors or stop existing ones, encompassing habit formation, health interventions, and therapeutic approaches.",
    "explanation": "Behavior change encompasses the theories, models, and techniques for modifying human behaviors. Multiple theoretical frameworks compete for explaining how change happens: BJ Fogg's Fogg Behavior Model (B=MAP), the Transtheoretical Model (stages of change), COM-B (Capability, Opportunity, Motivation), and Wendy Wood's habit research emphasizing context and automaticity. The field has evolved from information-based approaches ('tell people and they'll change') to recognizing that behavior is shaped by environment, social forces, and unconscious processes.\n\nA key tension exists between willpower-based and environment-based approaches. Roy Baumeister's ego depletion theory suggested willpower is a limited resource that depletes with use, though this has faced challenges in the replication crisis. Researchers like Wendy Wood, BJ Fogg, and James Clear offer alternatives: design environments and tiny habits that bypass willpower entirely. The field increasingly recognizes that sustainable change comes from making desired behaviors automatic rather than requiring ongoing motivation.\n\nCore behavior change techniques include goal setting, self-monitoring, feedback, social support, prompts and cues, rewards, habit formation through repetition, and environmental restructuring. The most effective approaches share common principles: start tiny (2-minute versions), stack habits onto existing routines, design the environment to make good behavior the default, remove friction for desired behaviors, add friction for undesired ones, focus on identity ('I am someone who...'), and celebrate small wins for immediate positive emotion.\n\nApplications span health (smoking cessation, weight management, medication adherence), productivity (work habits, focus, routines), public policy (nudge theory, choice architecture), finance (saving behaviors), education (study habits), and product design (user onboarding, engagement). The unifying insight is that sustainable change rarely comes from willpower or information alone, but from thoughtfully designed environments and systems that make the desired behavior the path of least resistance.",
    "tags": [
        "psychology",
        "habits",
        "personal-development",
        "motivation",
        "self-improvement"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaBrain",
    "featured": false,
    "aliases": [
        "Behaviour Change",
        "Behavioral Change"
    ],
    "relatedConcepts": [
        "habit-formation",
        "fogg-behavior-model",
        "nudge-theory",
        "environment-design"
    ],
    "relatedNotes": [
        "https://notes.dsebastien.net/30+Areas/33+Permanent+notes/33.02+Content/Behavior+Change"
    ],
    "articles": [],
    "books": [
        {
            "title": "Tiny Habits by BJ Fogg",
            "url": "https://www.amazon.com/dp/0358003326?tag=dsebastien00-20"
        },
        {
            "title": "Good Habits, Bad Habits by Wendy Wood",
            "url": "https://www.amazon.com/dp/1250159075?tag=dsebastien00-20"
        },
        {
            "title": "Atomic Habits by James Clear",
            "url": "https://www.amazon.com/dp/0735211299?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Behavior change (Wikipedia)",
            "url": "https://en.wikipedia.org/wiki/Behavior_change_(public_health)",
            "type": "website"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Journaling Deep Dive Workshop",
            "url": "https://store.dsebastien.net/product/journaling-deep-dive",
            "type": "other"
        },
        {
            "title": "Personal Organization 101 Workshop",
            "url": "https://store.dsebastien.net/product/personal-organization-101",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-28",
    "dateModified": "2026-01-29"
}
