{
    "id": "behavioral-genetics",
    "name": "Behavioral Genetics",
    "summary": "The study of how genetic variation contributes to individual differences in behavior, personality, and mental abilities.",
    "explanation": "Behavioral genetics examines the interplay between genetic and environmental factors in shaping human behavior. Through twin studies (comparing identical vs fraternal twins) and adoption studies, researchers have discovered that most psychological traits are 30-60% heritable. This finding challenges the 'blank slate' view that environment alone determines who we become.\n\nKey findings from the field include: shared family environment has surprisingly small effects after childhood; non-shared environment (unique experiences) matters more than previously thought; and genes influence the environments we seek out through gene-environment correlation. For example, a genetically extroverted child may seek out more social situations, which further shapes their development.\n\nBehavioral genetics has transformed the nature vs nurture debate by demonstrating it's not either/or. Genes and environment interact in complex, bidirectional ways. The field reveals that while genes provide predispositions, environmental factors can either amplify or buffer genetic influences on behavior.",
    "tags": [
        "genetics",
        "psychology",
        "behaviors",
        "nature-vs-nurture",
        "heritability",
        "twin-studies"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaBrain",
    "featured": false,
    "aliases": [
        "Behaviour Genetics"
    ],
    "relatedConcepts": [
        "evolutionary-psychology"
    ],
    "relatedNotes": [
        "https://notes.dsebastien.net/30+Areas/33+Permanent+notes/33.02+Content/Behavioral+Genetics"
    ],
    "articles": [],
    "books": [
        {
            "title": "Blueprint: How DNA Makes Us Who We Are by Robert Plomin",
            "url": "https://www.amazon.com/dp/0262537982?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Behavioural genetics",
            "url": "https://en.wikipedia.org/wiki/Behavioural_genetics",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-28",
    "dateModified": "2026-01-30"
}
