{
    "id": "bibliography",
    "name": "Bibliography",
    "summary": "A systematic list of sources consulted or referenced in research and knowledge work.",
    "explanation": "A Bibliography is a compiled list of works, including books, articles, websites, and other resources, related to a particular topic or used in a piece of research. The practice of creating bibliographies dates back centuries and remains a cornerstone of scholarly and professional knowledge work.\n\nBibliographies come in several types, each serving different purposes. Enumerative bibliographies provide a straightforward list of works, often organized alphabetically, chronologically, or by subject. Annotated bibliographies add brief summaries and evaluations of each source, making them valuable tools for understanding a field's landscape. Analytical bibliographies go further, examining the physical characteristics and production history of texts, which is particularly relevant in fields like literary studies and history.\n\nAn important distinction exists between a bibliography and a reference list. A reference list includes only the sources directly cited in a work, while a bibliography may also include sources that were consulted but not explicitly cited, or sources recommended for further reading. This makes bibliographies broader and often more useful as research tools.\n\nAnnotated bibliographies are especially powerful as knowledge tools. By writing a brief annotation for each source, you engage more deeply with the material and create a reference that your future self, and others, can use to quickly assess the relevance and quality of sources without re-reading them.\n\nCreating personal bibliographies for research areas you care about is a valuable practice. Rather than relying on ad hoc searches, a curated bibliography for a topic gives you a structured foundation to build upon, helping you identify seminal works, track the development of ideas, and spot gaps in the literature.\n\nBibliographic practices have evolved dramatically over time. From handwritten card catalogs and printed indexes, the field has moved to digital reference managers like Zotero, Mendeley, and EndNote, which automate much of the formatting, organization, and retrieval of sources. These tools integrate with word processors and knowledge management systems, making bibliography creation faster and more reliable than ever before.",
    "tags": [
        "methods",
        "research",
        "writing",
        "academic"
    ],
    "category": "Methods",
    "icon": "FaBookOpen",
    "featured": false,
    "aliases": [
        "Works cited",
        "Reference list",
        "Source list"
    ],
    "relatedConcepts": [
        "citation",
        "reference-management",
        "annotation",
        "literature-notes",
        "reading-list"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Bibliography - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Bibliography",
            "type": "website"
        },
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Personal Knowledge Management Library",
            "url": "https://store.dsebastien.net/product/pkm-library",
            "type": "other"
        },
        {
            "title": "AI Ghostwriter Guide",
            "url": "https://store.dsebastien.net/product/ai-ghostwriter-guide",
            "type": "other"
        }
    ],
    "tutorials": [],
    "books": [],
    "datePublished": "2026-02-22",
    "dateModified": "2026-02-22"
}
