{
    "id": "big-five-personality-traits",
    "name": "Big Five Personality Traits",
    "summary": "The dominant scientific model of personality measuring five broad dimensions: Openness, Conscientiousness, Extraversion, Agreeableness, and Neuroticism (OCEAN).",
    "explanation": "The Big Five personality traits, also known as the Five-Factor Model (FFM) or OCEAN model, represents the most empirically validated framework in personality psychology. Unlike type-based systems, the Big Five measures traits on continuous spectrums.\n\n**The Five Dimensions:**\n\n**1. Openness to Experience**\nReflects imagination, curiosity, and preference for novelty versus routine. High scorers are creative, adventurous, and intellectually curious. Low scorers prefer familiarity, practicality, and conventional approaches.\n\n**2. Conscientiousness**\nMeasures self-discipline, organization, and goal-directed behavior. High scorers are reliable, hardworking, and detail-oriented. Low scorers are more spontaneous, flexible, and may struggle with follow-through.\n\n**3. Extraversion**\nCaptures energy from social interaction and external stimulation. High scorers are outgoing, energetic, and talkative. Low scorers (introverts) prefer quieter, less stimulating environments.\n\n**4. Agreeableness**\nReflects concern for social harmony and cooperation. High scorers are trusting, helpful, and compassionate. Low scorers are more competitive, skeptical, and prioritize self-interest.\n\n**5. Neuroticism (vs. Emotional Stability)**\nMeasures tendency toward negative emotions and emotional reactivity. High scorers experience more anxiety, mood swings, and stress. Low scorers are calm, resilient, and emotionally stable.\n\n**Why it matters:**\n- Strong predictive validity for job performance, health outcomes, and life satisfaction\n- Traits are relatively stable after age 30 but can change with effort\n- Conscientiousness and emotional stability are the strongest predictors of career success\n- Understanding your profile helps with career fit, relationship dynamics, and personal development\n\nThe Big Five is preferred by researchers over MBTI because scores are normally distributed, show good test-retest reliability, and predict real-world outcomes.",
    "tags": [
        "personality",
        "psychology",
        "assessments",
        "self-discovery",
        "science",
        "research",
        "careers"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaChartBar",
    "featured": false,
    "aliases": [
        "OCEAN Model",
        "Five-Factor Model",
        "FFM",
        "Big 5",
        "CANOE"
    ],
    "relatedConcepts": [
        "myers-briggs-type-indicator",
        "introversion",
        "extraversion",
        "character-strengths"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Personality: What Makes You the Way You Are by Daniel Nettle",
            "url": "https://www.amazon.com/dp/0199211426?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Big Five personality traits - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Big_Five_personality_traits",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-16",
    "dateModified": "2026-01-16"
}
