{
    "id": "blogging",
    "name": "Blogging",
    "summary": "The practice of publishing written content on the web to share knowledge, build an audience, or establish expertise.",
    "explanation": "Blogging is a personal and professional publishing practice that has evolved significantly since its origins as simple web logs in the late 1990s. What began as online diaries has grown into a powerful medium for sharing knowledge, building authority, and connecting with audiences worldwide. Modern blogging spans personal journals, niche expertise sites, corporate blogs, and full-scale media operations.\n\nAs a learning tool, blogging embodies the concept of learning in public. Writing about a topic forces deeper understanding, surfaces gaps in knowledge, and creates a public record of growth. Over time, a blog becomes a personal knowledge repository and a portfolio of expertise that can open professional doors.\n\nBuilding an audience through blogging requires consistency, a clear publishing cadence, and attention to search engine optimization basics so that content reaches the people who need it. Monetization models include advertising, affiliate marketing, sponsored content, and using blog content as a gateway to paid products or services. The relationship between blogging and personal knowledge management is reciprocal: a well-maintained knowledge base fuels blog content, while the act of writing for publication deepens and organizes personal knowledge.",
    "tags": [
        "writing",
        "publishing",
        "content-creation",
        "learning-in-public"
    ],
    "category": "Writing & Content Creation",
    "icon": "FaBlog",
    "featured": false,
    "aliases": [
        "Web logging",
        "Blog writing"
    ],
    "relatedConcepts": [
        "newsletter",
        "content-strategy",
        "writing-process",
        "digital-garden",
        "learning-in-public"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "AI Ghostwriter Guide",
            "url": "https://store.dsebastien.net/product/ai-ghostwriter-guide",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-22",
    "dateModified": "2026-02-22"
}
