{
    "id": "body-language",
    "name": "Body Language",
    "summary": "The nonverbal communication expressed through physical behaviors, postures, gestures, and facial expressions.",
    "explanation": "Body language is the form of nonverbal communication in which physical behaviors — rather than words — convey information. It encompasses posture, gestures, facial expressions, eye contact, touch, proxemics (use of space), and even physiological responses like blushing or sweating.\n\nResearch suggests that a significant portion of interpersonal communication is nonverbal. While the often-cited statistic that 93% of communication is nonverbal (from Albert Mehrabian's work) is frequently taken out of context, it is well-established that body language plays a crucial role in conveying emotions, attitudes, and social signals.\n\nBody language operates on multiple levels. Conscious body language includes deliberate gestures like waving, nodding, or pointing. Unconscious body language — such as crossed arms, fidgeting, or postural shifts — often reveals emotional states and attitudes that words may not express. Micro-expressions, lasting only fractions of a second, can betray concealed emotions.\n\nKey categories of body language include: facial expressions (the most universal form — happiness, sadness, anger, surprise, fear, and disgust are recognized across cultures), gestures (which vary significantly by culture), posture (open vs. closed, dominant vs. submissive), eye contact (signaling attention, interest, or dominance), and haptics (touch communication).\n\nUnderstanding body language improves social intelligence and communication effectiveness. It helps in reading others' emotional states, detecting incongruence between words and feelings, building rapport through mirroring, and projecting confidence and trustworthiness. In professional contexts, awareness of body language enhances presentations, negotiations, interviews, and leadership presence.",
    "tags": [
        "communication",
        "psychology",
        "social-psychology",
        "relationships",
        "influence"
    ],
    "category": "Communication",
    "icon": "FaWalking",
    "featured": false,
    "aliases": [
        "Nonverbal communication",
        "Kinesics",
        "Non-verbal cues"
    ],
    "relatedConcepts": [
        "mirroring",
        "chameleon-effect",
        "rapport",
        "thin-slicing",
        "first-impressions",
        "read-the-room",
        "emotional-intelligence"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Body language - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Body_language",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-11",
    "dateModified": "2026-02-11"
}
