{
    "id": "boiling-frog",
    "name": "Boiling Frog",
    "summary": "The metaphor that gradual negative change goes unnoticed until it is too late to react effectively.",
    "explanation": "The boiling frog is a widely known metaphor describing how gradual change can go undetected until a critical threshold is reached. The premise — that a frog placed in slowly heated water will not notice the rising temperature and will eventually be boiled — is scientifically inaccurate, but the metaphorical power of the concept makes it one of the most enduring mental models for understanding the dangers of incremental deterioration.\n\nThe boiling frog principle applies to many domains. In personal life, small daily compromises in health, relationships, or finances can accumulate into serious problems that seem to appear suddenly. In organizations, gradual erosion of culture, standards, or ethical boundaries can lead to dysfunction or scandal. In society, slow-moving threats like environmental degradation or institutional decay can be ignored until they reach crisis proportions.\n\nThe psychological basis for this phenomenon is well-established. Humans are wired to respond to sudden changes (through the orienting response) but are poor at detecting gradual shifts. Hedonic adaptation means we quickly normalize new baselines. Change blindness makes us overlook slow transitions. Normalcy bias leads us to assume that the current trajectory will not lead to disaster.\n\nThe practical antidote to the boiling frog effect involves creating external monitoring systems: regular reviews, defined thresholds for action, comparison against absolute standards rather than recent trends, and cultivating fresh perspectives from outsiders who can see what insiders have normalized.\n\nThe concept is closely related to creeping normality, where gradual changes redefine what is considered acceptable, and the gradually-then-suddenly pattern observed in many systemic failures.",
    "tags": [
        "mental-models",
        "critical-thinking",
        "decision-making",
        "psychology",
        "awareness"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaFire",
    "featured": false,
    "aliases": [
        "Boiling frog syndrome",
        "Slow boil",
        "Frog in hot water"
    ],
    "relatedConcepts": [
        "creeping-normality",
        "slippery-slope",
        "gradually-then-suddenly",
        "normalcy-bias",
        "change-blindness",
        "hedonic-adaptation",
        "tipping-point",
        "gateway-drug"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Boiling frog - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Boiling_frog",
            "type": "website"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/product/clarity-101",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-11",
    "dateModified": "2026-02-11"
}
