{
    "id": "boreout",
    "name": "Boreout",
    "summary": "Chronic workplace disengagement and exhaustion caused by under-stimulation and lack of meaningful work.",
    "explanation": "Boreout is a state of chronic workplace disengagement that paradoxically mirrors burnout in its symptoms but stems from the opposite cause: under-stimulation rather than over-work. While burnout results from excessive demands, boreout develops when employees face insufficient challenges, meaningless tasks, or prolonged boredom.\n\nKey characteristics of boreout include:\n\n**Symptoms**: Fatigue and exhaustion despite light workloads, loss of motivation, feelings of emptiness or purposelessness, decreased self-esteem, anxiety about appearing unproductive, and physical symptoms similar to burnout (headaches, sleep issues, depression).\n\n**Causes**: Being overqualified for one's role, lack of challenging projects, poor job fit, micromanagement that removes autonomy, organizational cultures that value presence over productivity, and unclear or absent career development paths.\n\n**The Boreout Paradox**: Sufferers often feel unable to complain because 'having too little work' seems like a luxury problem. This leads to elaborate strategies to appear busy (stretching tasks, creating make-work) which compounds the psychological damage.\n\n**Distinction from Burnout**: While burnout comes from doing too much, boreout comes from doing too little that matters. Both result in exhaustion, disengagement, and reduced well-being, making them two sides of the same occupational health coin.\n\nAddressing boreout requires either finding more meaningful work within the current role (job crafting), seeking new challenges, or transitioning to a position better matched to one's capabilities and interests. For organizations, it highlights the importance of matching employee skills to appropriate challenges and providing growth opportunities.",
    "tags": [
        "well-being",
        "psychology",
        "productivity",
        "motivation",
        "work",
        "mental-health"
    ],
    "category": "Well-Being & Happiness",
    "icon": "FaRegMeh",
    "featured": false,
    "aliases": [
        "Bore-out",
        "Bore out syndrome",
        "Chronic workplace boredom"
    ],
    "relatedConcepts": [
        "burnout",
        "emotional-burnout",
        "flow",
        "goldilocks-rule",
        "intrinsic-motivation",
        "job-crafting",
        "meaningful-work",
        "self-determination-theory",
        "work-life-balance"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Boreout! Overcoming Workplace Demotivation by Philippe Rothlin and Peter Werder",
            "url": "https://www.amazon.com/dp/0749453397?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Boreout - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Boreout",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-15",
    "dateModified": "2026-01-15"
}
