{
    "id": "box-breathing",
    "name": "Box Breathing",
    "summary": "Breathing technique using equal counts for inhale, hold, exhale, and hold to reduce stress and improve focus.",
    "explanation": "Box Breathing (also called square breathing or four-square breathing) is a powerful stress-reduction technique used by Navy SEALs, first responders, and athletes. It involves breathing in a pattern that forms a \"box\": inhale for 4 counts, hold for 4 counts, exhale for 4 counts, hold empty for 4 counts, then repeat.\n\nHow to practice Box Breathing:\n\n1. Sit comfortably with feet flat on the floor\n2. Inhale slowly through your nose for 4 counts\n3. Hold your breath for 4 counts (don't clamp down, just pause)\n4. Exhale slowly through your mouth for 4 counts\n5. Hold empty for 4 counts\n6. Repeat for 4-5 cycles or until calm\n\nWhy Box Breathing works: The extended exhale and breath holds activate the parasympathetic nervous system (rest-and-digest), counteracting the stress response. The counting provides a mental anchor that interrupts anxious thoughts. The rhythmic pattern creates a sense of control.\n\nBenefits: Reduces cortisol and stress hormones, lowers blood pressure and heart rate, improves focus and mental clarity, manages acute anxiety and panic, enhances performance under pressure.\n\nWhen to use it: Before important meetings or presentations, during high-stress situations, when feeling overwhelmed, before sleep, as a transition between tasks.\n\nVariations: Beginners can start with 3-count cycles. Advanced practitioners may extend to 6 or 8 counts. Some add visualization of drawing a box with each phase.",
    "tags": [
        "breathing",
        "relaxation",
        "stress-management",
        "techniques",
        "well-being"
    ],
    "category": "Well-Being & Happiness",
    "icon": "FaSquare",
    "featured": false,
    "aliases": [
        "Square breathing",
        "Four-square breathing",
        "Tactical breathing",
        "Navy SEAL breathing"
    ],
    "relatedConcepts": [
        "relaxation-response",
        "breathwork",
        "diaphragmatic-breathing",
        "4-7-8-breathing",
        "stress-response",
        "parasympathetic-activation"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Breath by James Nestor",
            "url": "https://www.amazon.com/dp/0735213615?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Box breathing - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Box_breathing",
            "type": "website"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-29",
    "dateModified": "2026-01-29"
}
