{
    "id": "cause-prioritization",
    "name": "Cause Prioritization",
    "summary": "The systematic process of comparing and ranking different cause areas to determine where additional resources can produce the greatest positive impact.",
    "explanation": "Cause prioritization is a core practice within effective altruism that involves systematically evaluating and comparing different cause areas to determine where marginal resources - time, money, talent - can do the most good. Rather than assuming that all worthy causes deserve equal attention, cause prioritization asks the uncomfortable but crucial question: given limited resources, which problems should we focus on first?\n\nThe framework commonly used for cause prioritization evaluates causes along three dimensions, often called the ITN framework:\n\n**Importance (Scale)**: How many people are affected and how deeply? A cause affecting billions of people severely scores higher than one affecting thousands mildly.\n\n**Tractability**: How solvable is the problem? Even extremely important problems may not be worth focusing on if we have no effective interventions. Conversely, highly tractable problems with limited scale may not justify priority attention.\n\n**Neglectedness**: How much attention and resources does the cause already receive? Marginal resources do more good in neglected areas than in well-funded ones, because of diminishing returns.\n\nApplying this framework, the effective altruism community has identified several priority cause areas:\n\n- **Global health and poverty**: Highly tractable with proven interventions, still significantly underfunded relative to scale\n- **Animal welfare**: Enormous scale (trillions of animals affected), highly neglected relative to scope\n- **Existential risk reduction**: Astronomically important if longtermism is valid, extremely neglected\n- **AI safety research**: Growing in importance as AI capabilities advance rapidly\n\nCause prioritization faces several challenges. Comparing fundamentally different types of suffering or value is philosophically contentious. Uncertainty about the effectiveness of interventions in newer cause areas makes comparison difficult. And the framework may systematically undervalue causes that are hard to quantify, such as justice, dignity, or cultural preservation.\n\nDespite these limitations, cause prioritization provides a disciplined alternative to the common approach of choosing causes based on personal connection, cultural salience, or emotional response - factors that often correlate poorly with where additional resources would do the most good.",
    "tags": [
        "ethics",
        "decision-making",
        "problem-solving"
    ],
    "category": "Decision Science",
    "icon": "FaSitemap",
    "featured": false,
    "aliases": [
        "Cause Selection",
        "ITN Framework"
    ],
    "relatedConcepts": [
        "effective-altruism",
        "longtermism",
        "expected-value",
        "scope-insensitivity",
        "earning-to-give",
        "counterfactual-thinking"
    ],
    "relatedNotes": [],
    "references": [
        {
            "title": "Cause prioritization - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Cause_prioritization",
            "type": "website"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/product/clarity-101",
            "type": "other"
        }
    ],
    "articles": [],
    "books": [],
    "tutorials": [],
    "datePublished": "2026-02-08",
    "dateModified": "2026-02-08"
}
