{
    "id": "characteristics-of-good-notes",
    "name": "Characteristics of Good Notes",
    "summary": "The key qualities that make notes valuable, findable, and useful over time, including atomicity, clarity, connectivity, and sufficient context.",
    "explanation": "Understanding what makes a good note is essential for building a knowledge base that remains useful over time. Not all notes are created equal, and the difference between notes that compound in value and notes that become dead weight lies in a set of identifiable characteristics.\n\nFirst, good notes are written in your own words. Copying and pasting text from sources may feel productive, but it bypasses the critical process of synthesis. When you rewrite an idea in your own language, you train your ability to understand and distill information, and you significantly improve memorization and recall. The act of reformulation is itself a thinking exercise.\n\nSecond, good notes are short and concise. Brevity forces clarity. If you cannot express an idea concisely, you may not fully understand it yet. A note that rambles or tries to cover too much becomes difficult to scan, connect, and reuse.\n\nThird, good notes are clear and easy to understand. A note you wrote six months ago should still make sense when you encounter it again. Avoid jargon without explanation, cryptic abbreviations, or assumptions about context that future-you will not share.\n\nFourth, good notes stand on their own and focus on a single idea. This is the principle of atomic notes. Each note should capture one concept, one insight, or one argument. Atomic notes are easier to connect, rearrange, and build upon than monolithic documents that mix multiple concerns.\n\nFifth, good notes are connected to other notes. Isolated notes are nearly as useless as not having notes at all. Links to similar ideas, related concepts, and supporting evidence create a web of knowledge where each note gains meaning from its relationships. Including links to similar and related ideas is what transforms a collection of notes into a thinking tool.\n\nSixth, good notes include references. Noting where an idea came from - the source, the author, the page number, or an example that illustrates the point - preserves the provenance of knowledge and makes it possible to revisit and verify information later.\n\nSeventh, good notes include enough context. Record why you created the note, what you were working on at the time, and why the idea was relevant. This contextual information is easy to forget but invaluable for future understanding and retrieval.\n\nEighth, good notes are associated with Maps of Content (MoCs), which serve as navigational hubs that organize clusters of related notes and provide entry points into different areas of your knowledge base.\n\nFinally, good notes are associated with time through creation and modification dates. Temporal metadata helps you understand the evolution of your thinking and provides useful context for when ideas were captured and last refined.\n\nThe balance between brevity and context is the central tension in note-making. Too brief, and the note lacks the context needed for future use. Too detailed, and it becomes unwieldy and hard to connect. Mastering this balance is a skill that develops with practice, and these characteristics serve as a reliable guide for evaluating and improving the quality of your notes over time.",
    "tags": [
        "principles",
        "note-taking",
        "knowledge-management",
        "best-practices"
    ],
    "category": "Principles",
    "icon": "FaStar",
    "featured": false,
    "aliases": [
        "Good note qualities",
        "Note quality criteria",
        "What makes a good note"
    ],
    "relatedConcepts": [
        "atomic-notes",
        "connected-notes",
        "note-making",
        "evergreen-notes",
        "smart-notes"
    ],
    "relatedNotes": [
        "https://notes.dsebastien.net/30+Areas/33+Permanent+notes/33.02+Content/Characteristics+of+good+notes"
    ],
    "articles": [],
    "references": [
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Personal Knowledge Management Library",
            "url": "https://store.dsebastien.net/product/pkm-library",
            "type": "other"
        },
        {
            "title": "Personal Knowledge Management Coaching",
            "url": "https://store.dsebastien.net/product/pkm-coaching",
            "type": "other"
        },
        {
            "title": "DeveloPassion's Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        },
        {
            "title": "Knowii Voice AI",
            "url": "https://voice-ai.knowii.net",
            "type": "other"
        }
    ],
    "tutorials": [],
    "books": [],
    "datePublished": "2026-02-22",
    "dateModified": "2026-02-22"
}
