{
    "id": "cheap-talk",
    "name": "Cheap Talk",
    "summary": "Communication that costs nothing to produce and carries no commitment, making it unreliable as a signal of true intent.",
    "explanation": "Cheap talk is a concept from game theory and economics describing communication that is costless for the sender and non-binding. Because there is no penalty for lying or exaggerating, cheap talk cannot be taken at face value as a reliable indicator of the speaker's true intentions, knowledge, or capabilities.\n\n**The Core Problem**:\n\nIf words cost nothing to produce and nothing prevents someone from saying whatever serves their interest, rational listeners should discount such messages. A job candidate claiming to be 'the best' costs nothing to say, regardless of ability. A company promising 'the highest quality' bears no cost for the claim itself.\n\n**Cheap Talk vs. Costly Signals**:\n\nThe contrast with costly signaling is instructive. A university degree is expensive and time-consuming, making it a credible signal of ability. A verbal claim of intelligence is free and thus less credible. The key insight: the more costly or difficult a signal is to fake, the more information it conveys.\n\n**When Cheap Talk Can Still Work**:\n\nDespite its limitations, cheap talk is not always meaningless:\n\n1. **Aligned interests**: When both parties benefit from honest communication, cheap talk can be informative\n2. **Reputation effects**: Repeated interactions create accountability—liars are eventually exposed\n3. **Partial credibility**: Even discounted messages can shift beliefs slightly\n4. **Coordination**: Cheap talk can help coordinate when interests partially overlap\n\n**Applications**:\n\n- **Negotiations**: Demands and offers in early stages are often cheap talk\n- **Political promises**: Campaign pledges are classic cheap talk—costless to make, not binding\n- **Advertising**: Vague claims like 'best in class' carry less weight than specific, verifiable claims\n- **Diplomacy**: Threats and assurances are more credible when backed by costly commitments\n\n**Practical Implications**:\n\nUnderstanding cheap talk helps in evaluating claims and promises. Look for costly signals, verifiable commitments, and track records rather than relying on words alone. When making your own communications more credible, attach real costs or commitments to back them up.",
    "tags": [
        "game-theory",
        "economics",
        "communications",
        "signaling",
        "decision-making"
    ],
    "category": "Communication",
    "icon": "FaCommentAlt",
    "featured": false,
    "aliases": [
        "Costless signaling",
        "Non-binding communication"
    ],
    "relatedConcepts": [
        "signaling",
        "costly-signaling-theory",
        "virtue-signaling",
        "game-theory"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "The Strategy of Conflict by Thomas Schelling",
            "url": "https://www.amazon.com/dp/0674840313?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Cheap talk - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Cheap_talk",
            "type": "website"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/product/clarity-101",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-20",
    "dateModified": "2026-02-20"
}
