{
    "id": "circumstellar-habitable-zone",
    "name": "Circumstellar Habitable Zone",
    "summary": "The region around a star where conditions could allow liquid water to exist on a planet's surface.",
    "explanation": "The Circumstellar Habitable Zone (CHZ), also known as the Goldilocks Zone, is the region around a star where an orbiting planet could have surface temperatures that allow liquid water to exist. This concept is fundamental to astrobiology and the search for extraterrestrial life.\n\nKey characteristics:\n\n1. **Temperature range**: Not too close to the star (too hot, water evaporates) and not too far (too cold, water freezes).\n\n2. **Star-dependent**: The zone's location and width vary based on the star's luminosity and temperature. For our Sun, it roughly spans from Venus's orbit to just past Mars.\n\n3. **Dynamic boundaries**: The zone shifts over time as stars evolve and brighten.\n\n4. **Multiple factors**: Beyond distance, habitability depends on atmospheric composition, planetary mass, magnetic fields, and other factors.\n\nThe term 'Goldilocks Zone' became popular because, like the fairy tale, conditions must be 'just right' - not too hot, not too cold. This astronomical concept inspired the broader Goldilocks Principle applied across disciplines.\n\nEarth sits comfortably within our Sun's habitable zone, which has allowed liquid water - and thus life as we know it - to exist for billions of years. The search for exoplanets in their stars' habitable zones is a major focus of modern astronomy.",
    "tags": [
        "astronomy",
        "science",
        "space",
        "principles"
    ],
    "category": "Concepts",
    "icon": "FaGlobeAmericas",
    "featured": false,
    "aliases": [
        "Goldilocks Zone (astronomy)",
        "Habitable Zone",
        "CHZ",
        "Life Zone"
    ],
    "relatedConcepts": [
        "goldilocks-principle"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Circumstellar habitable zone - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Circumstellar_habitable_zone",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-30",
    "dateModified": "2026-01-30"
}
