{
    "id": "citation",
    "name": "Citation",
    "summary": "The practice of formally referencing sources to attribute ideas, enable verification, and maintain intellectual integrity.",
    "explanation": "Citation is the practice of acknowledging the sources of ideas, data, arguments, and quotations used in a piece of work. It serves as the backbone of intellectual honesty, enabling readers to verify claims, trace the lineage of ideas, and give proper credit to original thinkers.\n\nSeveral standardized citation styles exist, each favored by different academic disciplines. APA (American Psychological Association) style is widely used in social sciences. MLA (Modern Language Association) style is common in humanities. Chicago style offers both a notes-bibliography and an author-date system. Harvard referencing is popular in many universities worldwide. Each style specifies precise formatting for how sources should be referenced in text and listed in bibliographies.\n\nCitation serves multiple important purposes. Attribution gives credit to the originator of an idea, respecting intellectual property and academic ethics. Verification allows readers to check the original source and evaluate the evidence for themselves. Building on prior work is fundamental to how knowledge advances; citations create a visible chain showing how new ideas connect to and extend existing ones. Avoiding plagiarism is both an ethical imperative and a practical necessity in academic and professional contexts.\n\nIn the context of personal knowledge management, citation practices take on a different but equally important role. Linking notes to their source materials maintains provenance, ensuring you can always trace an idea back to where you encountered it. This is particularly valuable when ideas are distilled, paraphrased, and recombined across many notes over time.\n\nDigital citation faces unique challenges. Link rot, the gradual decay of web URLs over time, threatens the reliability of online references. Digital Object Identifiers (DOIs) provide a more permanent alternative for academic publications. Web archiving services offer another safeguard against disappearing sources.\n\nDeveloping strong citation habits supports knowledge integrity at every level, from personal note-taking to published research. By consistently recording where ideas come from, you build a more trustworthy and navigable knowledge base.",
    "tags": [
        "methods",
        "research",
        "writing",
        "academic"
    ],
    "category": "Methods",
    "icon": "FaQuoteRight",
    "featured": false,
    "aliases": [
        "Reference",
        "Source citation",
        "Citing sources"
    ],
    "relatedConcepts": [
        "reference-management",
        "bibliography",
        "annotation",
        "literature-notes",
        "provenance"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Citation - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Citation",
            "type": "website"
        },
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Personal Knowledge Management Library",
            "url": "https://store.dsebastien.net/product/pkm-library",
            "type": "other"
        },
        {
            "title": "AI Ghostwriter Guide",
            "url": "https://store.dsebastien.net/product/ai-ghostwriter-guide",
            "type": "other"
        }
    ],
    "tutorials": [],
    "books": [],
    "datePublished": "2026-02-22",
    "dateModified": "2026-02-22"
}
