{
    "id": "coaching",
    "name": "Coaching",
    "summary": "A collaborative process of guiding individuals to develop skills, achieve goals, and unlock their potential through structured conversations and support.",
    "explanation": "Coaching is a structured developmental relationship in which a coach helps a coachee identify goals, overcome obstacles, and develop capabilities. Unlike consulting or training, coaching is fundamentally about drawing out what is already within the individual rather than providing direct answers. The coach acts as a thinking partner, facilitator, and accountability partner.\n\nIt is important to distinguish coaching from related practices. Mentoring typically involves a more experienced person sharing their knowledge and advice, while therapy addresses past experiences and emotional healing. Coaching, by contrast, is primarily future-focused and action-oriented, helping individuals bridge the gap between where they are and where they want to be.\n\nSeveral well-established coaching models provide structure to the coaching process. The GROW model (Goal, Reality, Options, Will) is one of the most widely used, guiding conversations from goal-setting through to commitment. The OSCAR model (Outcome, Situation, Choices, Actions, Review) adds a review component. The Co-Active coaching approach emphasizes the coachee as naturally creative, resourceful, and whole, placing the relationship at the center of the work.\n\nEffective coaching relies on several key skills. Powerful questions are open-ended questions that provoke insight and reflection rather than simple yes-or-no answers. Active listening goes beyond hearing words to understanding meaning, emotion, and what is left unsaid. Accountability structures help the coachee follow through on commitments and maintain momentum toward their goals.\n\nCoaching takes many forms depending on the context. Executive coaching focuses on leadership development and organizational impact. Career coaching helps individuals navigate transitions and professional growth. Life coaching addresses personal fulfillment and work-life integration. Performance coaching targets specific skill development and results improvement.\n\nA key dimension of coaching is the spectrum from directive to non-directive approaches. Directive coaching involves the coach offering suggestions and advice, while non-directive coaching relies entirely on questions and reflection to help the coachee find their own answers. Most effective coaches move fluidly along this spectrum depending on the situation and the coachee's needs.\n\nOrganizations increasingly distinguish between internal coaching (provided by trained managers or internal coaches) and external coaching (provided by professional coaches from outside the organization). Internal coaching is more accessible and cost-effective for broad deployment, while external coaching offers greater confidentiality and objectivity for senior leaders and sensitive situations.",
    "tags": [
        "leadership",
        "personal-growth",
        "communication",
        "development"
    ],
    "category": "Leadership & Management",
    "icon": "FaUserFriends",
    "featured": false,
    "aliases": [
        "Executive coaching",
        "Performance coaching",
        "Life coaching"
    ],
    "relatedConcepts": [
        "mentorship",
        "coaching-kata",
        "coaching-leadership",
        "feedback",
        "growth-mindset"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Coaching - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Coaching",
            "type": "website"
        },
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Journaling Deep Dive Workshop",
            "url": "https://store.dsebastien.net/product/journaling-deep-dive",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-22",
    "dateModified": "2026-02-22"
}
