{
    "id": "cognitive-psychology",
    "name": "Cognitive Psychology",
    "summary": "The scientific study of mental processes including perception, attention, memory, language, problem-solving, and decision-making.",
    "explanation": "Cognitive Psychology is the branch of psychology that focuses on understanding how people perceive, think, remember, and learn. It emerged in the 1950s as a response to behaviorism, which focused solely on observable behavior while ignoring internal mental processes.\n\nKey areas of study include perception (how we interpret sensory information), attention (how we focus mental resources), memory (encoding, storage, and retrieval of information), language (comprehension and production), problem-solving, and decision-making. Cognitive psychologists use experimental methods to investigate these processes and develop theoretical models of how the mind works.\n\nCognitive psychology has practical applications in education, where understanding how people learn helps design better teaching methods. It also informs user experience design, therapy approaches like Cognitive Behavioral Therapy, and artificial intelligence research. The field's insights about memory limitations, attention capacity, and cognitive biases are fundamental to Personal Knowledge Management systems that aim to extend and support human cognition.",
    "tags": [
        "cognition",
        "learning",
        "psychology"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaBrain",
    "featured": false,
    "aliases": [],
    "relatedConcepts": [
        "cognitive-load",
        "working-memory",
        "cognitive-architecture",
        "cognitive-behavioral-therapy",
        "cognitive-flexibility",
        "cognitive-load-theory"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Cognitive psychology - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Cognitive_psychology",
            "type": "website"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "DeveloPassion's Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "books": [],
    "tutorials": [],
    "datePublished": "2026-01-28",
    "dateModified": "2026-01-28"
}
