{
  "id": "cognitive-revolution",
  "name": "Cognitive Revolution",
  "summary": "The 1950s-1960s intellectual movement that shifted psychology from behaviorism to the scientific study of internal mental processes like attention, memory, reasoning, and language.",
  "explanation": "The Cognitive Revolution was a paradigm shift that occurred during the 1950s and 1960s, fundamentally transforming psychology and related disciplines. It marked the transition from behaviorism—which had dominated psychology by focusing only on observable behaviors and rejecting the study of mental states—to cognitive science, which treats the mind as a legitimate subject of scientific inquiry.\n\nSeveral key moments defined this revolution. In 1956, George Miller published \"The Magical Number Seven, Plus or Minus Two,\" demonstrating the limits of working memory. That same year, the MIT Symposium on Information Theory brought together researchers from linguistics, computer science, and psychology. In 1959, Noam Chomsky's devastating review of B.F. Skinner's \"Verbal Behavior\" argued that behaviorist principles could not explain language acquisition, suggesting the mind has innate structures for processing language.\n\nThe revolution drew heavily on information theory, computer science, linguistics, and neuroscience to create the \"mind as computer\" metaphor that became central to cognitive psychology. This computational theory of mind proposed that mental processes could be understood as information processing, similar to how computers process data.\n\nKey figures include Noam Chomsky (linguistics), George Miller (memory), Herbert Simon and Allen Newell (artificial intelligence), and Ulric Neisser, whose 1967 book \"Cognitive Psychology\" gave the new field its name. The revolution paved the way for modern cognitive psychology, artificial intelligence research, and cognitive neuroscience.",
  "tags": ["psychology", "history", "cognitive-science", "philosophy-of-mind"],
  "category": "Psychology & Mental Models",
  "icon": "FaBrain",
  "featured": false,
  "aliases": ["Cognitive Turn"],
  "relatedConcepts": ["cognitive-science", "cognitive-psychology", "behaviorism"],
  "relatedNotes": ["https://notes.dsebastien.net/33+Areas/33+Permanent+notes/33.02+Content/Cognitive+Revolution"],
  "articles": [],
  "books": [
    {
      "title": "The Mind's New Science: A History of the Cognitive Revolution by Howard Gardner",
      "url": "https://www.amazon.com/dp/0465046355?tag=dsebastien00-20"
    }
  ],
  "references": [
    {
      "title": "Cognitive Revolution - Wikipedia",
      "url": "https://en.wikipedia.org/wiki/Cognitive_revolution",
      "type": "website"
    }
  ],
  "tutorials": [],
  "datePublished": "2026-01-28",
  "dateModified": "2026-01-28"
}
