{
    "id": "cognitive-functions",
    "name": "Cognitive Functions (Jungian)",
    "summary": "Carl Jung's theory of eight mental processes describing how people perceive information (Sensing/Intuition) and make decisions (Thinking/Feeling), each with introverted or extraverted orientations.",
    "explanation": "Cognitive functions are the building blocks of Carl Jung's personality theory, later adapted for the MBTI. Unlike simple dichotomies (thinking vs. feeling), the cognitive functions describe eight distinct mental processes that everyone uses to varying degrees.\n\n**The Eight Functions:**\n\n**Perceiving Functions (How we take in information):**\n\n- **Extraverted Sensing (Se)**: Focus on immediate sensory experience, physical environment, and present-moment awareness. Lives in the here and now.\n\n- **Introverted Sensing (Si)**: Internal library of past experiences and sensory impressions. Compares present to past, values tradition and reliability.\n\n- **Extraverted Intuition (Ne)**: Sees possibilities, connections, and patterns in the external world. Generates ideas and explores alternatives.\n\n- **Introverted Intuition (Ni)**: Internal vision of how things will unfold. Synthesizes information into insights and foresees implications.\n\n**Judging Functions (How we make decisions):**\n\n- **Extraverted Thinking (Te)**: Organizes the external world through logic, efficiency, and measurable results. Focuses on systems and outcomes.\n\n- **Introverted Thinking (Ti)**: Builds internal frameworks of logical understanding. Analyzes, categorizes, and seeks precision in ideas.\n\n- **Extraverted Feeling (Fe)**: Attunes to others' emotions and social harmony. Makes decisions based on group values and interpersonal impact.\n\n- **Introverted Feeling (Fi)**: Internal compass of personal values and authenticity. Makes decisions based on deep personal convictions.\n\n**Function Stacks:**\nEveryone has a dominant function (most natural), auxiliary (supporting), tertiary (developing), and inferior (least developed). The specific combination forms personality types.\n\n**Practical value:**\nUnderstanding cognitive functions helps explain why two people of the same MBTI type can seem different, and why certain tasks feel effortless while others require conscious effort. Development involves strengthening weaker functions while leveraging natural strengths.",
    "tags": [
        "personality",
        "psychology",
        "jung",
        "cognition",
        "mental-models",
        "self-awareness",
        "thinking"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaBrain",
    "featured": false,
    "aliases": [
        "Jungian Functions",
        "Jungian Cognitive Functions",
        "Function Stack",
        "Eight Functions"
    ],
    "relatedConcepts": [
        "psychological-types",
        "myers-briggs-type-indicator",
        "introversion",
        "extraversion"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Psychological Types by Carl Jung",
            "url": "https://www.amazon.com/dp/0691150524?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Jungian cognitive functions - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Jungian_cognitive_functions",
            "type": "website"
        },
        {
            "title": "Journaling Deep Dive Workshop",
            "url": "https://store.dsebastien.net/l/knowii-journaling-deep-dive",
            "type": "other"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/l/knowii-clarity-101",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-16",
    "dateModified": "2026-01-16"
}
