{
    "id": "cold-open",
    "name": "Cold Open",
    "summary": "Starting content directly with action, dialogue, or intrigue without preamble, credits, or context-setting.",
    "explanation": "A cold open (also called a teaser or cold opening) is a narrative technique where content begins immediately with action, dialogue, or a compelling scene before any introduction, credits, or context. Borrowed from television and film, it drops the audience directly into the story, creating immediate engagement and curiosity.\n\nIn television, cold opens appear before the title sequence - think of a dramatic scene that hooks viewers before the opening credits roll. The technique works because it bypasses the typical warm-up period, immediately engaging the audience's attention and creating questions they want answered.\n\nWhy cold opens work: they leverage the human need for context (we keep watching to understand what's happening), create immediate emotional engagement, signal confidence in the content's quality, and respect the audience's time by delivering value instantly. They embody 'show, don't tell' by demonstrating value rather than promising it.\n\nCold open variations: starting with dialogue mid-conversation, opening on action already in progress (in media res), beginning with a mysterious or provocative scene, leading with the climax then flashing back, or starting with a bold statement without qualification.\n\nApplications beyond video: articles can cold open with an anecdote or scene, presentations can start with a provocative claim before introducing themselves, emails can lead with the key point before pleasantries, and documentation can begin with the solution before explaining the problem.\n\nThe risk: cold opens require the rest of the content to deliver. They raise expectations and create implicit promises. A cold open followed by weak content feels like a betrayal. Use cold opens when you have genuinely engaging content to deliver, not as a gimmick.",
    "tags": [
        "writing",
        "communication",
        "storytelling",
        "contents"
    ],
    "category": "Writing & Content Creation",
    "icon": "FaBolt",
    "featured": false,
    "aliases": [
        "Teaser",
        "Cold Opening",
        "In Media Res Opening"
    ],
    "relatedConcepts": [
        "opening-strong",
        "hook-context-main-points",
        "storytelling"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Cold open - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Cold_open",
            "type": "website"
        },
        {
            "title": "AI Ghostwriter Guide",
            "url": "https://store.dsebastien.net/l/ai-ghostwriter-guide",
            "type": "other"
        }
    ],
    "books": [],
    "tutorials": [],
    "datePublished": "2026-01-20",
    "dateModified": "2026-01-20"
}
