{
    "id": "communication-as-bonding",
    "name": "Communication as Bonding",
    "summary": "The principle that human communication serves primarily as a mechanism for social connection, emotional bonding, and relationship maintenance rather than as a neutral exchange of objective information.",
    "explanation": "Communication as Bonding is the insight that the primary function of human communication is **social** — building relationships, signaling group membership, and establishing emotional connections — rather than **informational** — exchanging objective facts.\n\nThis principle is built into the word itself: 'communicate' shares its root with 'commune' and 'community.' When people talk, they are primarily communing — connecting socially and emotionally — not exchanging data.\n\nThis explains several phenomena:\n\n- **Why facts are boring**: Objective, unbiased information ('The temperature is 22°C') generates no social engagement. Opinions, judgments, and stories ('Can you believe this weather?') create connection.\n- **Why gossip persists**: Gossip is one of the most common forms of communication not because people are malicious, but because sharing judgments and opinions is an efficient way to signal shared values and strengthen social bonds.\n- **Why people share perspectives, not facts**: When someone tells you about their day, they're not delivering a neutral report. They're sharing their interpretation, seeking validation, and inviting you to stand on their side.\n- **Why validation matters**: People communicate because they want others to acknowledge and affirm their viewpoint. Seeing someone else agree with your perspective signals that they are 'on your side.'\n\nUnderstanding communication as bonding has practical implications:\n\n- **Stop expecting objectivity** from casual conversation — people are bonding, not reporting.\n- **Treat stated opinions as social signals** rather than truth claims.\n- **Recognize validation-seeking** as a normal, healthy social behavior rather than a sign of insecurity.\n- **Be aware** that your own communication is shaped by the same bonding impulse — you share perspectives that connect you to your audience, not necessarily perspectives that are most accurate.",
    "tags": ["communication", "social-psychology", "relationships", "psychology", "perspectives"],
    "category": "Communication",
    "icon": "FaNetworkWired",
    "featured": false,
    "aliases": ["Phatic Communication", "Social Bonding Through Communication"],
    "relatedConcepts": ["empathy", "social-proof", "looking-glass-self", "active-listening"],
    "relatedNotes": [],
    "references": [
        {"title": "Phatic expression - Wikipedia", "url": "https://en.wikipedia.org/wiki/Phatic_expression", "type": "website"},
        {"title": "Useful Not True by Derek Sivers", "url": "https://sive.rs/u", "type": "website"}
    ],
    "articles": [],
    "books": [],
    "tutorials": [],
    "datePublished": "2026-02-11",
    "dateModified": "2026-02-11"
}
