{
    "id": "competency-based-learning",
    "name": "Competency-Based Learning",
    "summary": "An educational approach where learner progress is determined by demonstrated mastery of specific skills and competencies rather than time spent in instruction.",
    "explanation": "Competency-based learning (CBL) is an approach to education and training that focuses on what learners can demonstrate rather than how long they study. Instead of advancing through a curriculum based on hours spent in a classroom or completing a fixed schedule, learners progress by proving they have mastered specific, clearly defined skills and knowledge areas.\n\nThe core principles of CBL include several key elements. Clear competency definitions specify exactly what learners need to know and be able to do, often expressed as measurable learning outcomes. Flexible pacing allows learners who already possess certain skills to move quickly through familiar material while spending more time on challenging areas. Multiple assessment methods recognize that competency can be demonstrated in various ways, including tests, projects, portfolios, performances, and real-world applications.\n\nThe fundamental shift in CBL is from seat-time to mastery-based progression. Traditional education assumes that spending a fixed amount of time on a subject (a semester, a school year) produces adequate learning. CBL reverses this assumption: time becomes the variable while mastery becomes the constant. Every learner is expected to achieve the same level of competency, but the time required may differ significantly from person to person.\n\nCBL has found strong applications in professional development and corporate training. Organizations use competency frameworks to define the skills required for specific roles, identify gaps in their workforce, and design targeted training programs. Certifications in fields like IT, healthcare, and project management are inherently competency-based, requiring candidates to demonstrate specific skills regardless of how they acquired them.\n\nCompetency frameworks and rubrics are essential tools in CBL. Frameworks organize competencies into domains and levels, providing a clear map of what proficiency looks like at each stage. Rubrics define the criteria and standards for evaluating whether a competency has been achieved, ensuring consistent and transparent assessment across different evaluators and contexts.\n\nCBL is closely related to mastery learning, which holds that all students can achieve high levels of learning given sufficient time and appropriate instruction. It also connects to self-directed learning, as CBL often empowers learners to choose their own paths, resources, and pace. Deliberate practice supports CBL by providing the focused, feedback-rich practice needed to develop competencies to the required level.\n\nOne of the most significant benefits of CBL is its support for personalized learning paths. Because learners progress based on demonstrated mastery rather than a fixed schedule, each learner's journey through the material can be unique. This personalization improves engagement, reduces frustration for advanced learners, and provides additional support for those who need it, making education more equitable and effective.",
    "tags": [
        "learning",
        "education",
        "assessment",
        "mastery"
    ],
    "category": "Learning & Education",
    "icon": "FaAward",
    "featured": false,
    "aliases": [
        "CBL",
        "Mastery-based education",
        "Competency-based education"
    ],
    "relatedConcepts": [
        "mastery-learning",
        "self-directed-learning",
        "deliberate-practice",
        "blooms-taxonomy"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "DeveloPassion's Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-22",
    "dateModified": "2026-02-22"
}
