{
    "id": "computational-thinking",
    "name": "Computational Thinking",
    "summary": "A problem-solving approach that uses computer science principles like decomposition, pattern recognition, abstraction, and algorithmic design to tackle complex challenges.",
    "explanation": "Computational thinking, as popularized by Jeannette Wing in her influential 2006 paper, is a fundamental skill for everyone, not just computer scientists. It involves solving problems, designing systems, and understanding human behavior by drawing on the principles of computer science.\n\nThe four pillars of computational thinking are:\n\n- **Decomposition**: Breaking a complex problem into smaller, more manageable sub-problems. Rather than being overwhelmed by a large challenge, decomposition allows you to address each piece individually and systematically.\n- **Pattern recognition**: Identifying similarities, trends, and regularities within and across problems. Recognizing patterns allows you to apply known solutions to new but structurally similar situations.\n- **Abstraction**: Focusing on the essential information while filtering out irrelevant details. Abstraction helps create models and representations that capture what matters without getting lost in complexity.\n- **Algorithmic thinking**: Designing clear, step-by-step procedures to solve a problem or achieve a goal. This involves defining precise instructions that can be followed consistently to produce the desired result.\n\nWhile these skills are foundational to programming, their value extends far beyond writing code. Scientists use computational thinking to model complex phenomena. Educators apply it to structure learning experiences. Business professionals use it to optimize processes and make data-driven decisions. Even everyday activities like planning a trip, organizing a kitchen, or debugging a household problem benefit from computational thinking.\n\nComputational thinking is increasingly recognized as a core literacy alongside reading, writing, and arithmetic. Many education systems worldwide now include it in their curricula, acknowledging that the ability to think systematically about problems is essential in an increasingly complex and technology-driven world.",
    "tags": [
        "thinking",
        "problem-solving",
        "computer-science",
        "education"
    ],
    "category": "Thinking",
    "icon": "FaLaptopCode",
    "featured": false,
    "aliases": [
        "Algorithmic thinking",
        "CT"
    ],
    "relatedConcepts": [
        "first-principles",
        "decomposition",
        "abstraction"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Computational thinking - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Computational_thinking",
            "type": "website"
        },
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/product/clarity-101",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-22",
    "dateModified": "2026-02-22"
}
