{
    "id": "company-culture",
    "name": "Company Culture",
    "summary": "The shared values, beliefs, behaviors, and practices that define how an organization operates and what it prioritizes.",
    "explanation": "Company culture is the collective personality of an organization - the unwritten rules, shared values, and behavioral norms that shape how work gets done. It's often described as 'how we do things here' and encompasses everything from decision-making processes to communication styles to what gets celebrated and what gets punished.\n\nLayers of culture: artifacts (visible elements like office design, dress code, rituals), espoused values (official statements of values and priorities), and underlying assumptions (unconscious beliefs that truly drive behavior). Real culture lives in the third layer, which often differs from official proclamations.\n\nCulture manifests in: how decisions get made (consensus vs. hierarchy), how conflict is handled (avoided vs. addressed), what gets rewarded (results vs. effort, individual vs. team), communication patterns (formal vs. informal, open vs. guarded), tolerance for risk and failure, work-life boundaries, and treatment of hierarchy and authority.\n\nWhy culture matters: it determines who thrives and who struggles, shapes strategy execution (culture eats strategy for breakfast - attributed to Peter Drucker), affects retention and recruitment, influences ethical behavior, and impacts customer experience. Strong culture aligns behavior without constant management; weak or toxic culture creates friction and dysfunction.\n\nCulture change is notoriously difficult because: it lives in habits and assumptions, not documents; leaders must model it consistently; it requires changing systems, not just words; and subcultures within organizations may resist. For knowledge workers, understanding company culture means: observing what actually gets rewarded, learning unwritten rules quickly, and assessing culture fit before joining organizations.",
    "tags": [
        "businesses",
        "leadership",
        "organizations"
    ],
    "category": "Leadership & Management",
    "icon": "FaBuilding",
    "featured": false,
    "aliases": [
        "Corporate Culture",
        "Organizational Culture",
        "Workplace Culture"
    ],
    "relatedConcepts": [
        "knowledge-work-culture",
        "psychological-safety"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Organizational culture - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Organizational_culture",
            "type": "website"
        }
    ],
    "books": [],
    "tutorials": [],
    "datePublished": "2026-01-20",
    "dateModified": "2026-01-20"
}
