{
    "id": "conformity-bias",
    "name": "Conformity Bias",
    "summary": "The tendency to align one's beliefs, attitudes, and behaviors with the group, even when the group is obviously wrong.",
    "explanation": "Conformity bias is a powerful social psychological phenomenon where individuals change their beliefs or behaviors to match those of the group around them. This tendency was famously demonstrated in Solomon Asch's classic experiments in the 1950s, where participants would give incorrect answers about line lengths when confederates unanimously gave wrong answers. Remarkably, about 75% of participants conformed at least once.\n\nConformity has deep evolutionary roots, as group cohesion historically aided survival. However, in modern contexts, it can undermine collective intelligence and contribute to problematic group dynamics like groupthink and echo chambers.\n\nThere are two main types of conformity:\n\n1. **Informational conformity**: When we believe the group knows better than we do and use their judgment as a source of information\n2. **Normative conformity**: When we conform to fit in and avoid social rejection, even if we privately disagree\n\nAsch's research revealed important nuances: the presence of just one dissenter significantly reduces conformity (demonstrating that unanimity matters), and people's private answers often differ from their public statements (showing the gap between public compliance and private beliefs).\n\nUnderstanding conformity bias is crucial for maintaining independent thinking in group settings, designing better decision-making processes, and recognizing when social pressure might be distorting our judgment.",
    "tags": [
        "psychology",
        "cognitive-biases",
        "social-psychology",
        "decision-making",
        "group-dynamics"
    ],
    "category": "Cognitive Biases",
    "icon": "FaBrain",
    "featured": false,
    "aliases": [
        "Bandwagon Effect",
        "Social Conformity",
        "Asch Conformity"
    ],
    "relatedConcepts": [
        "social-proof",
        "groupthink",
        "cognitive-biases"
    ],
    "relatedNotes": [
        "https://notes.dsebastien.net/30+Areas/33+Permanent+notes/33.02+Content/Conformity+Bias"
    ],
    "articles": [],
    "books": [
        {
            "title": "Influence by Robert Cialdini",
            "url": "https://www.amazon.com/dp/006124189X?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Conformity - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Conformity",
            "type": "website"
        },
        {
            "title": "Asch conformity experiments - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Asch_conformity_experiments",
            "type": "website"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/product/clarity-101",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-28",
    "dateModified": "2026-01-28"
}
