{
    "id": "conspicuous-consumption",
    "name": "Conspicuous Consumption",
    "summary": "Spending on goods and services primarily to display wealth and social status rather than for practical utility.",
    "explanation": "Conspicuous consumption, a term coined by economist Thorstein Veblen in 1899, describes spending on goods and services primarily to signal wealth and status rather than for their practical utility. The key insight is that much consumption is about display rather than use - the purpose of a luxury car isn't just transportation, it's to demonstrate that you can afford a luxury car. Veblen observed that the wealthy engage in ostentatious displays of leisure and consumption to distinguish themselves from lower classes. As wealth spreads, these displays must escalate to maintain distinctiveness - driving the endless cycle of luxury goods, status symbols, and lifestyle inflation. Modern manifestations include designer brands, luxury vehicles, exclusive memberships, premium experiences, and visible consumption on social media. The phenomenon creates several problems: wasteful spending on status rather than well-being, treadmill dynamics where everyone must spend more just to maintain relative position, and environmental costs of producing goods valued for display rather than function. Understanding conspicuous consumption helps recognize when spending serves genuine needs versus status anxiety, and why simplicity can be both financially and psychologically beneficial.",
    "tags": [
        "economics",
        "psychology",
        "status",
        "consumerism",
        "behaviors"
    ],
    "category": "Business & Economics",
    "icon": "FaCrown",
    "featured": false,
    "aliases": [
        "Status consumption",
        "Veblen goods",
        "Luxury consumption"
    ],
    "relatedConcepts": [
        "signaling",
        "costly-signaling-theory",
        "status-games",
        "hedonic-adaptation",
        "money-game-vs-status-game"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "The Theory of the Leisure Class by Thorstein Veblen",
            "url": "https://www.amazon.com/dp/1614279713?tag=dsebastien00-20"
        },
        {
            "title": "Spent: Sex, Evolution, and Consumer Behavior by Geoffrey Miller",
            "url": "https://www.amazon.com/dp/0143117238?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Conspicuous consumption - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Conspicuous_consumption",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-13",
    "dateModified": "2026-01-13"
}
