{
    "id": "consciousness",
    "name": "Consciousness",
    "summary": "The state of awareness of one's own existence, sensations, thoughts, and surroundings.",
    "explanation": "Consciousness is the subjective experience of being aware - of having thoughts, sensations, perceptions, and a sense of self. It is what philosopher Thomas Nagel described as 'what it is like' to be something. When you see the color red, feel pain, or contemplate an idea, you are experiencing consciousness.\n\n**Key Aspects of Consciousness:**\n\n- **Phenomenal consciousness**: The subjective, qualitative 'feel' of experiences (qualia)\n- **Access consciousness**: Information that is available for reasoning, speech, and behavioral control\n- **Self-consciousness**: Awareness of oneself as a distinct entity with a continuous identity\n- **Intentionality**: The 'aboutness' of mental states - thoughts are about something\n\n**The Hard Problem of Consciousness:**\n\nPhilosopher David Chalmers distinguished between the 'easy problems' of consciousness (explaining cognitive functions like attention, integration, and verbal reports) and the 'hard problem' - explaining why and how physical processes give rise to subjective experience. Why does processing information feel like anything at all? This remains one of the deepest mysteries in philosophy and neuroscience.\n\n**Major Theories:**\n\n- **Dualism**: Mind and body are fundamentally different substances (Descartes)\n- **Materialism/Physicalism**: Consciousness emerges from or is identical to physical brain processes\n- **Global Workspace Theory**: Consciousness arises when information is broadcast widely across brain networks\n- **Integrated Information Theory**: Consciousness corresponds to integrated information (phi) in a system\n- **Higher-Order Theories**: Consciousness requires mental states that represent other mental states\n- **Panpsychism**: Consciousness is a fundamental feature of reality, present to some degree in all matter\n\n**Applications and Relevance:**\n\nUnderstanding consciousness has implications for artificial intelligence, ethics, medicine (disorders of consciousness), and personal development. Practices like meditation can transform one's relationship with consciousness, revealing its constructed nature and cultivating present-moment awareness.",
    "tags": [
        "philosophies",
        "psychology",
        "cognition",
        "neuroscience",
        "phenomenology"
    ],
    "category": "Philosophy & Wisdom",
    "icon": "FaBrain",
    "featured": false,
    "aliases": [
        "Awareness",
        "Sentience",
        "Subjective experience"
    ],
    "relatedConcepts": [
        "chinese-room-argument",
        "cogito-ergo-sum",
        "extended-mind-thesis",
        "metacognition",
        "mindfulness"
    ],
    "relatedNotes": [
        "https://notes.dsebastien.net/30+Areas/33+Permanent+notes/33.02+Content/Consciousness"
    ],
    "articles": [],
    "books": [
        {
            "title": "Consciousness Explained by Daniel Dennett",
            "url": "https://www.amazon.com/dp/0316180661?tag=dsebastien00-20"
        },
        {
            "title": "The Conscious Mind by David Chalmers",
            "url": "https://www.amazon.com/dp/0195117891?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Consciousness - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Consciousness",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-28",
    "dateModified": "2026-01-30"
}
