{
    "id": "costly-signaling-theory",
    "name": "Costly Signaling Theory",
    "summary": "The principle that signals must be expensive or hard to fake to credibly communicate information about the signaler.",
    "explanation": "Costly signaling theory, also known as the handicap principle in biology, explains why effective signals tend to be expensive, difficult, or risky. The core insight is that cheap signals are worthless because anyone can send them regardless of their actual qualities. For a signal to reliably convey information, it must be costly enough that only those with the genuine underlying quality can afford to send it. The classic biological example is the peacock's tail: it's metabolically expensive, makes the bird more visible to predators, and harder to escape - yet these very costs make it an honest signal of genetic fitness. Only healthy, well-fed peacocks can afford such elaborate displays. In human society, costly signals appear everywhere. Education signals ability partly because it requires years of effort and foregone income. Luxury goods signal wealth precisely because they're expensive. Elaborate wedding ceremonies signal commitment through their cost. Initiation rituals for groups signal loyalty through their difficulty. The theory predicts that as a signal becomes cheaper, it loses its informational value and may be replaced by costlier alternatives - explaining credential inflation and escalating status displays.",
    "tags": [
        "economics",
        "evolutionary-psychology",
        "game-theory",
        "communications",
        "behaviors"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaGem",
    "featured": false,
    "aliases": [
        "Handicap principle",
        "Honest signaling",
        "Costly signals"
    ],
    "relatedConcepts": [
        "signaling",
        "conspicuous-consumption",
        "status-games",
        "game-theory"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "The Handicap Principle by Amotz Zahavi",
            "url": "https://www.amazon.com/dp/0195129148?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Handicap principle - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Handicap_principle",
            "type": "website"
        },
        {
            "title": "Costly signaling theory - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Costly_signaling_theory_in_evolutionary_psychology",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-13",
    "dateModified": "2026-01-29"
}
