{
  "id": "countersignaling",
  "name": "Countersignaling",
  "summary": "Deliberately avoiding or downplaying signals to demonstrate that one doesn't need them.",
  "explanation": "Countersignaling is the strategic decision to not signal, or to signal less than expected, as a way of demonstrating superior status or ability. The logic is subtle: while those of medium status must signal to distinguish themselves from the low-status, those of genuinely high status can afford not to signal because their position is secure or obvious. A billionaire wearing simple clothes countersignals wealth - the display itself signals that they're beyond needing to prove anything. A world-class expert speaking simply countersignals expertise - only those unsure of their knowledge need to use jargon. A confident person remaining calm in confrontation countersignals strength. Countersignaling works because the absence of expected signals itself becomes informative. When everyone at a certain level signals, not signaling sets you apart as being at a higher level. However, countersignaling only works when the underlying quality is already somewhat known or can be inferred. The tech billionaire in a t-shirt is recognized; an unknown person in the same clothes is just underdressed. This creates an interesting dynamic where the same behavior (not signaling) can indicate either very high or very low status, depending on context.",
  "tags": [
    "social-psychology",
    "communications",
    "status",
    "game-theory",
    "behaviors"
  ],
  "category": "Psychology & Mental Models",
  "icon": "FaEyeSlash",
  "featured": false,
  "aliases": [
    "Counter-signaling",
    "Reverse signaling",
    "Anti-signaling"
  ],
  "relatedConcepts": [
    "signaling",
    "costly-signaling-theory",
    "status-games",
    "conspicuous-consumption"
  ],
  "relatedNotes": [],
  "articles": [],
  "books": [],
  "references": [
    {
      "title": "Countersignaling - Wikipedia",
      "url": "https://en.wikipedia.org/wiki/Countersignaling",
      "type": "website"
    }
  ],
  "tutorials": [],
  "datePublished": "2026-01-13",
  "dateModified": "2026-01-13"
}
