{
    "id": "creeping-normality",
    "name": "Creeping Normality",
    "summary": "The way a major change is accepted as normal if it happens gradually through small, often unnoticeable increments.",
    "explanation": "Creeping normality, a term popularized by Jared Diamond in his book Collapse, describes the process by which a major change can be accepted as normal if it happens slowly through incremental steps. Each small shift seems insignificant on its own, so no single step triggers alarm or resistance, but the cumulative effect over time can be dramatic.\n\nThe concept explains how societies, organizations, and individuals can drift into situations they would never have accepted if presented with the full change all at once. Environmental degradation, erosion of civil liberties, declining organizational standards, and deteriorating personal habits all follow this pattern. The key mechanism is that each new state becomes the reference point for evaluating the next change, rather than comparing against the original baseline.\n\nCreeping normality is driven by several psychological processes. Anchoring shifts our reference points gradually. Hedonic adaptation helps us acclimate to each new state. Normalcy bias makes us assume that the current situation, however degraded, is normal. The availability heuristic means we compare against recent experience rather than distant baselines.\n\nDiamond illustrated the concept through the environmental collapse of Easter Island, where gradual deforestation over generations meant that each generation grew up with fewer trees and considered that as the norm. By the time the last trees were cut, the islanders had long since normalized a deforested landscape.\n\nCountering creeping normality requires maintaining awareness of original baselines, establishing absolute standards rather than relative ones, periodically stepping back for a broader perspective, and inviting external observers who can see the cumulative change that insiders have normalized. Regular journaling, data tracking, and historical comparison are practical tools for detecting creeping normality in your own life and work.",
    "tags": [
        "mental-models",
        "critical-thinking",
        "psychology",
        "decision-making",
        "awareness"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaWater",
    "featured": false,
    "aliases": [
        "Landscape amnesia",
        "Shifting baseline syndrome",
        "Normalization of deviance"
    ],
    "relatedConcepts": [
        "boiling-frog",
        "slippery-slope",
        "normalcy-bias",
        "overton-window",
        "gradually-then-suddenly",
        "change-blindness",
        "hedonic-adaptation",
        "gateway-drug"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Collapse by Jared Diamond",
            "url": "https://www.amazon.com/dp/0143117009?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Creeping normality - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Creeping_normality",
            "type": "website"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/product/clarity-101",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-11",
    "dateModified": "2026-02-11"
}
