{
    "id": "critical-reading",
    "name": "Critical Reading",
    "summary": "The practice of actively analyzing and evaluating text to assess its arguments, evidence, and assumptions rather than passively absorbing information.",
    "explanation": "Critical reading is the disciplined practice of engaging deeply with text to evaluate its arguments, identify its assumptions, assess the quality of its evidence, and form independent judgments about its claims. It goes beyond simply understanding what a text says to examining how it says it, why it says it, and whether its conclusions are warranted by its reasoning.\n\nThe foundation of critical reading is active questioning. Rather than accepting an author's claims at face value, a critical reader constantly asks: What is the main argument? What evidence supports it? Are there unstated assumptions? What alternative explanations exist? Does the logic hold up? Who benefits from this perspective? What is missing from the analysis? These questions transform reading from a passive reception of information into an active dialogue with the text.\n\nSeveral specific techniques support critical reading. Identifying logical fallacies - such as straw man arguments, false dichotomies, appeals to authority, slippery slope reasoning, and ad hominem attacks - helps reveal weaknesses in an argument that might otherwise go unnoticed. Evaluating evidence quality involves considering sample sizes, methodology, potential confounds, and whether the evidence actually supports the conclusions drawn from it. Considering alternative perspectives means deliberately seeking out viewpoints that challenge the text's position.\n\nCritical reading is distinct from both passive reading and active reading, though it builds on both. Passive reading involves absorbing text without deliberate engagement - reading words without questioning them. Active reading involves techniques like highlighting, note-taking, and summarizing to improve comprehension and retention. Critical reading adds an evaluative layer: not just understanding and remembering what the author says, but judging the strength, validity, and significance of their claims.\n\nAnnotation is a powerful tool for critical reading. Writing marginal notes, underlining key claims, marking questionable assertions, noting connections to other sources, and recording your own reactions creates a visible record of your engagement with the text. This practice forces you to slow down and articulate your responses, which deepens both understanding and evaluation.\n\nStructured reading methods provide frameworks for critical engagement. The SQ3R method (Survey, Question, Read, Recite, Review) builds questioning and reflection into the reading process. Adler and Van Doren's levels of reading, described in their classic work on reading well, progress from elementary reading through inspectional and analytical reading to syntopical reading, with each level adding more critical depth. These structured approaches are especially valuable when tackling difficult or unfamiliar material.\n\nCritical reading skills directly support better note-making and knowledge creation. When you read critically, your notes capture not just what the author said but your evaluation of it - where you agree, where you disagree, what questions remain, and how the ideas connect to your existing knowledge. This evaluative layer transforms your notes from mere records of consumption into seeds of original thought, making your personal knowledge management system a space for genuine intellectual engagement rather than passive storage.",
    "tags": [
        "techniques",
        "reading",
        "critical-thinking",
        "learning"
    ],
    "category": "Techniques",
    "icon": "FaEye",
    "featured": false,
    "aliases": [
        "Analytical reading",
        "Evaluative reading"
    ],
    "relatedConcepts": [
        "active-reading",
        "analytical-reading",
        "deep-reading",
        "source-criticism",
        "annotation"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Critical reading - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Critical_reading",
            "type": "website"
        },
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "DeveloPassion's Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-22",
    "dateModified": "2026-02-22"
}
