{
    "id": "cryptomnesia",
    "name": "Cryptomnesia",
    "summary": "A memory bias where a person mistakenly believes a thought or idea is their own original creation, when it was actually previously encountered and forgotten.",
    "explanation": "Cryptomnesia, derived from the Greek words for 'hidden' (kryptos) and 'memory' (mneme), is a cognitive phenomenon where forgotten memories resurface without being recognized as memories. The person experiencing cryptomnesia genuinely believes they have generated an original idea, when in reality they are unconsciously recalling something they previously read, heard, or experienced.\n\nThis memory bias occurs because our brains do not always accurately track the source of information. When we encounter an idea, our memory may retain the content while losing the contextual details about where and when we learned it. Later, when this information resurfaces, it feels like a novel insight rather than a retrieved memory.\n\nOne of the most famous cases of cryptomnesia involved George Harrison's 1970 song 'My Sweet Lord.' A court found that the song's melody unconsciously plagiarized 'He's So Fine' by The Chiffons (1962). Harrison did not intentionally copy the song, but the court ruled that he had 'subconsciously plagiarized' the melody, having heard it years earlier. This case established an important legal precedent for unconscious copyright infringement.\n\nOther notable examples include:\n- Nietzsche's passage in 'Thus Spoke Zarathustra' that closely mirrored a story he had read as a child\n- Helen Keller's story 'The Frost King,' which unknowingly reproduced Margaret Canby's 'The Frost Fairies'\n- Robert Louis Stevenson's admission that a key plot device in 'Treasure Island' came from a forgotten source\n\nSeveral factors increase the likelihood of cryptomnesia:\n- Time passage: The longer the interval between exposure and recall, the more likely source information will be forgotten\n- Shallow processing: Ideas encountered without deep engagement are more likely to lose their source attribution\n- Similar thinking styles: When an external idea aligns closely with your own way of thinking, it becomes harder to distinguish from your own thoughts\n- Frequent exposure: Ideas encountered multiple times across different contexts become difficult to trace to their origin\n\nTo guard against cryptomnesia in creative and academic work:\n- Keep detailed notes with sources for all ideas you encounter\n- Maintain a clear distinction between your notes and your own thoughts\n- When an idea feels 'original,' actively search for similar existing work before publishing\n- Use plagiarism detection tools as a safety check\n- Cultivate awareness that your 'brilliant insight' may have external origins\n- Allow time between consuming content and creating, giving yourself space to distinguish sources\n- When in doubt, cite liberally and acknowledge potential influences",
    "tags": [
        "cognitive-biases",
        "memory",
        "psychology",
        "creativity",
        "intellectual-property"
    ],
    "category": "Cognitive Biases",
    "icon": "FaBrain",
    "featured": false,
    "aliases": [
        "Unconscious Plagiarism",
        "Inadvertent Plagiarism"
    ],
    "relatedConcepts": [
        "source-confusion",
        "memory-bias"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Cryptomnesia - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Cryptomnesia",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-30",
    "dateModified": "2026-01-18"
}
