{
    "id": "cultural-relativism",
    "name": "Cultural Relativism",
    "summary": "The principle that beliefs, values, customs, and practices should be understood and evaluated relative to their own cultural context rather than judged against the standards of another culture.",
    "explanation": "Cultural relativism is the idea that a person's beliefs and activities should be understood in terms of their own culture, rather than be judged against the criteria of another. What seems obviously wrong, rude, or absurd in one culture may be perfectly normal, polite, or logical in another.\n\nFor example, in some cultures, yelling a casual greeting from across the room signals warmth and familiarity. In others, the same behavior would be considered disrespectful — only a formal, quiet welcome at the door shows proper hospitality. Neither is objectively 'correct'; each makes sense within its own cultural framework.\n\nThis principle has important practical implications:\n\n- **Self-awareness**: Recognizing that your own deeply held values and norms are culturally constructed — not universal truths — is a powerful step toward intellectual humility.\n- **Empathy**: Understanding that people from different backgrounds operate from different but internally coherent frameworks reduces judgment and increases compassion.\n- **Flexibility**: Accepting cultural relativism allows you to adopt useful practices from other cultures without being limited by the assumptions of your own.\n\nCultural relativism does not mean that all practices are equally moral or that nothing can be criticized. Rather, it means that understanding must come before judgment, and that what feels like 'obvious truth' is often just 'local convention.'",
    "tags": [
        "culture",
        "philosophy",
        "empathy",
        "perspectives",
        "anthropology"
    ],
    "category": "Philosophy & Wisdom",
    "icon": "FaCompass",
    "featured": false,
    "aliases": [],
    "relatedConcepts": [
        "empathy",
        "epistemic-humility"
    ],
    "relatedNotes": [],
    "references": [
        {
            "title": "Cultural relativism - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Cultural_relativism",
            "type": "website"
        },
        {
            "title": "Useful Not True by Derek Sivers",
            "url": "https://sive.rs/u",
            "type": "website"
        }
    ],
    "articles": [],
    "books": [],
    "tutorials": [],
    "datePublished": "2026-02-11",
    "dateModified": "2026-02-11"
}
