{
    "id": "deep-work-schedule",
    "name": "Deep Work Schedule",
    "summary": "A systematic approach to scheduling protected time for cognitively demanding work.",
    "explanation": "A deep work schedule is a deliberate system for protecting and scheduling time for cognitively demanding, high-value work. Cal Newport identifies four philosophies: Monastic (eliminating all shallow obligations), Bimodal (extended deep periods alternating with normal life), Rhythmic (daily deep work at consistent times), and Journalistic (fitting deep work into available gaps). Key elements include: fixed time blocks for deep work, rituals that signal deep work mode, environmental changes that support focus, and protection from interruptions. The schedule turns deep work from aspiration into habit. Effective schedules account for: energy rhythms (scheduling demanding work at peak times), meeting realities (batching or blocking meetings), and individual constraints. For knowledge workers, developing a deep work schedule means: identifying when deep work happens best, protecting those times consistently, and making deep work a structural feature of the week, not just an intention.",
    "tags": [
        "focus",
        "productivity",
        "scheduling",
        "deep-work",
        "routines"
    ],
    "category": "Techniques",
    "icon": "FaCalendarAlt",
    "featured": false,
    "aliases": [
        "Focus schedule",
        "Deep work routine",
        "Focused work schedule"
    ],
    "relatedConcepts": [
        "deep-work",
        "time-blocking",
        "calendar-blocking",
        "maker-vs-manager-schedule",
        "focus-protection",
        "routines"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Deep Work by Cal Newport",
            "url": "https://amzn.to/3Dp09NT",
            "type": "book"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
