{
    "id": "defense-mechanisms",
    "name": "Defense Mechanisms",
    "summary": "Unconscious psychological strategies used by the ego to protect itself from anxiety and distressing thoughts or feelings.",
    "explanation": "Defense mechanisms are unconscious psychological strategies that the mind employs to protect itself from anxiety, conflict, and threats to self-esteem. First systematically described by Sigmund Freud and later expanded by his daughter Anna Freud, these mechanisms operate automatically and outside conscious awareness.\n\n## Common Defense Mechanisms\n\n### Primitive (Immature) Defenses\n\n**Denial**: Refusing to acknowledge reality or facts that are too uncomfortable to accept. Example: A person with a serious health condition insisting nothing is wrong.\n\n**Projection**: Attributing one's own unacceptable thoughts or feelings to others. Example: An angry person accusing others of being hostile.\n\n**Regression**: Reverting to behaviors characteristic of an earlier developmental stage. Example: An adult throwing tantrums when stressed.\n\n**Acting Out**: Expressing unconscious emotional conflicts through actions rather than words. Example: Slamming doors instead of discussing frustration.\n\n### Mature Defenses\n\n**Sublimation**: Channeling unacceptable impulses into socially acceptable activities. Example: Directing aggressive energy into competitive sports.\n\n**Humor**: Using comedy to express difficult feelings indirectly. Example: Making jokes about a painful situation.\n\n**Suppression**: Consciously choosing to postpone attention to a distressing thought. Example: Deciding to worry about a problem after an important meeting.\n\n### Neurotic Defenses\n\n**Repression**: Unconsciously blocking unacceptable thoughts from awareness. Example: Forgetting traumatic childhood events.\n\n**Rationalization**: Creating logical justifications for irrational behavior. Example: Claiming you didn't want the job you didn't get.\n\n**Displacement**: Redirecting emotions from the original source to a safer target. Example: Yelling at family after a frustrating day at work.\n\n**Intellectualization**: Using abstract thinking to distance from emotional content. Example: Discussing a personal tragedy in detached, clinical terms.\n\n## Modern Understanding\n\nWhile rooted in psychoanalytic theory, defense mechanisms remain clinically relevant. Modern psychology recognizes them as adaptive strategies that can become problematic when overused or when they prevent healthy emotional processing. Self-awareness of these patterns can support psychological growth and more authentic relationships.",
    "tags": [
        "psychology",
        "psychoanalysis",
        "coping",
        "unconscious",
        "emotions",
        "freud"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaShieldAlt",
    "featured": false,
    "aliases": [
        "Ego Defenses",
        "Psychological Defenses",
        "Defense Mechanism"
    ],
    "relatedConcepts": [
        "cognitive-distortions"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "The Ego and the Mechanisms of Defence by Anna Freud",
            "url": "https://www.amazon.com/dp/1782202986?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Defence mechanism - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Defence_mechanism",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-03",
    "dateModified": "2026-02-03"
}
