{
    "id": "diaphragmatic-breathing",
    "name": "Diaphragmatic Breathing",
    "summary": "Breathing technique engaging the diaphragm muscle to promote full oxygen exchange and activate the relaxation response.",
    "explanation": "Diaphragmatic breathing (also called belly breathing or abdominal breathing) is the foundation of most breathing practices. It involves engaging the diaphragm - the dome-shaped muscle below your lungs - to draw air deep into the lower lungs, rather than shallow chest breathing.\n\nHow to practice diaphragmatic breathing:\n\n1. Sit or lie comfortably with one hand on your chest, one on your belly\n2. Breathe in slowly through your nose\n3. Feel your belly rise as your diaphragm descends - chest stays relatively still\n4. Exhale slowly through pursed lips\n5. Feel your belly fall as your diaphragm rises\n6. The hand on your belly should move more than the hand on your chest\n\nWhy it matters: Most adults have developed shallow chest breathing patterns due to stress, poor posture, and sedentary lifestyles. Chest breathing only uses the upper portion of lung capacity and keeps the body in a mild stress state. Diaphragmatic breathing:\n\n- Maximizes oxygen intake and CO2 removal\n- Stimulates the vagus nerve, activating the relaxation response\n- Lowers cortisol and blood pressure\n- Improves core stability\n- Reduces anxiety and promotes calm\n\nWhen to use it: As a default breathing pattern throughout the day, during stress or anxiety, before sleep, during exercise recovery, while working at a desk.\n\nCommon issues: If your shoulders rise when you inhale, you're chest breathing. Practice lying down first where diaphragmatic breathing is more natural.",
    "tags": [
        "breathing",
        "relaxation",
        "health",
        "techniques",
        "well-being"
    ],
    "category": "Well-Being & Happiness",
    "icon": "FaLungs",
    "featured": false,
    "aliases": [
        "Belly breathing",
        "Abdominal breathing",
        "Deep belly breathing"
    ],
    "relatedConcepts": [
        "breathwork",
        "box-breathing",
        "4-7-8-breathing",
        "relaxation-response",
        "parasympathetic-activation",
        "vagal-tone"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Breath by James Nestor",
            "url": "https://www.amazon.com/dp/0735213615?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Diaphragmatic breathing - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Diaphragmatic_breathing",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-29",
    "dateModified": "2026-01-29"
}
