{
    "id": "digital-immigrant",
    "name": "Digital Immigrant",
    "summary": "A person who grew up before the widespread adoption of digital technology and adopted it later in life, often retaining pre-digital habits and behaviors.",
    "explanation": "## What is a Digital Immigrant?\n\nA digital immigrant is a person who was born before the widespread adoption of digital technology and learned to use computers, the internet, and mobile devices later in life. The term was coined by Marc Prensky in his 2001 article \"Digital Natives, Digital Immigrants\" as the counterpart to the digital native. Prensky used the immigration metaphor to describe how these individuals adapt to the digital world much like immigrants adapt to a new country, often retaining an \"accent\" from their pre-digital past.\n\n## The Digital Accent\n\nPrensky described a \"digital accent\" that characterizes digital immigrants' interactions with technology. Examples include printing out emails to read them, calling someone to confirm receipt of an email, physically going to someone's office to discuss something that could be handled digitally, or pausing before pressing record on a video. These behaviors reflect deeply ingrained habits formed during a time when analog processes were the norm. The millennial pause in video recording is a prime example of this kind of technological residue.\n\n## Adaptation and Strengths\n\nWhile the term can carry a somewhat negative connotation, digital immigrants bring valuable perspectives. Their experience with pre-digital methods often gives them a deeper appreciation for fundamental processes, critical thinking skills developed without reliance on search engines, and the ability to function effectively when technology fails. Many digital immigrants have successfully adapted to the digital world and bring a unique perspective that bridges analog and digital approaches.\n\n## Criticism\n\nLike its counterpart \"digital native,\" the digital immigrant concept has been criticized for creating an overly simplistic binary. In reality, technological fluency exists on a spectrum influenced by socioeconomic factors, education, personal interest, and professional needs rather than birth year alone. Some older individuals are highly tech-savvy, while some younger people struggle with digital tools. The concept remains useful, however, as a lens for understanding how formative technological experiences shape lasting behaviors and attitudes.",
    "tags": [
        "technology",
        "generations",
        "education",
        "culture",
        "digital-skills"
    ],
    "category": "Concepts",
    "icon": "FaLaptop",
    "featured": false,
    "aliases": [
        "Digital Immigrants"
    ],
    "relatedConcepts": [
        "digital-native",
        "technological-literacy",
        "millennial-pause",
        "skill-atrophy",
        "analog-to-digital-workflow"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Digital native - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Digital_native",
            "type": "website"
        },
        {
            "title": "Digital Natives, Digital Immigrants by Marc Prensky (2001)",
            "url": "https://www.marcprensky.com/writing/Prensky%20-%20Digital%20Natives,%20Digital%20Immigrants%20-%20Part1.pdf",
            "type": "paper"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-20",
    "dateModified": "2026-02-20"
}
