{
    "id": "distress-tolerance",
    "name": "Distress Tolerance",
    "summary": "Skills for surviving and accepting crisis situations without making them worse through impulsive or destructive actions.",
    "explanation": "Distress Tolerance is one of the four core skill modules in Dialectical Behavior Therapy (DBT), developed by Dr. Marsha Linehan. These skills help people survive crisis moments and accept difficult realities without resorting to behaviors that make things worse.\n\nCore principle: The goal isn't to feel better immediately (which may not be possible) but to get through the crisis without creating additional problems. Sometimes the best outcome is simply surviving a difficult moment without making it worse.\n\nCrisis survival skills (TIPP):\n- Temperature: Cold water on face triggers dive reflex, rapidly calming the nervous system\n- Intense exercise: Burns off adrenaline and stress hormones\n- Paced breathing: Slow exhales activate parasympathetic system\n- Progressive muscle relaxation: Releases physical tension\n\nDistraction skills (ACCEPTS):\n- Activities: Engage in absorbing tasks\n- Contributing: Help others\n- Comparisons: Perspective-taking\n- Emotions: Generate opposite emotions\n- Pushing away: Mentally set aside temporarily\n- Thoughts: Occupy mind with other content\n- Sensations: Strong physical sensations (ice, snapping rubber band)\n\nSelf-soothing: Using the five senses to calm (pleasant music, comfortable textures, soothing scents)\n\nRadical acceptance: Acknowledging reality as it is, even when painful, without fighting or denying it\n\nWhen to use distress tolerance: During crises, when emotions are overwhelming, when you can't solve the problem right now, or when you're tempted toward destructive behaviors.\n\nDistress tolerance differs from emotional regulation (changing emotions) by focusing on endurance and acceptance rather than change.",
    "tags": [
        "psychology",
        "mental-health",
        "coping",
        "dbt",
        "well-being"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaShieldAlt",
    "featured": false,
    "aliases": [
        "Crisis survival skills",
        "DBT distress tolerance"
    ],
    "relatedConcepts": [
        "emotional-regulation",
        "radical-acceptance",
        "self-soothing",
        "grounding",
        "coping-skills",
        "window-of-tolerance"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "DBT Skills Training Handouts and Worksheets by Marsha Linehan",
            "url": "https://www.amazon.com/dp/1572307811?tag=dsebastien00-20"
        },
        {
            "title": "The Dialectical Behavior Therapy Skills Workbook by Matthew McKay",
            "url": "https://www.amazon.com/dp/1684034582?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Dialectical behavior therapy - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Dialectical_behavior_therapy",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-29",
    "dateModified": "2026-01-29"
}
