{
    "id": "doomscrolling",
    "name": "Doomscrolling",
    "summary": "The compulsive habit of endlessly scrolling through negative or distressing news and social media content, driven by the brain's threat-detection bias.",
    "explanation": "Doomscrolling (also called doomsurfing) is the compulsive behavior of continuously scrolling through bad news or distressing social media content, even when it causes anxiety, sadness, or hopelessness. The term gained widespread use during the COVID-19 pandemic but describes a pattern that predates it.\n\n**Why We Doomscroll:**\n\nDoomscrolling exploits several cognitive and neurological mechanisms:\n\n- **Negativity bias**: The brain prioritizes threatening information for survival. Negative content grabs attention more powerfully than positive content, making it harder to disengage\n- **Uncertainty intolerance**: When things feel uncertain or threatening, the brain seeks more information to reduce uncertainty - but algorithmic feeds ensure there is always more alarming content to consume\n- **Salience Network hijacking**: The constant stream of novel, emotionally charged content keeps the Salience Network in perpetual alert mode, preventing the brain from transitioning to either focused work (Executive Control Network) or restorative rest (Default Mode Network)\n- **Variable reinforcement**: Like a slot machine, scrolling delivers unpredictable content - occasionally something genuinely important appears among the noise, reinforcing continued scrolling\n- **Dopamine loops**: Each new piece of content triggers a small dopamine response, creating a compulsive seeking behavior\n\n**Consequences:**\n\n- Increased anxiety, depression, and feelings of helplessness\n- Sleep disruption (especially when doomscrolling at night)\n- Reduced attention span and difficulty focusing on demanding tasks\n- Distorted worldview (negativity of news does not reflect statistical reality)\n- Time displacement from meaningful activities\n- Contributes to brain rot over time through chronic Salience Network dysregulation\n\n**Breaking the Pattern:**\n\n- Set specific time limits for news consumption\n- Schedule defined check-in times rather than reactive scrolling\n- Turn off push notifications for news apps\n- Replace scrolling with a concrete action (donate, volunteer, write to a representative)\n- Practice the 'STOP' technique: Stop, Take a breath, Observe what you're feeling, Proceed with intention\n- Use screen time tracking to build awareness of actual usage\n- Curate information sources deliberately rather than relying on algorithmic feeds",
    "tags": [
        "attention",
        "psychology",
        "well-being",
        "digital-minimalism",
        "mental-health"
    ],
    "category": "Attention & Focus",
    "icon": "FaMobileAlt",
    "featured": false,
    "aliases": [
        "Doomsurfing",
        "Doom Scrolling",
        "Compulsive News Scrolling"
    ],
    "relatedConcepts": [
        "brain-rot",
        "salience-network",
        "digital-distraction",
        "negativity-bias",
        "dopamine",
        "attention-economy",
        "digital-minimalism"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Stolen Focus by Johann Hari",
            "url": "https://www.amazon.com/dp/0593138511?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Doomscrolling - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Doomscrolling",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-28",
    "dateModified": "2026-02-28"
}
