{
    "id": "dramatic-irony",
    "name": "Dramatic Irony",
    "summary": "When the audience knows more than the characters, creating tension and engagement through information asymmetry.",
    "explanation": "Dramatic irony is a storytelling device where the audience possesses knowledge that characters lack. This creates a privileged perspective where viewers watch characters act on incomplete information, generating tension, suspense, or humor. The gap between what characters believe and what the audience knows drives engagement. Classic examples: in Romeo and Juliet, the audience knows Juliet is alive while Romeo believes she's dead; in horror films, viewers see the killer that characters don't. How it works: the author reveals information to the audience that characters cannot access, creating emotional investment as viewers anticipate the moment when characters discover the truth. Effects of dramatic irony: suspense (will they find out in time?), tragedy (watching inevitable disasters unfold), humor (characters misunderstand situations), and engagement (audience mentally urges characters toward truth). Types: knowledge of future events (prophecies characters ignore), hidden identities (character doesn't know who someone really is), and situational context (characters misinterpret what's happening). Dramatic irony exploits the three-sided knowledge structure - the author grants the audience more information than the characters have. This asymmetry transforms passive viewing into active emotional participation. Overuse risks: if characters seem unreasonably oblivious, dramatic irony breaks down into frustration rather than engagement.",
    "tags": [
        "storytelling",
        "writing",
        "literature",
        "techniques",
        "communications",
        "psychology"
    ],
    "category": "Writing & Content Creation",
    "icon": "FaTheaterMasks",
    "featured": false,
    "aliases": [
        "Tragic irony",
        "Audience advantage",
        "Structural irony"
    ],
    "relatedConcepts": [
        "information-asymmetry",
        "foreshadowing",
        "narrative-perspective",
        "unreliable-narrator"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Irony - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Irony#Dramatic_irony",
            "type": "website"
        },
        {
            "title": "AI Ghostwriter Guide",
            "url": "https://store.dsebastien.net/l/ai-ghostwriter-guide",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-06",
    "dateModified": "2026-01-18"
}
