{
    "id": "earning-to-give",
    "name": "Earning to Give",
    "summary": "The strategy of deliberately pursuing a high-income career in order to donate a significant portion of earnings to highly effective charities and causes.",
    "explanation": "Earning to give is an approach to altruistic career planning in which individuals deliberately pursue high-income careers - in finance, technology, law, medicine, or other lucrative fields - with the explicit intention of donating a substantial portion (often 10-50% or more) of their earnings to the most effective charitable organizations.\n\nThe concept gained prominence through the effective altruism movement, particularly through the work of William MacAskill and the career advisory organization 80,000 Hours. The underlying logic is straightforward: in many cases, a person can do more good by earning a high salary and funding multiple effective organizations than by working directly in a lower-paying nonprofit role.\n\nKey arguments for earning to give:\n\n**Comparative advantage**: Not everyone has the skills or temperament for direct charitable work. Someone with strong quantitative skills may contribute more by earning well in finance and funding several malaria researchers than by becoming a mediocre researcher themselves.\n\n**Fungibility of money**: Donations can fund the most effective interventions anywhere in the world, whereas direct work is geographically and organizationally constrained.\n\n**Replaceability**: In competitive job markets, if you don't take a high-paying job, someone else will - and they're less likely to donate as much. Your counterfactual impact is the difference between your donations and what your replacement would give.\n\n**Flexibility**: Earning to give preserves optionality. Donors can shift their giving as evidence changes about which interventions are most effective.\n\nNotable practitioners include Giving What We Can members who pledge to donate at least 10% of their income, and individuals like Matt Wage, a philosophy student who chose Wall Street over academia specifically to maximize his charitable impact.\n\nHowever, the EA community has nuanced its stance over time. 80,000 Hours now emphasizes that for many people, direct work in high-impact areas (like AI safety research or policy) may be even more valuable than earning to give, particularly as the movement has grown and funding has become less of a bottleneck relative to talent. Earning to give remains an excellent option, but it is one of several pathways to high impact, not necessarily the default recommendation.",
    "tags": [
        "ethics",
        "philosophy",
        "decision-making",
        "economics"
    ],
    "category": "Philosophy & Wisdom",
    "icon": "FaHandHoldingHeart",
    "featured": false,
    "aliases": [
        "Earning-to-Give",
        "Strategic Career Altruism"
    ],
    "relatedConcepts": [
        "effective-altruism",
        "cause-prioritization",
        "altruism",
        "counterfactual-thinking",
        "comparative-advantage",
        "utilitarianism"
    ],
    "relatedNotes": [],
    "references": [
        {
            "title": "Earning to give - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Earning_to_give",
            "type": "website"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/product/clarity-101",
            "type": "other"
        }
    ],
    "articles": [],
    "books": [
        {
            "title": "Doing Good Better by William MacAskill",
            "url": "https://www.amazon.com/dp/1592409660?tag=dsebastien00-20"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-08",
    "dateModified": "2026-02-08"
}
