{
    "id": "earthing",
    "name": "Earthing",
    "summary": "Practice of direct physical contact with the earth's surface to promote health and well-being.",
    "explanation": "Earthing (also called grounding in physical contexts) is the practice of making direct physical contact with the earth's surface - walking barefoot on grass, sand, or soil, or using conductive systems connected to the ground. Proponents claim this allows the body to absorb the earth's electrical charge.\n\nThe premise: The earth maintains a negative electrical charge. Modern life (rubber-soled shoes, insulated buildings) disconnects us from this charge. Direct contact may allow free electrons to flow into the body, potentially reducing inflammation and promoting health.\n\nClaimed benefits:\n- Reduced inflammation and pain\n- Improved sleep quality\n- Decreased stress and cortisol levels\n- Better blood flow and cardiovascular health\n- Faster wound healing\n- Reduced jet lag\n\nHow to practice earthing:\n- Walk barefoot on grass, sand, soil, or concrete\n- Swim in natural bodies of water\n- Garden with bare hands\n- Use earthing mats, sheets, or patches indoors\n- Lie on the ground in parks or nature\n\nScientific status: Research on earthing is limited and often methodologically challenged. Some small studies show promising results, but the field lacks large-scale controlled trials. The mechanisms are not well established in mainstream science.\n\nDistinct from psychological grounding: Earthing refers specifically to physical earth contact, while psychological grounding techniques focus on mental presence and sensory awareness (though there may be overlap in effects).\n\nPractical approach: Regardless of electrical effects, spending time barefoot in nature has documented benefits for stress reduction and well-being.",
    "tags": [
        "health",
        "well-being",
        "nature",
        "practices"
    ],
    "category": "Well-Being & Happiness",
    "icon": "FaLeaf",
    "featured": false,
    "aliases": [
        "Physical grounding",
        "Earth connection",
        "Barefoot grounding"
    ],
    "relatedConcepts": [
        "grounding",
        "stress-management",
        "parasympathetic-activation"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Earthing by Clint Ober, Stephen Sinatra, and Martin Zucker",
            "url": "https://www.amazon.com/dp/1591203740?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Earthing - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Earthing_(alternative_medicine)",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-29",
    "dateModified": "2026-01-29"
}
