{
    "id": "effective-altruism",
    "name": "Effective Altruism",
    "summary": "A philosophical and social movement that uses evidence and reasoning to determine the most effective ways to benefit others and improve the world.",
    "explanation": "Effective Altruism (EA) is both an intellectual framework and a global community dedicated to using evidence, reason, and careful analysis to determine how to do the most good with limited resources. Rather than relying on emotional intuition or tradition to guide charitable efforts, EA advocates for rigorous evaluation of causes, interventions, and organizations to maximize positive impact.\n\nThe movement draws on several philosophical traditions, particularly utilitarianism and consequentialism, while incorporating insights from economics, decision theory, and the sciences. Core principles include:\n\n**Cause neutrality**: Rather than committing to a single cause based on personal connection or cultural norms, effective altruists evaluate different cause areas impartially, asking where additional resources would produce the most benefit.\n\n**Counterfactual reasoning**: EA emphasizes considering what would happen in the absence of your contribution. The most impactful actions are those that wouldn't happen otherwise.\n\n**Scope sensitivity**: Taking seriously the scale of problems, recognizing that helping 1,000 people is much better than helping 10, even when our emotions don't scale accordingly.\n\n**Expected value thinking**: Evaluating actions based on the probability-weighted sum of their outcomes, which sometimes favors high-risk, high-reward strategies over safe but limited ones.\n\nKey cause areas that the EA community has identified as particularly high-impact include global health and poverty (where interventions like malaria nets and deworming are extremely cost-effective), animal welfare (given the vast scale of factory farming), and existential risk reduction (including AI safety, biosecurity, and nuclear risk).\n\nPractical strategies associated with EA include earning to give (pursuing high-income careers to donate more), direct work at high-impact organizations, cause prioritization research, and career choice optimization. Organizations like GiveWell, 80,000 Hours, and the Open Philanthropy Project provide evidence-based guidance for these approaches.\n\nCriticisms of EA include concerns about its utilitarian foundations potentially justifying harmful means for beneficial ends, a tendency toward technocratic elitism, insufficient attention to systemic injustice and structural change, and the movement's association with controversial longtermist priorities that may divert attention from present-day suffering.",
    "tags": [
        "ethics",
        "philosophy",
        "decision-making",
        "psychology"
    ],
    "category": "Philosophy & Wisdom",
    "icon": "FaHandHoldingHeart",
    "featured": false,
    "aliases": [
        "EA"
    ],
    "relatedConcepts": [
        "utilitarianism",
        "longtermism",
        "scope-insensitivity",
        "expected-value",
        "counterfactual-thinking",
        "cause-prioritization",
        "earning-to-give",
        "altruism",
        "moral-circle-expansion",
        "effective-accelerationism",
        "identifiable-victim-effect"
    ],
    "relatedNotes": [],
    "references": [
        {
            "title": "Effective altruism - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Effective_altruism",
            "type": "website"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/product/clarity-101",
            "type": "other"
        }
    ],
    "articles": [],
    "books": [
        {
            "title": "Doing Good Better by William MacAskill",
            "url": "https://www.amazon.com/dp/1592409660?tag=dsebastien00-20"
        },
        {
            "title": "The Most Good You Can Do by Peter Singer",
            "url": "https://www.amazon.com/dp/0300219865?tag=dsebastien00-20"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-08",
    "dateModified": "2026-02-08"
}
