{
    "id": "eliminative-materialism",
    "name": "Eliminative Materialism",
    "summary": "A philosophical position arguing that common-sense mental concepts like beliefs and desires are fundamentally flawed and will be eliminated by neuroscience.",
    "explanation": "Eliminative materialism argues that folk psychology—our everyday framework of beliefs, desires, and intentions—is a false theory that neuroscience will eventually replace. Just as concepts like \"phlogiston\" and \"demonic possession\" were eliminated from science, concepts like \"belief\" and \"desire\" may not map onto real brain states and will be discarded. The chief proponents of this view are Paul Churchland and Patricia Churchland.\n\nThe view is radical: it doesn't merely reduce mental states to brain states (like identity theory) but claims that mental state categories don't exist at all as folk psychology describes them. This means our everyday vocabulary for describing mental life—beliefs, desires, hopes, fears—may be as scientifically obsolete as medieval theories of disease.\n\nCritics argue that eliminativism is self-refuting (you must believe eliminativism is true to assert it), ignores the successful predictive power of folk psychology in everyday life, and makes implausible predictions about future science. The debate ultimately turns on whether neuroscience will vindicate or eliminate our common-sense mental concepts.",
    "tags": ["philosophy", "philosophy-of-mind", "neuroscience", "materialism"],
    "category": "Philosophy & Wisdom",
    "icon": "FaBrain",
    "featured": false,
    "aliases": ["Eliminativism"],
    "relatedConcepts": ["philosophy-of-mind", "consciousness"],
    "relatedNotes": ["https://notes.dsebastien.net/30+Areas/33+Permanent+notes/33.02+Content/Eliminative+Materialism"],
    "articles": [],
    "books": [
        {
            "title": "Neurophilosophy by Patricia Churchland",
            "url": "https://www.amazon.com/dp/0262530856?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Eliminative materialism - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Eliminative_materialism",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-28",
    "dateModified": "2026-01-28"
}
