{
    "id": "enactivism",
    "name": "Enactivism",
    "summary": "Cognition arises through dynamic interaction between an organism and its environment, not through internal mental representations.",
    "explanation": "Enactivism is a theory in cognitive science and philosophy of mind that holds cognition is not something that happens inside the head through manipulation of mental representations. Instead, mind is enacted through the bodily engagement of an organism with its environment. Knowing is inseparable from doing.\n\nIntroduced by Francisco Varela, Evan Thompson, and Eleanor Rosch in their influential book *The Embodied Mind* (1991), enactivism draws on phenomenology (particularly Maurice Merleau-Ponty's work on embodiment) and biology (especially the concept of autopoiesis, or self-organization in living systems).\n\nEnactivism goes beyond embodied cognition by emphasizing that perception and action are fundamentally coupled—we perceive in order to act and act in order to perceive. This perception-action loop is the foundation of all cognitive activity. The approach challenges computational and representationalist theories of mind that treat cognition as symbol manipulation.\n\nThe core claims of enactivism are: (1) Cognition is embodied—it requires having a body with sensorimotor capacities; (2) Cognition is enacted—it emerges from the history of actions and interactions with the world; (3) Cognition is embedded—it is always situated in a specific environmental context.\n\nEnactivism has influenced debates about artificial intelligence, consciousness, and the nature of understanding. It aligns with critiques of traditional AI that argue genuine understanding cannot emerge from disembodied symbol processing alone.",
    "tags": [
        "philosophies",
        "cognitive-science",
        "embodiment",
        "philosophy-of-mind"
    ],
    "category": "Philosophy & Wisdom",
    "icon": "FaBrain",
    "featured": false,
    "aliases": [
        "Enactive Cognition",
        "Enactive Approach"
    ],
    "relatedConcepts": [
        "embodied-cognition",
        "consciousness"
    ],
    "relatedNotes": [
        "https://notes.dsebastien.net/30+Areas/33+Permanent+notes/33.02+Content/Enactivism"
    ],
    "articles": [],
    "books": [
        {
            "title": "The Embodied Mind: Cognitive Science and Human Experience by Francisco Varela, Evan Thompson, and Eleanor Rosch",
            "url": "https://www.amazon.com/dp/0262720213?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Enactivism - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Enactivism",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-28",
    "dateModified": "2026-01-30"
}
