{
    "id": "enneagram",
    "name": "Enneagram",
    "summary": "A personality typology describing nine interconnected types, each with core motivations, fears, and paths for growth, emphasizing psychological and spiritual development.",
    "explanation": "The Enneagram is a personality system that describes nine distinct types, each with a core motivation, basic fear, and characteristic patterns of thinking, feeling, and behaving. Unlike trait-based models, the Enneagram focuses on underlying motivations—why we do what we do, not just what we do.\n\n**The Nine Types:**\n\n1. **The Reformer/Perfectionist**: Motivated by integrity and improvement. Fear: Being corrupt or defective. Growth: Learning acceptance.\n\n2. **The Helper**: Motivated by love and being needed. Fear: Being unloved or unwanted. Growth: Acknowledging own needs.\n\n3. **The Achiever**: Motivated by success and admiration. Fear: Being worthless or failing. Growth: Embracing authenticity over image.\n\n4. **The Individualist**: Motivated by identity and significance. Fear: Having no identity or significance. Growth: Finding present-moment contentment.\n\n5. **The Investigator**: Motivated by knowledge and competence. Fear: Being useless or incapable. Growth: Engaging with the world.\n\n6. **The Loyalist**: Motivated by security and support. Fear: Being without guidance or support. Growth: Trusting self and others.\n\n7. **The Enthusiast**: Motivated by freedom and variety. Fear: Being deprived or trapped. Growth: Embracing stillness and depth.\n\n8. **The Challenger**: Motivated by self-protection and control. Fear: Being harmed or controlled. Growth: Showing vulnerability.\n\n9. **The Peacemaker**: Motivated by peace and harmony. Fear: Loss or separation. Growth: Asserting own priorities.\n\n**Key concepts:**\n- **Wings**: Adjacent types that influence your core type\n- **Lines of integration/disintegration**: How types behave under growth vs. stress\n- **Instinctual variants**: Self-preservation, social, and one-to-one subtypes\n- **Centers of intelligence**: Body (8,9,1), Heart (2,3,4), Head (5,6,7)\n\nThe Enneagram is used for personal development, relationships, team dynamics, and spiritual growth, emphasizing transformation rather than mere classification.",
    "tags": [
        "personality",
        "psychology",
        "self-discovery",
        "assessments",
        "relationships",
        "personal-development",
        "spirituality"
    ],
    "category": "Frameworks",
    "icon": "FaStar",
    "featured": false,
    "aliases": [
        "Enneagram of Personality",
        "9 Types",
        "Enneagram Types"
    ],
    "relatedConcepts": [
        "myers-briggs-type-indicator",
        "big-five-personality-traits",
        "sparketype",
        "character-strengths"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "The Wisdom of the Enneagram by Don Richard Riso and Russ Hudson",
            "url": "https://www.amazon.com/dp/0553378201?tag=dsebastien00-20"
        },
        {
            "title": "The Road Back to You by Ian Morgan Cron and Suzanne Stabile",
            "url": "https://www.amazon.com/dp/0830846190?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Enneagram of Personality - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Enneagram_of_Personality",
            "type": "website"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        }
    ],
    "tutorials": [
        {
            "title": "Truity Enneagram Test",
            "url": "https://www.truity.com/test/enneagram-personality-test",
            "type": "website"
        }
    ],
    "datePublished": "2026-01-16",
    "dateModified": "2026-01-18"
}
