{
    "id": "epiphenomenalism",
    "name": "Epiphenomenalism",
    "summary": "The view that mental states are caused by physical brain processes but have no causal influence on the physical world, making consciousness a byproduct without function.",
    "explanation": "Epiphenomenalism is the philosophical position that mental events are caused by physical events in the brain but have no causal effects on physical events. Consciousness exists - you really do feel pain, see colors, and have thoughts - but these experiences are mere byproducts of neural activity, like the steam from a locomotive that plays no role in driving the train.\n\n**The Appeal:**\n\nEpiphenomenalism offers a way to accept the reality of consciousness while maintaining that the physical world is causally closed (every physical event has a sufficient physical cause). It avoids the interaction problem that plagues dualism: if mental events don't cause physical events, we don't need to explain how a non-physical mind moves a physical body.\n\nThomas Henry Huxley, a key early proponent, compared consciousness to a steam whistle: it accompanies the engine's work but contributes nothing to it.\n\n**Serious Problems:**\n\n- **The evolutionary argument**: If consciousness has no causal power, natural selection could not have selected for it. Why would complex subjective experiences evolve if they do nothing?\n- **The self-knowledge problem**: If your belief 'I am in pain' is caused by brain states and not by the pain experience itself, then your knowledge of your own mental states is systematically unreliable\n- **The self-stultification problem**: If epiphenomenalism is true, the belief in epiphenomenalism was not caused by evidence or reasoning about consciousness but solely by brain states, undermining its own justification\n- **Intuitive implausibility**: It seems obvious that pain causes us to withdraw our hand from a flame. Denying this is deeply counterintuitive\n\n**Contemporary Relevance:**\n\nDespite its problems, epiphenomenalism remains important as a position that some physicalists may be implicitly committed to. If mental properties supervene on physical properties but the physical world is causally closed, it is unclear what causal work consciousness does - leading to what Jaegwon Kim called the 'exclusion problem.'",
    "tags": [
        "philosophies",
        "consciousness",
        "philosophy-of-mind",
        "causation",
        "dualism"
    ],
    "category": "Philosophy & Wisdom",
    "icon": "FaBrain",
    "featured": false,
    "aliases": [
        "Epiphenomenal Consciousness",
        "Causal Impotence of Mind"
    ],
    "relatedConcepts": [
        "consciousness",
        "qualia",
        "mind-body-problem",
        "physicalism",
        "hard-problem-of-consciousness",
        "dualism",
        "philosophy-of-mind"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Philosophy of Mind by Jaegwon Kim",
            "url": "https://www.amazon.com/dp/0813344581?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Epiphenomenalism - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Epiphenomenalism",
            "type": "website"
        },
        {
            "title": "Epiphenomenalism - Stanford Encyclopedia of Philosophy",
            "url": "https://plato.stanford.edu/entries/epiphenomenalism/",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-28",
    "dateModified": "2026-02-28"
}
