{
    "id": "epistemic-uncertainty",
    "name": "Epistemic Uncertainty",
    "summary": "The uncertainty arising from lack of knowledge or information, rather than from inherent randomness or variability in the world.",
    "explanation": "Epistemic uncertainty (from Greek 'episteme' meaning knowledge) is the uncertainty that exists because we don't have complete information, not because the world is fundamentally unpredictable. It's the 'could know but don't' type of uncertainty, as opposed to aleatory uncertainty (fundamental randomness that can't be eliminated). Sources of epistemic uncertainty: hidden information (facts exist but aren't accessible), measurement limitations (can't observe precisely enough), model inadequacy (our frameworks don't capture reality), and complexity (too many variables to track). Key insight: epistemic uncertainty can theoretically be reduced with more information, better tools, or improved models - unlike aleatory uncertainty which is irreducible. Examples: we're uncertain if it rained yesterday in a remote location (epistemic - in principle knowable from satellite data), vs uncertain about tomorrow's exact temperature (mixed - weather has both epistemic and aleatory components). In storytelling, the three-sided knowledge structure creates epistemic uncertainty - characters are uncertain because they lack knowledge the author possesses, readers are uncertain because the author hasn't revealed everything. This creates narrative tension. Applications: risk assessment (distinguishing known unknowns from unknowable unknowns), scientific inquiry (research aims to reduce epistemic uncertainty), and decision-making (invest in information gathering when dealing with epistemic uncertainty). Understanding epistemic vs aleatory uncertainty helps: focus effort appropriately (can reduce epistemic, must accept aleatory), avoid false confidence (thinking you've eliminated uncertainty when you've just failed to measure it), and value information (knowing what reduces uncertainty).",
    "tags": [
        "epistemology",
        "philosophy",
        "decision-making",
        "knowledge",
        "uncertainty",
        "risks"
    ],
    "category": "Philosophy & Wisdom",
    "icon": "FaQuestion",
    "featured": false,
    "aliases": [
        "Knowledge uncertainty",
        "Subjective uncertainty",
        "Reducible uncertainty"
    ],
    "relatedConcepts": [
        "information-asymmetry",
        "unknown-unknowns",
        "theory-of-mind",
        "narrative-perspective"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Uncertainty quantification - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Uncertainty_quantification#Aleatoric_and_epistemic_uncertainty",
            "type": "website"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/product/clarity-101",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-06",
    "dateModified": "2026-01-29"
}
