{
    "id": "epistemic-vigilance",
    "name": "Epistemic Vigilance",
    "summary": "The cognitive capacity to evaluate the reliability, trustworthiness, and accuracy of information received from others before accepting it as knowledge.",
    "explanation": "Epistemic vigilance is the set of cognitive mechanisms humans use to guard against being misinformed or deceived by others. Coined by Dan Sperber and colleagues, the concept describes our ability to assess whether communicated information is trustworthy before integrating it into our beliefs.\n\nEpistemic vigilance operates through two main channels:\n\n- **Source evaluation**: Assessing the competence, benevolence, and track record of the person or institution providing information. Is this source knowledgeable? Do they have reason to deceive?\n- **Content evaluation**: Examining the plausibility, coherence, and evidential support of the information itself. Does this claim make sense given what I already know? Is it internally consistent?\n\nThis capacity is essential because humans are fundamentally social learners. Most of what we know comes from others rather than from direct experience. Without epistemic vigilance, we would be vulnerable to every piece of misinformation, propaganda, or honest mistake that comes our way. But excessive vigilance would make social learning impossible, as we would never trust anyone enough to learn from them.\n\nThe optimal balance involves calibrated trust: being open enough to learn from reliable sources while remaining skeptical enough to filter out unreliable information. This balance shifts based on context, the stakes involved, and the track record of the source.\n\nIn the modern information environment, epistemic vigilance is more important than ever. Social media, AI-generated content, and the sheer volume of information we encounter daily all strain our natural filtering mechanisms. Developing stronger epistemic vigilance means: checking sources before sharing, looking for corroborating evidence, being wary of emotionally compelling but unverified claims, and recognizing common rhetorical techniques used to bypass critical thinking.\n\nFor knowledge workers, epistemic vigilance applies directly to research practices: verifying citations, cross-referencing claims, distinguishing primary from secondary sources, and maintaining awareness of the provenance of information in one's knowledge base.",
    "tags": [
        "epistemology",
        "critical-thinking",
        "psychology",
        "information-literacy",
        "intellectual-virtues"
    ],
    "category": "Thinking",
    "icon": "FaCompass",
    "featured": false,
    "aliases": [
        "Information Vigilance",
        "Cognitive Vigilance"
    ],
    "relatedConcepts": [
        "epistemic-integrity",
        "epistemic-humility",
        "critical-thinking",
        "confirmation-bias",
        "intellectual-honesty",
        "calibration"
    ],
    "relatedNotes": [],
    "references": [
        {
            "title": "Epistemic vigilance - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Epistemic_vigilance",
            "type": "website"
        },
        {
            "title": "Epistemic Vigilance - Sperber et al.",
            "url": "https://doi.org/10.1111/j.1468-0017.2010.01394.x",
            "type": "paper"
        }
    ],
    "articles": [],
    "books": [],
    "tutorials": [],
    "datePublished": "2026-02-19",
    "dateModified": "2026-02-19"
}
