{
    "id": "epistemic-curiosity",
    "name": "Epistemic Curiosity",
    "summary": "The desire to acquire new knowledge and eliminate gaps in understanding, driven by intrinsic interest rather than external rewards.",
    "explanation": "Epistemic curiosity is the intrinsic motivation to seek knowledge for its own sake, distinct from curiosity driven by practical needs or external rewards. It represents a fundamental human drive to understand the world, close gaps in knowledge, and make sense of our experiences.\n\nPsychologist Daniel Berlyne distinguished two types of epistemic curiosity: (1) Diversive curiosity - seeking stimulation and novelty when bored (broad exploration). (2) Specific curiosity - seeking particular information to resolve uncertainty or close a knowledge gap (focused investigation).\n\nEpistemic curiosity serves several functions: it drives learning and skill development, promotes exploration of ideas and environments, helps detect and resolve inconsistencies in understanding, and contributes to personal growth and expertise development.\n\nCharacteristics of high epistemic curiosity: asking questions beyond what's required, exploring topics without immediate practical application, enjoying intellectual challenges, finding satisfaction in understanding complexity, and being drawn to mystery and ambiguity.\n\nCultivating epistemic curiosity: expose yourself to diverse ideas and perspectives, embrace uncertainty as opportunity rather than threat, ask 'why' and 'how' more often, follow intellectual interests even without clear payoff, and create environments that reward questioning and exploration.\n\nIn knowledge work, epistemic curiosity is a competitive advantage - it drives deeper understanding, creative connections, and continuous learning that compound over time.",
    "tags": [
        "curiosity",
        "psychology",
        "learning",
        "motivation",
        "knowledge"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaSearch",
    "featured": false,
    "aliases": [
        "Intellectual curiosity",
        "Knowledge-seeking curiosity",
        "Cognitive curiosity"
    ],
    "relatedConcepts": [
        "curiosity",
        "diversive-curiosity",
        "information-gap-theory",
        "curiosity-gap",
        "intrinsic-motivation",
        "growth-mindset",
        "epistemic-integrity",
        "need-for-cognition",
        "openness-to-experience"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Curiosity - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Curiosity#Epistemic_curiosity",
            "type": "website"
        },
        {
            "title": "The Psychology and Neuroscience of Curiosity",
            "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4635443/",
            "type": "paper"
        },
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "DeveloPassion's Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-30",
    "dateModified": "2026-02-20"
}
