{
    "id": "epistemic-integrity",
    "name": "Epistemic Integrity",
    "summary": "The practice of ensuring that one's knowledge claims are genuinely grounded in personal thinking and synthesis rather than passively absorbed or misattributed external information.",
    "explanation": "Epistemic integrity is the commitment to maintaining honesty about the origins and quality of one's knowledge. It requires distinguishing between what you truly understand through your own thinking and synthesis versus what you have merely encountered, stored, or repeated without genuine comprehension.\n\nAt its core, epistemic integrity involves several practices:\n\n- **Owning your knowledge**: Only claiming to know what you have genuinely processed, thought about, and integrated into your understanding.\n- **Acknowledging sources**: Being transparent about where ideas originate and what intellectual work you have actually done.\n- **Separating storage from understanding**: Recognizing that saving an article, bookmarking a resource, or filing a note does not constitute knowing its contents.\n- **Resisting false authority**: Not presenting borrowed or superficially understood ideas as deeply held personal knowledge.\n\nIn the context of personal knowledge management (PKM), epistemic integrity is especially relevant. Modern tools make it easy to accumulate vast libraries of saved articles, highlights, and notes. But there is a critical difference between a personal knowledge base built from genuine synthesis and one filled with passively ingested material. The former represents authentic understanding; the latter is a reference library at best.\n\nThis distinction becomes even more important with AI tools. When AI systems analyze a knowledge base, they cannot distinguish between deeply understood personal knowledge and casually saved external content. If both are treated equally, the resulting analysis misrepresents what the person actually knows and thinks, violating epistemic integrity.\n\nEpistemic integrity is closely related to intellectual honesty but focuses specifically on the knowledge dimension: not just being honest in argumentation, but being honest about the very foundations of what you claim to know. It requires ongoing self-examination and the courage to admit gaps in understanding rather than papering over them with borrowed ideas.\n\nPractical applications include: auditing your notes to distinguish personal insights from saved quotations, being explicit about confidence levels when sharing knowledge, processing saved material before treating it as 'known,' and maintaining clear boundaries between original thinking and curated content.",
    "tags": [
        "epistemology",
        "knowledge-management",
        "thinking",
        "intellectual-virtues",
        "self-awareness"
    ],
    "category": "Philosophy & Wisdom",
    "icon": "FaCompass",
    "featured": false,
    "aliases": [
        "Knowledge Integrity"
    ],
    "relatedConcepts": [
        "epistemic-humility",
        "epistemic-responsibility",
        "intellectual-honesty",
        "epistemic-vigilance",
        "epistemic-curiosity",
        "calibration",
        "cognitive-sovereignty"
    ],
    "relatedNotes": [],
    "references": [
        {
            "title": "Epistemic Integrity - Quantum Gardener",
            "url": "https://quantumgardener.info/notes/epistemic-integrity",
            "type": "website"
        },
        {
            "title": "Epistemic virtue - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Epistemic_virtue",
            "type": "website"
        },
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Personal Knowledge Management Library",
            "url": "https://store.dsebastien.net/product/pkm-library",
            "type": "other"
        },
        {
            "title": "Personal Knowledge Management Coaching",
            "url": "https://store.dsebastien.net/product/pkm-coaching",
            "type": "other"
        },
        {
            "title": "DeveloPassion's Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        },
        {
            "title": "Journaling Deep Dive Workshop",
            "url": "https://store.dsebastien.net/product/journaling-deep-dive",
            "type": "other"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/product/clarity-101",
            "type": "other"
        }
    ],
    "articles": [],
    "books": [],
    "tutorials": [],
    "datePublished": "2026-02-19",
    "dateModified": "2026-02-19"
}
