{
    "id": "evidence-based-thinking",
    "name": "Evidence-Based Thinking",
    "summary": "The disciplined practice of forming beliefs and making decisions based on the best available evidence rather than intuition, tradition, or authority.",
    "explanation": "Evidence-based thinking is the practice of grounding beliefs, decisions, and actions in the best available empirical evidence rather than relying on intuition, anecdote, tradition, or authority alone. It originated in evidence-based medicine but has since expanded to education, management, policy-making, and personal decision-making.\n\nThe core principle is straightforward: before accepting a claim or making a decision, ask what evidence supports it, how strong that evidence is, and whether alternative explanations exist. Not all evidence is created equal. A single anecdote is weaker than a well-designed study, which is weaker than a systematic review of many studies. Evidence-based thinking requires developing the skill to evaluate evidence quality and weigh it appropriately.\n\nThis matters because humans are naturally inclined to rely on mental shortcuts. We trust vivid stories over statistics, defer to authority figures, and cling to beliefs that feel right even when data contradicts them. Evidence-based thinking provides a corrective by demanding that we look at what the data actually shows rather than what we expect or hope it shows. As Bayes' theorem formalizes, the strength of our beliefs should be proportional to the strength of the evidence.\n\nPracticing evidence-based thinking involves several habits: seeking out high-quality data before forming opinions, considering the source and methodology behind claims, looking for replicated findings rather than single studies, distinguishing correlation from causation, and being willing to say 'I don't know' when evidence is insufficient. It also means recognizing that without evidence, we are left only with our priors and biases, which are unreliable guides to truth.\n\nEvidence-based thinking does not mean ignoring experience or intuition entirely. Expert intuition built on extensive experience can be valuable. But it does mean testing intuitions against data when possible and being transparent about when a belief is evidence-supported versus when it is a best guess.",
    "tags": [
        "thinking",
        "rationality",
        "decision-making",
        "critical-thinking",
        "epistemology"
    ],
    "category": "Thinking",
    "icon": "FaLightbulb",
    "featured": false,
    "aliases": [
        "Evidence-based reasoning",
        "Evidence-based practice",
        "Data-driven thinking"
    ],
    "relatedConcepts": [
        "bayes-theorem",
        "critical-thinking",
        "epistemic-rationality",
        "probabilistic-thinking",
        "base-rate-neglect",
        "confirmation-bias"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Thinking, Fast and Slow by Daniel Kahneman",
            "url": "https://www.amazon.com/dp/0374533555?tag=dsebastien00-20"
        },
        {
            "title": "The Scout Mindset by Julia Galef",
            "url": "https://www.amazon.com/dp/0735217556?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Evidence-based practice - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Evidence-based_practice",
            "type": "website"
        },
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/product/clarity-101",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-20",
    "dateModified": "2026-02-20"
}
