{
    "id": "evolutionary-psychology",
    "name": "Evolutionary Psychology",
    "summary": "The study of the human mind as a product of natural selection, examining how evolved psychological mechanisms influence behavior.",
    "explanation": "Evolutionary Psychology is a theoretical approach that applies the principles of natural selection to understand the human mind and behavior. It proposes that many psychological traits—such as memory, perception, language, and emotions—are functional adaptations that evolved to solve recurring problems faced by our ancestors. Just as our physical bodies bear the imprint of evolutionary pressures, so too does our psychology.\n\nThe field rests on several key assumptions. First, the brain is an information-processing system that produces behavior in response to inputs. Second, many of our neural circuits were designed by natural selection to solve problems that our ancestors faced during the Pleistocene era (roughly 2.5 million to 10,000 years ago). Third, most of what goes on in the mind is unconscious—automatic processes that evolved to handle specific adaptive challenges. Fourth, different neural circuits are specialized for solving different adaptive problems.\n\nEvolutionary psychology helps explain many aspects of human nature that might otherwise seem puzzling. Why do we fear snakes and spiders more than cars, despite cars being statistically more dangerous? Because our ancestors who feared venomous creatures survived to reproduce. Why do we have a negativity bias, weighting bad news more heavily than good? Because in ancestral environments, being vigilant about threats was more critical for survival than capitalizing on opportunities.\n\nPractical applications span multiple domains. In marketing and design, understanding evolved preferences (such as attraction to faces, landscapes, or social status cues) informs more effective products. In organizational behavior, recognizing our tribal instincts and status-seeking drives helps design better workplaces. In personal development, understanding that our minds evolved for environments very different from modern life helps us anticipate and compensate for cognitive biases and emotional responses that may be mismatched to contemporary challenges.",
    "tags": [
        "psychology",
        "cognition",
        "human-nature",
        "decision-making",
        "thinking"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaBrain",
    "featured": false,
    "aliases": [
        "Evolutionary Psych",
        "Ev Psych",
        "EP"
    ],
    "relatedConcepts": [
        "cognitive-psychology",
        "behavioral-economics",
        "heuristics",
        "negativity-bias",
        "core-human-drives",
        "loss-aversion",
        "two-system-thinking"
    ],
    "relatedNotes": [
        "https://notes.dsebastien.net/Evolutionary+Psychology"
    ],
    "articles": [],
    "books": [
        {
            "title": "The Adapted Mind by Jerome Barkow, Leda Cosmides, and John Tooby",
            "url": "https://www.amazon.com/dp/0195101073?tag=dsebastien00-20"
        },
        {
            "title": "The Selfish Gene by Richard Dawkins",
            "url": "https://www.amazon.com/dp/0198788606?tag=dsebastien00-20"
        },
        {
            "title": "Evolutionary Psychology: The New Science of the Mind by David Buss",
            "url": "https://www.amazon.com/dp/0367218216?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Evolutionary psychology - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Evolutionary_psychology",
            "type": "website"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/l/knowii-clarity-101",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-28",
    "dateModified": "2026-01-28"
}
