{
    "id": "experiential-learning",
    "name": "Experiential Learning",
    "summary": "A learning approach where knowledge and skills are acquired through direct experience, reflection, and active experimentation rather than passive instruction.",
    "explanation": "Experiential learning is the process of learning through direct experience rather than through lectures, reading, or other forms of passive instruction. It emphasizes that meaningful learning occurs when individuals engage with real situations, reflect on their experiences, and apply their insights to new contexts.\n\nDavid Kolb's experiential learning cycle is the most influential model in this field. It describes four stages that form a continuous loop. Concrete experience involves actively engaging in a new situation or activity. Reflective observation involves stepping back to observe and think about the experience from different perspectives. Abstract conceptualization involves forming theories, generalizations, or principles based on reflection. Active experimentation involves applying these new ideas to real situations, generating new concrete experiences and restarting the cycle. Effective learning requires engaging with all four stages.\n\nThe philosophical roots of experiential learning trace back to John Dewey, who argued that education must be grounded in real experience. Dewey emphasized that not all experiences are equally educational; what matters is the quality of the experience and the learner's capacity to reflect on it. He distinguished between experiences that open up future growth and those that narrow it, stressing the educator's role in designing productive experiences.\n\nReflection is the critical mechanism that transforms raw experience into learning. Without deliberate reflection, experiences may be forgotten or misinterpreted. Structured reflection practices, such as journaling, debriefing sessions, and guided questioning, help learners extract meaning, identify patterns, and connect new experiences to existing knowledge.\n\nExperiential learning takes many practical forms. Internships and apprenticeships immerse learners in professional environments. Simulations and role-playing create safe spaces to practice skills and explore scenarios. Project-based learning engages students in solving real-world problems. Service learning combines community service with academic instruction. Laboratory work and field studies provide hands-on engagement with subject matter.\n\nIn the context of personal knowledge management, experiential learning connects directly to the practice of learning through building, writing, and creating. Writing about what you learn forces reflection and conceptualization. Building projects provides concrete experience and active experimentation. Teaching others requires synthesizing and articulating your understanding, deepening your own learning in the process.\n\nResearch consistently shows that experiential approaches lead to deeper understanding, better retention, and stronger transfer of learning to new situations compared to purely passive methods. The challenge lies in designing experiences that are both engaging and educationally productive, and in supporting learners through the reflective processes that make experience meaningful.",
    "tags": [
        "learning",
        "education",
        "experience",
        "practice"
    ],
    "category": "Learning & Education",
    "icon": "FaHandsHelping",
    "featured": false,
    "aliases": [
        "Learning by doing",
        "Hands-on learning",
        "Experience-based learning"
    ],
    "relatedConcepts": [
        "kolb-learning-cycle",
        "learning-by-doing",
        "reflective-practice",
        "active-learning",
        "deliberate-practice"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Experiential Learning by David Kolb",
            "url": "https://www.amazon.com/dp/0133892409?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Experiential learning - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Experiential_learning",
            "type": "website"
        },
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "DeveloPassion's Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-22",
    "dateModified": "2026-02-22"
}
