{
    "id": "false-dichotomy",
    "name": "False Dichotomy",
    "summary": "Logical fallacy that presents only two options when more alternatives exist.",
    "explanation": "A false dichotomy (also called false dilemma, either-or fallacy, or black-and-white thinking) is a logical fallacy that presents a situation as having only two mutually exclusive options when, in reality, more alternatives exist. The structure is: 'Either A or B'—when C, D, and nuanced combinations are also possible.\n\nCommon examples include: 'You're either with us or against us' (ignoring neutrality or partial agreement), 'We can either cut costs or maintain quality' (ignoring efficiency improvements), 'You can have a career or a family' (ignoring integration), and 'It's either nature or nurture' (ignoring interaction effects).\n\nFalse dichotomies are persuasive because they simplify complex decisions, create urgency, and frame the speaker's preferred option favorably against an undesirable alternative. Politicians, marketers, and debaters frequently deploy them. They also arise naturally from cognitive laziness—binary categories are easier to process than spectrums.\n\nTo counter false dichotomies: ask 'What other options exist?', look for middle grounds and hybrid solutions, question whether the presented options are truly mutually exclusive, and consider whether the framing serves someone's agenda. Many of life's most important decisions exist on continuums, not in binary categories.\n\nFor knowledge workers, recognizing false dichotomies prevents: premature closure on solutions, artificial constraints on creativity, manipulation by others' framings, and oversimplified mental models of complex systems.",
    "tags": [
        "logical-fallacies",
        "critical-thinking",
        "biases",
        "decision-making",
        "rhetoric"
    ],
    "category": "Cognitive Biases",
    "icon": "FaBalanceScale",
    "featured": false,
    "aliases": [
        "False dilemma",
        "Either-or fallacy",
        "Black-or-white fallacy",
        "Bifurcation fallacy"
    ],
    "relatedConcepts": [
        "all-or-nothing-thinking",
        "one-true-proposition-affliction",
        "framing-effect",
        "mu"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "False dilemma - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/False_dilemma",
            "type": "website"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/product/clarity-101",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-20",
    "dateModified": "2026-01-20"
}
