{
    "id": "feedback",
    "name": "Feedback",
    "summary": "The process of giving and receiving constructive information about performance, behavior, or outcomes to drive improvement and growth.",
    "explanation": "Feedback is a fundamental communication skill that involves providing or receiving information about past actions or behaviors in order to guide future performance and development. Effective feedback is one of the most powerful tools for continuous learning, both in professional and personal contexts.\n\nThere are several types of feedback. Positive feedback reinforces desired behaviors and motivates continued effort. Constructive feedback identifies areas for improvement while providing actionable guidance. Formative feedback is given during a process to help shape ongoing work, while summative feedback evaluates the final outcome. Each type serves a different purpose and is appropriate in different contexts.\n\nOne widely used framework for delivering feedback is the SBI model: Situation, Behavior, Impact. This approach involves describing the specific situation where the behavior occurred, articulating the observable behavior (without assumptions about intent), and explaining the impact that behavior had. This structure keeps feedback objective, specific, and actionable, reducing defensiveness and miscommunication.\n\nReceiving feedback gracefully is equally important. This means listening without interrupting, asking clarifying questions, separating your identity from the feedback, and thanking the person for their input even when it is difficult to hear. A growth mindset, which views abilities as developable rather than fixed, makes it easier to accept and act on feedback.\n\nPsychological safety plays a critical role in feedback culture. When people feel safe to give and receive honest feedback without fear of punishment or humiliation, the quality and frequency of feedback increases dramatically. Leaders who model vulnerability and receptiveness to feedback create environments where continuous improvement becomes the norm.\n\nCommon pitfalls include the much-debated feedback sandwich (positive-negative-positive), which can feel formulaic and insincere, as well as vague feedback that lacks specificity, delayed feedback that loses its relevance, and feedback that focuses on personality rather than behavior. The most effective feedback is timely, specific, behavior-focused, and delivered with genuine care for the recipient's development.",
    "tags": [
        "communication",
        "leadership",
        "learning",
        "performance"
    ],
    "category": "Communication",
    "icon": "FaComments",
    "featured": false,
    "aliases": [
        "Constructive feedback",
        "Performance feedback"
    ],
    "relatedConcepts": [
        "feedback-loop",
        "feedback-frequency",
        "growth-mindset",
        "active-listening"
    ],
    "relatedNotes": [
        "https://notes.dsebastien.net/30+Areas/33+Permanent+notes/33.02+Content/Feedback+is+a+powerful+tool+for+continuous+improvement",
        "https://notes.dsebastien.net/30+Areas/33+Permanent+notes/33.02+Content/How+to+give+structured+feedback"
    ],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "DeveloPassion's Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-22",
    "dateModified": "2026-02-22"
}
