{
    "id": "felt-sense",
    "name": "Felt Sense",
    "summary": "Eugene Gendlin's term for the holistic, bodily awareness of a situation that contains implicit meaning before it becomes explicit.",
    "explanation": "The felt sense is a concept developed by philosopher and psychologist Eugene Gendlin to describe the subtle, holistic, bodily sense of a situation or experience. It's the murky, unclear knowing in your body before you have words for it.\n\nWhat the felt sense is:\n- A physical sensation that carries meaning\n- More than emotion - it's the whole body's sense of something\n- Initially vague and unclear, but containing implicit knowledge\n- Located somewhere in the body (often chest, stomach, throat)\n- Different from discrete emotions like anger or sadness\n\nExamples:\n- The vague \"something's off\" feeling about a decision\n- The sense that there's \"more\" to say but you can't find words\n- The bodily shift when you finally understand something\n- The \"rightness\" feeling when a solution clicks\n\nGendlin's key discovery: When psychotherapy clients who made progress were studied, they shared one trait - they naturally checked in with their felt sense during sessions. This could be taught, leading to Focusing technique.\n\nWorking with the felt sense:\n1. Turn attention inward to the body\n2. Notice the unclear, holistic sense of a situation\n3. Stay with it without analyzing\n4. Let words, images, or understanding emerge from it\n5. Check any emerging understanding against the felt sense\n6. Notice the \"felt shift\" when something is right\n\nThe felt sense bridges body and meaning. It suggests that knowing isn't purely cognitive but embodied. Attending to the felt sense can unlock stuck problems and reveal implicit knowledge.",
    "tags": [
        "psychology",
        "body",
        "awareness",
        "phenomenology",
        "well-being"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaHeart",
    "featured": false,
    "aliases": [
        "Bodily felt sense",
        "Implicit knowing"
    ],
    "relatedConcepts": [
        "focusing",
        "interoception",
        "embodied-cognition",
        "somatic-experiencing",
        "intuition"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Focusing by Eugene Gendlin",
            "url": "https://www.amazon.com/dp/0553278339?tag=dsebastien00-20"
        },
        {
            "title": "Experiencing and the Creation of Meaning by Eugene Gendlin",
            "url": "https://www.amazon.com/dp/0810114275?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Focusing (psychotherapy) - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Focusing_(psychotherapy)",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-29",
    "dateModified": "2026-01-29"
}
