{
    "id": "five-hat-racks",
    "name": "Five Hat Racks",
    "summary": "Richard Saul Wurman's framework stating that there are only five ways to organize any information: location, alphabet, time, category, and hierarchy.",
    "explanation": "The Five Hat Racks is an information organization framework created by Richard Saul Wurman, the founder of TED conferences and a pioneer in information architecture. The core insight is deceptively simple yet profound: all information can only be organized in five fundamental ways, no matter the domain or context.\n\nThese five organizational schemes are often remembered by the acronym **LATCH**:\n\n- **Location**: Organizing information by where it exists in physical or virtual space. Examples include maps, floor plans, and geographical groupings.\n- **Alphabet**: Arranging items in alphabetical order. This is useful when the audience already knows the name of what they are looking for, such as in dictionaries, encyclopedias, or contact lists.\n- **Time**: Organizing information chronologically. Timelines, calendars, project schedules, and historical records all use temporal organization.\n- **Category**: Grouping items by type, similarity, or shared characteristics. Library classification systems, product categories in stores, and tag-based systems all rely on categorical organization.\n- **Hierarchy**: Arranging information by magnitude, importance, or rank. This can be from smallest to largest, least to most important, or any other measurable continuum. Examples include rankings, priority lists, and organizational charts.\n\nIn the context of Personal Knowledge Management (PKM), the Five Hat Racks framework is invaluable for designing effective organization systems. Folder structures often rely on **category** (grouping by topic or area). Tag systems combine **category** with the flexibility to apply multiple classifications. Daily notes and journals leverage **time**. Maps of Content (MOCs) can use **hierarchy** to surface the most important concepts. Understanding these five dimensions helps knowledge workers make deliberate choices about how to structure their notes and information.\n\nBeyond PKM, the framework is widely applied in information architecture, UX design, and library science. When designing a website navigation, for instance, a designer might organize products by **category**, allow alphabetical browsing, and offer sorting by price (**hierarchy**) or release date (**time**). The framework reminds us that these five options are not just suggestions but fundamental constraints of organization itself.\n\nThe power of the Five Hat Racks lies in recognizing that every organization challenge can be addressed by choosing one or more of these five strategies. When an existing system feels broken or hard to navigate, examining it through the lens of LATCH often reveals which organizational dimension is missing or poorly implemented.",
    "tags": [
        "frameworks",
        "organizations",
        "information-architecture",
        "knowledge-management"
    ],
    "category": "Frameworks",
    "icon": "FaLayerGroup",
    "featured": false,
    "aliases": [
        "LATCH framework",
        "Five ways to organize information",
        "Wurman's Five Hat Racks"
    ],
    "relatedConcepts": [
        "latch",
        "information-architecture",
        "taxonomy",
        "knowledge-organization",
        "hierarchical-organization"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Five hat racks - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Five_hat_racks",
            "type": "website"
        },
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Personal Knowledge Management Library",
            "url": "https://store.dsebastien.net/product/pkm-library",
            "type": "other"
        },
        {
            "title": "Personal Knowledge Management Coaching",
            "url": "https://store.dsebastien.net/product/pkm-coaching",
            "type": "other"
        },
        {
            "title": "DeveloPassion's Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        },
        {
            "title": "Personal Organization 101 Workshop",
            "url": "https://store.dsebastien.net/product/personal-organization-101",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-26",
    "dateModified": "2026-02-25"
}
