{
    "id": "flashbulb-memory",
    "name": "Flashbulb Memory",
    "summary": "A vivid, emotionally charged memory of a significant event that feels exceptionally accurate and detailed, yet research shows is just as prone to distortion and inaccuracy as ordinary memories.",
    "explanation": "Flashbulb memories are the vivid, seemingly photographic recollections people form around highly emotional or significant events — such as learning about a major disaster, a personal tragedy, or a historic moment. People typically remember exactly where they were, what they were doing, and who told them the news, with a strong sense of certainty that their memories are accurate.\n\nHowever, research by psychologist Ulric Neisser and others has demonstrated that flashbulb memories are surprisingly unreliable. In a landmark study following the Challenger space shuttle disaster, students recorded their experiences the day after the event. When re-interviewed three years later, their accounts had changed dramatically — yet they rated their confidence in the accuracy of their later (incorrect) memories at nearly 100%.\n\nThis reveals a critical insight: **emotional intensity does not equal accuracy**. The vividness and certainty we feel about a memory has little to no correlation with its actual correctness. Our brains reconstruct memories each time we recall them, and each reconstruction introduces potential distortions.\n\nUnderstanding flashbulb memory is important because:\n\n- It undermines the assumption that 'I remember it clearly' means 'it happened that way'\n- It highlights the **confidence-accuracy disconnect** — we can be completely wrong while feeling completely sure\n- It demonstrates that even our most cherished and vivid memories are stories we tell ourselves, not recordings of objective reality",
    "tags": ["psychology", "memory", "cognitive-biases", "perception"],
    "category": "Psychology & Mental Models",
    "icon": "FaBrain",
    "featured": false,
    "aliases": [],
    "relatedConcepts": ["false-memory", "memory-bias", "memory", "confabulation", "overconfidence-effect"],
    "relatedNotes": [],
    "references": [
        {"title": "Flashbulb memory - Wikipedia", "url": "https://en.wikipedia.org/wiki/Flashbulb_memory", "type": "website"},
        {"title": "Useful Not True by Derek Sivers", "url": "https://sive.rs/u", "type": "website"}
    ],
    "articles": [],
    "books": [],
    "tutorials": [],
    "datePublished": "2026-02-11",
    "dateModified": "2026-02-11"
}
