{
    "id": "flow-triggers",
    "name": "Flow Triggers",
    "summary": "Conditions and practices that increase the likelihood of entering flow states.",
    "explanation": "Flow triggers are conditions and practices that increase the probability of entering flow states. Steven Kotler's research identifies multiple trigger categories: Psychological (clear goals, immediate feedback, challenge-skill balance), Environmental (high consequences, rich environments, deep embodiment), Social (serious concentration, shared risk, close listening), and Creative (pattern recognition, risk-taking). Individual triggers vary in effectiveness, but common high-value triggers include: eliminating distractions, ensuring appropriate challenge level, having clear goals, and creating uninterrupted time blocks. Flow triggers work by: focusing attention, increasing engagement, and creating conditions where consciousness narrows to the present task. Understanding triggers helps: engineer environments for flow, identify personal flow patterns, and deliberately create flow-supporting conditions. For knowledge workers, leveraging flow triggers means: identifying which triggers work best personally, structuring work to include these triggers, and recognizing that flow can be cultivated rather than waited for.",
    "tags": [
        "focus",
        "flow",
        "performance",
        "productivity",
        "psychology"
    ],
    "category": "Concepts",
    "icon": "FaBolt",
    "featured": false,
    "aliases": [
        "Flow conditions",
        "Flow catalysts",
        "Flow enablers"
    ],
    "relatedConcepts": [
        "flow-state",
        "deep-work",
        "optimal-experience",
        "challenge-skill-balance",
        "focus-triggers",
        "peak-performance"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "The Rise of Superman by Steven Kotler",
            "url": "https://amzn.to/3Dp09NT",
            "type": "book"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
