{
    "id": "focus-triggers",
    "name": "Focus Triggers",
    "summary": "Environmental or behavioral cues that reliably initiate focused concentration.",
    "explanation": "Focus triggers are cues that reliably initiate focused concentration. Through consistent association, these triggers become automatic prompts for entering focus mode. Types include: environmental triggers (specific location, lighting, temperature), sensory triggers (particular music, sounds, scents), behavioral triggers (putting on headphones, closing doors), and temporal triggers (specific times of day). Trigger effectiveness builds through repetition - each pairing of trigger with focused work strengthens the association. Over time, the trigger alone begins to induce focus. Creating focus triggers involves: identifying what already helps, making it consistent, and protecting the association (not using the trigger during unfocused times). Multiple triggers can be stacked for stronger effect. For knowledge workers, developing focus triggers means: experimenting to find effective cues, being consistent in their use, and recognizing that trigger development takes time but pays dividends in easier focus initiation.",
    "tags": [
        "focus",
        "triggers",
        "habits",
        "productivity",
        "cues"
    ],
    "category": "Techniques",
    "icon": "FaBolt",
    "featured": false,
    "aliases": [
        "Concentration triggers",
        "Focus cues",
        "Work triggers"
    ],
    "relatedConcepts": [
        "action-triggers",
        "focus-rituals",
        "environmental-design",
        "habit-formation",
        "classical-conditioning",
        "deep-work"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
