{
    "id": "fog-of-war",
    "name": "Fog of War",
    "summary": "The uncertainty and incomplete information that exists in competitive, strategic, or complex situations where full visibility is impossible.",
    "explanation": "Fog of war is a military term coined by Carl von Clausewitz to describe the uncertainty that commanders face in battle - the gap between the information needed to make perfect decisions and the incomplete, often contradictory information actually available. The 'fog' includes: incomplete intelligence about enemy positions and intentions, miscommunication and delays in information flow, unpredictable environmental factors, and the chaos that emerges from complex interactions.\n\nBeyond military contexts, fog of war applies to any situation involving incomplete information and competing actors: business strategy (competitor moves, market dynamics), negotiations (counterparty interests and constraints), investing (market conditions and hidden information), and complex projects (unknown dependencies and risks).\n\nKey insights from the concept: (1) Perfect information is often impossible, not just difficult - accept uncertainty as inherent to complex situations. (2) Decision quality should be judged on process and available information, not just outcomes. (3) Flexible strategies that adapt to new information outperform rigid plans that assume certainty. (4) Information gathering has value but also costs and diminishing returns.\n\nStrategies for operating in fog: maintain situational awareness without analysis paralysis, build adaptive capabilities, use reconnaissance and probing actions to reduce uncertainty, preserve options when information is limited, and distinguish between reducible uncertainty (worth investigating) and irreducible uncertainty (must be accepted).",
    "tags": [
        "strategy",
        "uncertainty",
        "decision-making",
        "military",
        "information",
        "planning"
    ],
    "category": "Decision Science",
    "icon": "FaCloud",
    "featured": false,
    "aliases": [
        "Friction of war",
        "Clausewitzian uncertainty",
        "Strategic uncertainty"
    ],
    "relatedConcepts": [
        "epistemic-uncertainty",
        "unknown-unknowns",
        "information-asymmetry",
        "bounded-rationality"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "On War by Carl von Clausewitz",
            "url": "https://www.amazon.com/dp/0140444270?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Fog of war - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Fog_of_war",
            "type": "website"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/product/clarity-101",
            "type": "other"
        },
        {
            "title": "Personal Organization 101 Workshop",
            "url": "https://store.dsebastien.net/product/personal-organization-101",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-30",
    "dateModified": "2026-01-30"
}
