{
    "id": "foot-in-the-door-technique",
    "name": "Foot-in-the-Door Technique",
    "summary": "A persuasion strategy where agreeing to a small initial request increases the likelihood of agreeing to a larger subsequent request.",
    "explanation": "The foot-in-the-door technique is a compliance strategy that involves getting a person to agree to a small request first, which then increases the probability that they will agree to a larger, related request later. It was first studied experimentally by psychologists Jonathan Freedman and Scott Fraser in 1966.\n\nThe technique works through several psychological mechanisms. Self-perception theory suggests that after agreeing to the initial request, people begin to see themselves as the kind of person who supports that cause or agrees to such requests. Commitment and consistency pressure then motivates them to act in ways that align with this new self-image. Cognitive dissonance also plays a role — refusing the larger request after accepting the smaller one would create an uncomfortable inconsistency.\n\nClassic research demonstrated the effect powerfully. Residents who first agreed to place a small sign in their window were far more likely to later agree to a large, unsightly billboard in their yard. The initial small commitment fundamentally shifted their self-perception and subsequent behavior.\n\nThe technique is widely used in sales (free samples leading to purchases), fundraising (small donations leading to larger ones), onboarding (easy first steps leading to deeper engagement), and habit formation (starting with tiny habits that expand over time). In product design, progressive onboarding and freemium models leverage the same principle.\n\nThe ethical dimension is important: the technique can be used for mutual benefit (helping people build positive habits gradually) or for manipulation (exploiting commitment escalation). Awareness of the technique helps both in applying it ethically and in recognizing when it is being used on you.",
    "tags": [
        "psychology",
        "persuasion",
        "influence",
        "behavior-change",
        "social-psychology"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaRoute",
    "featured": false,
    "aliases": [
        "FITD technique",
        "Foot in the door",
        "Compliance escalation"
    ],
    "relatedConcepts": [
        "gateway-drug",
        "commitment-and-consistency",
        "escalation-of-commitment",
        "nudge-theory",
        "small-wins",
        "loss-leader",
        "social-proof",
        "reciprocity"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Foot-in-the-door technique - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Foot-in-the-door_technique",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-11",
    "dateModified": "2026-02-11"
}
