{
    "id": "foreshadowing",
    "name": "Foreshadowing",
    "summary": "A literary device where hints or clues are planted early in a narrative to suggest or prepare readers for future events.",
    "explanation": "Foreshadowing is the technique of planting subtle hints, clues, or warnings about events that will occur later in the story. It creates anticipation, builds tension, and makes plot developments feel earned rather than arbitrary. When done well, foreshadowing is invisible on first reading but obvious in retrospect. Types of foreshadowing: direct (explicit statements about the future), symbolic (objects or images that represent future events), prophetic (predictions or dreams), concrete (Chekhov's Gun - showing elements that will later be important), and red herrings (false foreshadowing that misdirects). Why use foreshadowing: it makes plot twists believable (readers subconsciously prepared), creates dramatic irony (readers sense danger characters don't), builds unity (early elements pay off later), and increases reread value (catching what you missed). Examples: ominous weather before disaster, character mentions a fear that later comes true, casual detail becomes crucial evidence. Balance: too obvious ruins surprise, too subtle feels like cheating when revealed. Good foreshadowing walks the line - noticeable enough in hindsight to feel fair, subtle enough initially to avoid spoiling. In the three-sided knowledge structure, foreshadowing is how authors communicate with attentive readers over characters' heads, creating a shared secret that generates anticipation.",
    "tags": [
        "storytelling",
        "writing",
        "literature",
        "techniques",
        "narratives",
        "craft"
    ],
    "category": "Writing & Content Creation",
    "icon": "FaRegLightbulb",
    "featured": false,
    "aliases": [
        "Narrative setup",
        "Story hints",
        "Planted clues"
    ],
    "relatedConcepts": [
        "dramatic-irony",
        "red-herring",
        "narrative-structure",
        "show-dont-tell"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Foreshadowing - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Foreshadowing",
            "type": "website"
        },
        {
            "title": "AI Ghostwriter Guide",
            "url": "https://store.dsebastien.net/l/ai-ghostwriter-guide",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-06",
    "dateModified": "2026-01-18"
}
