{
    "id": "free-software-foundation",
    "name": "Free Software Foundation (FSF)",
    "summary": "A nonprofit organization founded by Richard Stallman in 1985 to promote and defend software freedom through advocacy, licensing, and support of the GNU project.",
    "explanation": "The Free Software Foundation (FSF) is a nonprofit organization founded by Richard Stallman in 1985 to promote and defend software freedom. Headquartered in Boston, Massachusetts, the FSF supports the GNU project, maintains the GPL family of licenses, and advocates for users' rights to run, study, share, and modify software.\n\nThe FSF's mission extends beyond code. It campaigns against digital restrictions management (DRM), proprietary software in education, and software patents. The organization defined the Four Freedoms that serve as the philosophical foundation of the free software movement: the freedom to run the program for any purpose, to study and modify it, to redistribute copies, and to distribute modified versions. These freedoms distinguish free software from the more pragmatic open source approach.\n\nCore activities of the FSF include funding and coordinating development of GNU software, maintaining licenses such as GPL, LGPL, AGPL, and FDL, running advocacy campaigns for software freedom and against DRM, operating the 'Respects Your Freedom' hardware certification program, and providing GPL compliance and enforcement through licensing education.\n\nNotable FSF campaigns include 'Defective by Design' for anti-DRM advocacy, 'PlayOgg' promoting open media formats, 'Windows 7 Sins' campaigning against proprietary operating systems, and 'Free BIOS' advocating for open firmware.\n\nThe FSF remains the institutional backbone of the free software movement, providing legal, philosophical, and organizational support to ensure that software freedom is protected and promoted worldwide.",
    "tags": [
        "open-source",
        "free-software",
        "organizations"
    ],
    "category": "Software Development",
    "icon": "FaBuilding",
    "featured": false,
    "aliases": [
        "FSF"
    ],
    "relatedConcepts": [
        "gnu",
        "gpl-license",
        "open-source"
    ],
    "relatedNotes": [
        "https://notes.dsebastien.net/30+Areas/33+Permanent+notes/33.02+Content/Free+Software+Foundation+(FSF)"
    ],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Free Software Foundation - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Free_Software_Foundation",
            "type": "website"
        },
        {
            "title": "Free Software Foundation",
            "url": "https://www.fsf.org",
            "type": "website"
        },
        {
            "title": "What is Free Software?",
            "url": "https://www.gnu.org/philosophy/free-sw.html",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-28",
    "dateModified": "2026-01-28"
}
