{
    "id": "freytags-pyramid",
    "name": "Freytag's Pyramid",
    "summary": "A five-part dramatic structure model that maps the rising and falling tension of classical narratives through exposition, rising action, climax, falling action, and denouement.",
    "explanation": "Freytag's Pyramid is a dramatic structure framework developed by German novelist and playwright Gustav Freytag in his 1863 work 'Die Technik des Dramas' (The Technique of the Drama). Freytag analyzed the structure of ancient Greek and Shakespearean drama, identifying a consistent five-part pattern that governs how effective stories build and release dramatic tension.\n\nThe pyramid consists of five distinct parts that form a symmetrical shape when visualized. Exposition introduces the characters, setting, and initial situation, establishing the world before conflict disrupts it. Rising Action follows as complications and obstacles accumulate, building tension and stakes as the protagonist pursues their goals. The Climax sits at the pyramid's peak, representing the moment of highest tension where the central conflict reaches its turning point and the protagonist's fate hangs in the balance. Falling Action traces the consequences of the climax as events move toward resolution, often called the 'unraveling' as plot threads begin to close. Finally, the Denouement (or catastrophe in tragedy) provides closure, showing the new normal that emerges after the conflict's resolution.\n\nThe visual pyramid shape represents how dramatic tension operates: it builds gradually through the first half, peaks at the climax, then releases through the second half. This symmetry reflects Freytag's observation that classical drama devotes roughly equal attention to building tension and resolving it, unlike modern storytelling which often rushes toward endings.\n\nFreytag's Pyramid relates closely to the three-act structure but offers finer granularity. While three-act structure divides narrative into setup, confrontation, and resolution, Freytag's model subdivides these into five parts, providing more specific guidance for pacing dramatic tension. The three-act structure places its climax near the end, while Freytag's pyramid positions it at the center.\n\nThis framework was specifically designed for analyzing tragedy and classical drama, where protagonists often face downfall after the climax. The substantial falling action allows audiences to process the consequences of the climactic moment and experience catharsis. Greek tragedies and Shakespeare's plays follow this pattern closely, with the climax occurring roughly at the midpoint.\n\nModern storytelling often deviates from Freytag's model. Contemporary films and novels typically compress falling action and position the climax much closer to the ending, creating an asymmetrical structure. Action-oriented genres may feature multiple climactic moments rather than a single peak. Despite these variations, Freytag's Pyramid remains valuable for understanding classical dramatic structure, analyzing why certain stories feel balanced or rushed, and crafting narratives that give proper weight to both building tension and exploring its aftermath.",
    "tags": [
        "storytelling",
        "writing",
        "narrative",
        "structure",
        "drama"
    ],
    "category": "Frameworks",
    "icon": "FaSitemap",
    "featured": false,
    "aliases": [
        "Freytag's Triangle",
        "Dramatic Arc",
        "Five-Act Structure"
    ],
    "relatedConcepts": [
        "three-act-structure",
        "narrative-structure",
        "descending-action"
    ],
    "relatedNotes": [],
    "references": [
        {
            "title": "Dramatic structure - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Dramatic_structure",
            "type": "website"
        },
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "AI Ghostwriter Guide",
            "url": "https://store.dsebastien.net/product/ai-ghostwriter-guide",
            "type": "other"
        },
        {
            "title": "Personal Organization 101 Workshop",
            "url": "https://store.dsebastien.net/product/personal-organization-101",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        }
    ],
    "articles": [],
    "books": [],
    "tutorials": [],
    "datePublished": "2026-01-19",
    "dateModified": "2026-01-29"
}
