{
  "id": "functionalism",
  "name": "Functionalism",
  "summary": "A philosophy of mind theory that defines mental states by their functional roles - what they do rather than what they are made of.",
  "explanation": "Functionalism is a position in philosophy of mind that defines mental states by their functional roles - what they do, not what they're made of. Pain, for instance, is whatever state is caused by tissue damage, causes distress, and motivates avoidance behavior. This allows the same mental state to be realized in different physical systems (multiple realizability): humans, aliens, or computers could all feel pain if they have the right functional organization.\n\nFunctionalism was developed by Hilary Putnam and Jerry Fodor in the 1960s as an alternative to both dualism and reductive materialism. It became the dominant view in cognitive science, supporting the computer metaphor of mind - the idea that the mind is like software running on the brain's hardware.\n\nKey concepts include multiple realizability (same function, different substrates), causal role (mental states defined by their causes and effects), and machine functionalism (mind as software on hardware).\n\nCritics argue that functionalism ignores qualia - the subjective 'feel' of experience. A functional duplicate might behave identically but have no inner experience, which is the philosophical zombie problem raised by David Chalmers. This suggests that functional organization alone may not capture everything about mental life.",
  "tags": ["philosophy", "philosophy-of-mind", "cognition", "consciousness", "mental-models"],
  "category": "Philosophy & Wisdom",
  "icon": "FaBrain",
  "featured": false,
  "aliases": ["Functionalist"],
  "relatedConcepts": ["consciousness", "philosophy-of-mind", "dualism", "qualia"],
  "relatedNotes": ["https://notes.dsebastien.net/30+Areas/33+Permanent+notes/33.02+Content/Functionalism"],
  "articles": [],
  "books": [
    {
      "title": "The Mind's I by Douglas Hofstadter and Daniel Dennett",
      "url": "https://www.amazon.com/dp/0465030912?tag=dsebastien00-20"
    }
  ],
  "references": [
    {
      "title": "Functionalism - Wikipedia",
      "url": "https://en.wikipedia.org/wiki/Functionalism_(philosophy_of_mind)",
      "type": "website"
    }
  ],
  "tutorials": [],
  "datePublished": "2026-01-28",
  "dateModified": "2026-01-28"
}
