{
    "id": "gateway-drug",
    "name": "Gateway Drug",
    "summary": "The idea that a minor or entry-level experience leads progressively to more significant or extreme engagement.",
    "explanation": "The gateway drug concept originated in substance abuse research, describing how exposure to a less harmful substance might lead to the use of more dangerous ones. However, the idea has become a powerful metaphor that applies far beyond its original context, describing any situation where a small initial step creates a pathway toward deeper engagement.\n\nIn its broader, metaphorical sense, a gateway drug is any entry-level experience that lowers the barrier to more significant commitment. A free trial is a gateway to a paid subscription. A beginner's tutorial is a gateway to mastering a complex skill. A simple note-taking app can be a gateway to building a full personal knowledge management system.\n\nThe mechanism works through several psychological principles. Initial exposure reduces unfamiliarity and fear, making the next step seem less daunting. Small early investments create commitment and consistency pressure. Each step shifts the person's identity, making further progression feel natural rather than radical.\n\nIn business and product design, understanding gateway dynamics is essential. Loss leaders, freemium models, and onboarding sequences all leverage the gateway principle. The key is designing an initial experience that is valuable on its own while naturally leading toward deeper engagement.\n\nCritically, the gateway concept is often misused as a slippery slope argument — the assumption that progression is inevitable. In reality, most people who try entry-level experiences do not progress to extremes. The value of the concept lies not in predicting inevitable escalation, but in understanding how pathways of increasing engagement are created and navigated.",
    "tags": [
        "psychology",
        "persuasion",
        "behavior-change",
        "mental-models"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaDoorOpen",
    "featured": false,
    "aliases": [
        "Gateway effect",
        "Stepping stone theory",
        "Gateway hypothesis"
    ],
    "relatedConcepts": [
        "slippery-slope",
        "foot-in-the-door-technique",
        "escalation-of-commitment",
        "loss-leader",
        "nudge-theory",
        "commitment-and-consistency",
        "domino-effect",
        "threshold-concepts"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Gateway drug theory - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Gateway_drug_theory",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-11",
    "dateModified": "2026-02-11"
}
