{
    "id": "global-workspace-theory",
    "name": "Global Workspace Theory",
    "summary": "A cognitive theory of consciousness proposing that conscious awareness arises when information is broadcast from a global workspace to multiple specialized brain systems simultaneously.",
    "explanation": "Global Workspace Theory (GWT), proposed by Bernard Baars in 1988, explains consciousness as a 'global broadcast' system. The brain contains many specialized, unconscious processors operating in parallel. Consciousness arises when information is selected and broadcast to a global workspace, making it available to multiple systems (memory, language, motor planning) simultaneously.\n\nThe theory uses the metaphor of a theater spotlight: consciousness is like a bright spot on stage that illuminates one thing at a time for the entire audience. While many actors (unconscious processes) wait in the wings, only those in the spotlight become available to the whole theater (conscious awareness).\n\nStanislas Dehaene extended GWT into Global Neuronal Workspace Theory, identifying the prefrontal-parietal network as the neural correlate of the global workspace. This extension provided neuroscientific grounding for the cognitive theory, showing how specific brain networks implement the broadcasting mechanism.\n\nThe theory elegantly explains several aspects of consciousness: why attention is required for conscious experience, how working memory relates to awareness, and why we can only be consciously aware of one thing at a time (the 'bottleneck' of consciousness). It remains one of the leading scientific theories of consciousness alongside Integrated Information Theory.",
    "tags": ["neuroscience", "consciousness", "cognition", "cognitive-science", "attention"],
    "category": "Psychology & Mental Models",
    "icon": "FaBrain",
    "featured": false,
    "aliases": ["GWT", "Global Neuronal Workspace", "Global Neuronal Workspace Theory"],
    "relatedConcepts": ["consciousness", "cognitive-architecture", "working-memory", "attention-types"],
    "relatedNotes": ["https://notes.dsebastien.net/30+Areas/33+Permanent+notes/33.02+Content/Global+Workspace+Theory"],
    "articles": [],
    "books": [
        { "title": "A Cognitive Theory of Consciousness by Bernard Baars", "url": "https://www.amazon.com/dp/0521427436?tag=dsebastien00-20" },
        { "title": "Consciousness and the Brain by Stanislas Dehaene", "url": "https://www.amazon.com/dp/0143126261?tag=dsebastien00-20" }
    ],
    "references": [
        { "title": "Global Workspace Theory - Wikipedia", "url": "https://en.wikipedia.org/wiki/Global_workspace_theory", "type": "website" }
    ],
    "tutorials": [],
    "datePublished": "2026-01-28",
    "dateModified": "2026-01-28"
}
