{
    "id": "gratitude-journal",
    "name": "Gratitude Journal",
    "summary": "A journaling practice dedicated to regularly recording things you are grateful for, fostering appreciation and improving overall well-being.",
    "explanation": "A gratitude journal is a dedicated space where you regularly write down things you appreciate, feel thankful for, or that brought you joy. The practice has been extensively studied by psychologist Robert Emmons, whose research demonstrates significant benefits for psychological and physical well-being, including increased happiness, reduced depression, and improved sleep quality.\n\nThe most common format is the 'three good things' exercise, where you write down three things you are grateful for each day. However, more detailed approaches involve writing in depth about why you are grateful for a particular person, event, or circumstance. The key is specificity — rather than writing 'I'm grateful for my family,' describing a particular moment or quality makes the practice more effective.\n\nTiming considerations vary by preference. Morning gratitude journaling can set a positive tone for the day ahead, while evening entries allow you to reflect on the day's highlights. Research suggests consistency matters more than timing, so choosing a time that fits your routine is most important.\n\nOne of the most powerful effects of gratitude journaling is its ability to counteract the brain's natural negativity bias. By intentionally focusing on positive aspects of life, you gradually train your attention to notice good things more readily. Over time, this rewires habitual thought patterns, making gratitude a more automatic response rather than a deliberate effort.",
    "tags": [
        "journaling",
        "gratitude",
        "well-being",
        "habits"
    ],
    "category": "Journaling",
    "icon": "FaHeart",
    "featured": false,
    "aliases": [
        "Gratitude diary",
        "Thankfulness journal"
    ],
    "relatedConcepts": [
        "journaling",
        "gratitude-practice",
        "gratitude-benefits",
        "gratitude-prompts",
        "expressing-gratitude"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Thanks! by Robert Emmons",
            "url": "https://www.amazon.com/dp/0547085737?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Journaling Deep Dive Workshop",
            "url": "https://store.dsebastien.net/product/journaling-deep-dive",
            "type": "other"
        },
        {
            "title": "Personal Organization 101 Workshop",
            "url": "https://store.dsebastien.net/product/personal-organization-101",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-26",
    "dateModified": "2026-02-22"
}
