{
    "id": "greenwashing",
    "name": "Greenwashing",
    "summary": "The practice of making misleading claims about the environmental benefits of a product, service, or company to appear more sustainable than it actually is.",
    "explanation": "Greenwashing is a deceptive marketing practice where a company presents a misleadingly positive image of its environmental impact. The term was coined by environmentalist Jay Westerveld in 1986, inspired by hotels that asked guests to reuse towels to save the environment while making no meaningful efforts to reduce their overall environmental footprint. Since then, greenwashing has become one of the most studied forms of corporate deception.\n\nGreenwashing operates through several common tactics. Vague claims use imprecise language like eco-friendly, natural, or green without specific evidence or standards. Hidden trade-offs highlight one small environmental benefit while ignoring larger negative impacts. The lesser of two evils makes a harmful product seem environmentally responsible by comparing it to something worse. Irrelevant claims tout compliance with regulations as if they were voluntary environmental initiatives. Outright fabrication involves making up certifications, statistics, or environmental benefits.\n\nThe TerraChoice consultancy identified seven sins of greenwashing that became a widely used framework. These include the sin of the hidden trade-off, sin of no proof, sin of vagueness, sin of worshipping false labels, sin of irrelevance, sin of lesser of two evils, and sin of fibbing. Research using this framework found that the vast majority of supposedly green products committed at least one of these sins.\n\nGreenwashing causes significant harm beyond consumer deception. It undermines trust in genuine sustainability efforts, making it harder for truly environmentally responsible companies to differentiate themselves. It delays meaningful action on environmental issues by creating the illusion of progress. It also distorts market signals, directing consumer spending toward companies with good marketing rather than good environmental practices.\n\nRegulatory responses have intensified. The European Union's Green Claims Directive requires companies to substantiate environmental claims with scientific evidence. The FTC's Green Guides in the US provide standards for environmental marketing claims. Various countries have introduced or strengthened laws against misleading environmental advertising. Courts have increasingly held companies liable for unsubstantiated green claims.\n\nThe concept of greenwashing has spawned related terms for similar deceptive practices in other domains. AI washing applies the same logic to artificial intelligence claims. Bluewashing refers to misleading claims about social responsibility. Pinkwashing involves superficial support for LGBTQ+ causes. Wokewashing describes performative social justice positioning. These variants highlight how the greenwashing playbook has been adapted across different forms of corporate messaging.",
    "tags": ["ethics", "marketing", "sustainability", "critical-thinking", "deception"],
    "category": "Business & Economics",
    "icon": "FaLightbulb",
    "featured": false,
    "aliases": ["Green Sheen", "Eco-Washing"],
    "relatedConcepts": ["ai-washing", "ai-ethics", "hype-cycle", "critical-thinking", "brand-awareness"],
    "relatedNotes": [],
    "references": [
        {"title": "Greenwashing - Wikipedia", "url": "https://en.wikipedia.org/wiki/Greenwashing", "type": "website"}
    ],
    "articles": [],
    "books": [],
    "tutorials": [],
    "datePublished": "2026-02-27",
    "dateModified": "2026-02-27"
}
