{
    "id": "grit",
    "name": "Grit",
    "summary": "The combination of passion and perseverance for long-term goals that predicts success better than talent or IQ.",
    "explanation": "Grit is a psychological trait identified by Angela Duckworth through her research at the University of Pennsylvania. It represents the combination of two key components: passion (sustained interest over years) and perseverance (continued effort despite setbacks, boredom, and plateaus). Duckworth's research demonstrates that grit predicts success in challenging environments—including West Point military academy, the National Spelling Bee, and sales positions—better than traditional measures like talent or IQ.\n\nThe concept differs from mere persistence in an important way: grit includes passion, meaning you care deeply about specific long-term goals, not just general effort. Duckworth's formula illustrates why effort matters so much: Talent x Effort = Skill, and Skill x Effort = Achievement. This means effort counts twice in the achievement equation.\n\nGritty individuals maintain their determination and motivation over extended periods despite failures and adversity. They have a clear sense of direction and are willing to endure short-term discomfort for long-term gains. This connects closely to Growth Mindset (believing abilities can develop) and Deliberate Practice (structured, purposeful practice).\n\nCritics note that grit overlaps significantly with the personality trait of conscientiousness, and that structural advantages (access to resources, supportive environments) may matter more than individual grit in many contexts. Nevertheless, cultivating grit—through finding work that matters to you and developing resilience through challenges—remains a valuable pursuit for long-term achievement.",
    "tags": [
        "psychology",
        "personal-growth",
        "mindsets",
        "successes",
        "goals"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaFistRaised",
    "featured": false,
    "aliases": [
        "Grit (psychology)"
    ],
    "relatedConcepts": [
        "deliberate-practice",
        "growth-mindset",
        "persistence",
        "self-discipline",
        "talent-vs-effort"
    ],
    "relatedNotes": [
        "https://notes.dsebastien.net/30+Areas/33+Permanent+notes/33.02+Content/Grit"
    ],
    "articles": [],
    "books": [
        {
            "title": "Grit by Angela Duckworth",
            "url": "https://www.amazon.com/dp/1501111108?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Grit (personality trait) - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Grit_(personality_trait)",
            "type": "website"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Journaling Deep Dive Workshop",
            "url": "https://store.dsebastien.net/product/journaling-deep-dive",
            "type": "other"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/product/clarity-101",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-28",
    "dateModified": "2026-01-29"
}
