{
    "id": "groupthink",
    "name": "Groupthink",
    "summary": "A psychological phenomenon where the desire for harmony and conformity in a group leads to irrational or dysfunctional decision-making.",
    "explanation": "Groupthink occurs when a group prioritizes consensus and cohesion over critical evaluation of alternatives. Members suppress dissenting opinions, avoid conflict, and conform to what they believe the group wants, often resulting in poor decisions that no individual would make alone.\n\nThe concept was introduced by social psychologist Irving Janis in 1972, who studied major policy fiascoes like the Bay of Pigs invasion and the escalation of the Vietnam War. Janis identified that highly cohesive groups with strong leaders, under pressure to make decisions, were particularly susceptible to groupthink.\n\nKey symptoms of groupthink include: illusion of invulnerability leading to excessive optimism; collective rationalization dismissing warnings; belief in the inherent morality of the group; stereotyped views of out-groups; pressure on dissenters to conform; self-censorship of deviating ideas; illusion of unanimity; and emergence of self-appointed 'mindguards' who shield the group from contradictory information.\n\nTo prevent groupthink: encourage open debate and critical evaluation; assign a devil's advocate role; seek outside opinions and expertise; break into smaller subgroups for independent analysis; allow anonymous feedback; ensure leaders speak last to avoid anchoring the discussion; and create psychological safety where dissent is welcomed rather than punished.",
    "tags": [
        "psychology",
        "decision-making",
        "cognitive-biases",
        "group-dynamics",
        "bias"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaUsers",
    "featured": false,
    "aliases": [
        "Group think",
        "Herd mentality"
    ],
    "relatedConcepts": [
        "echo-chamber",
        "cognitive-biases",
        "social-proof",
        "collective-intelligence",
        "wisdom-of-crowds"
    ],
    "relatedNotes": [
        "https://notes.dsebastien.net/Groupthink"
    ],
    "articles": [],
    "books": [
        {
            "title": "Victims of Groupthink by Irving L. Janis",
            "url": "https://www.amazon.com/dp/0395140447?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Groupthink - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Groupthink",
            "type": "website"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/l/knowii-clarity-101",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-28",
    "dateModified": "2026-01-28"
}
