{
    "id": "hard-skills",
    "name": "Hard Skills",
    "summary": "Technical, teachable abilities that can be defined, measured, and quantified.",
    "explanation": "Hard skills are specific, teachable abilities that can be clearly defined, measured, and demonstrated. They're typically acquired through formal education, training programs, certifications, or on-the-job experience. Examples include programming languages, data analysis, accounting, machine operation, foreign languages, and technical writing.\n\nHard skills are characterized by their objectivity—you either know how to code in Python or you don't, you can either perform a statistical analysis or you can't. They're often listed explicitly in job descriptions and can be verified through tests, portfolios, or credentials. This measurability makes them the primary focus of traditional education and hiring processes.\n\nHowever, hard skills alone are insufficient for career success. They depreciate over time as technology and industries evolve—the half-life of technical skills is shrinking. A programming language mastered today may be obsolete in a decade. This makes continuous learning essential and highlights the importance of meta-skills (learning how to learn) alongside specific technical competencies.\n\nThe most effective professionals combine hard skills with soft skills. Technical expertise provides the capability to do work, while interpersonal abilities determine how effectively that expertise is applied within teams and organizations. Neither is sufficient alone: a brilliant programmer who can't communicate or collaborate will struggle, as will a charismatic communicator with no technical depth.",
    "tags": [
        "skills",
        "careers",
        "learning",
        "expertise",
        "professional-development"
    ],
    "category": "Learning & Education",
    "icon": "FaTools",
    "featured": false,
    "aliases": [
        "Technical Skills",
        "Specialized Skills",
        "Domain Skills"
    ],
    "relatedConcepts": [
        "soft-skills",
        "t-shaped-skills",
        "skill-stacking",
        "deliberate-practice"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Range by David Epstein",
            "url": "https://www.amazon.com/dp/0735214484"
        }
    ],
    "references": [
        {
            "title": "Hard Skills vs. Soft Skills - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Soft_skills#Hard_skills",
            "type": "website"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "DeveloPassion's Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-25",
    "dateModified": "2026-01-25"
}
