{
    "id": "holism",
    "name": "Holism",
    "summary": "The principle that systems should be understood as integrated wholes rather than just collections of parts, as the whole exhibits properties not present in components.",
    "explanation": "Holism is the philosophical principle that systems and their properties should be viewed as wholes, not merely as collections of parts. The central insight is that the whole is greater than—or at least different from—the sum of its parts.\n\n**Core principles:**\n\n**Emergence**: Wholes have properties that components lack. Water's wetness doesn't exist in hydrogen or oxygen atoms. Consciousness doesn't exist in individual neurons.\n\n**Context dependence**: Parts behave differently within different wholes. A cell behaves differently in a liver than in a kidney. A word means different things in different sentences.\n\n**Relationships matter**: The connections between parts are as important as the parts themselves. A symphony is not just instruments—it's their coordination.\n\n**Downward causation**: The whole influences the parts. Your intentions (a property of your whole mind) direct your neurons' activity.\n\n**Applications:**\n\n**Medicine**: Treating the whole person, not just symptoms—considering lifestyle, psychology, environment.\n\n**Ecology**: Understanding ecosystems as interconnected wholes, not isolated species.\n\n**Organizations**: Culture emerges from relationships and cannot be reduced to individual employees.\n\n**Systems thinking**: Understanding feedback loops, emergent behaviors, and unintended consequences.\n\n**Holism vs. Reductionism:**\nNeither is universally correct. Reductionism excels at understanding mechanisms; holism captures emergent dynamics. The best analysis often alternates between both—zooming in to understand parts and zooming out to see patterns.\n\n\"The whole is other than the sum of its parts.\" — Kurt Koffka (often misquoted as \"greater than\")",
    "tags": [
        "philosophy",
        "systems-thinking",
        "emergence",
        "thinking",
        "complexity",
        "perspectives"
    ],
    "category": "Philosophy & Wisdom",
    "icon": "FaCircle",
    "featured": false,
    "aliases": [
        "Holistic Thinking",
        "Holistic Approach",
        "Wholeness"
    ],
    "relatedConcepts": [
        "reductionism",
        "emergence",
        "systems-thinking",
        "gestalt",
        "complexity-theory",
        "bottom-up-analysis"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Holism - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Holism",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-16",
    "dateModified": "2026-01-16"
}
