{
    "id": "host-leadership",
    "name": "Host Leadership",
    "summary": "A leadership approach where leaders act as hosts who prepare the space, invite participation, and step back to let teams work autonomously while retaining authority to intervene.",
    "explanation": "Host Leadership is a leadership model developed by Mark McKergow and Helen Bailey that uses the metaphor of hosting to describe how leaders can create the conditions for great work without either commanding from above or serving from below. The host leader prepares the space, invites people in, provides what's needed, and then steps back - but never abandons the room entirely.\n\nThe model addresses a key tension in modern leadership. Traditional command-and-control is too rigid for knowledge work. But servant leadership, while well-intentioned, can obscure a real power dynamic: the leader still holds authority over hiring, firing, and direction, and pretending otherwise can feel inauthentic. Host leadership acknowledges the leader's power honestly while channeling it toward creating the best possible conditions for the team.\n\nA host leader operates in several positions, moving fluidly between them. In the spotlight, the host initiates, sets direction, and communicates purpose. With the guests, the host participates as a peer, contributing alongside the team. In the gallery, the host observes from a distance, gathering perspective on how things are going. In the kitchen, the host works behind the scenes, preparing resources and removing obstacles.\n\nThe hosting metaphor illuminates several leadership principles. Preparation matters: a good host prepares the space before guests arrive, just as a leader should set up projects, environments, and resources before asking the team to engage. Invitation beats instruction: a host invites guests and makes them feel welcome, creating voluntary engagement rather than compliance. Stepping back enables others: once the gathering is underway, the best hosts don't dominate but let conversations and connections flourish. Retained responsibility: if something goes seriously wrong, the host steps in - they haven't abdicated responsibility by stepping back.\n\nHost leadership is particularly effective in agile software development, creative teams, and knowledge work environments where autonomy, mastery, and purpose drive performance. It was brought to wider attention through Martin Fowler's writing and its adoption in technical leadership circles.",
    "tags": [
        "leadership",
        "management",
        "agile",
        "autonomy",
        "empowerment"
    ],
    "category": "Leadership & Management",
    "icon": "FaDoorOpen",
    "featured": false,
    "aliases": [
        "Leader as Host",
        "Hosting Leadership",
        "McKergow Leadership Model"
    ],
    "relatedConcepts": [
        "servant-leadership",
        "empowering-leadership",
        "facilitative-leadership",
        "coaching-leadership",
        "situational-leadership",
        "stewardship-delegation",
        "psychological-safety"
    ],
    "relatedNotes": [],
    "articles": [
        {
            "title": "Host Leadership - Martin Fowler",
            "url": "https://martinfowler.com/bliki/HostLeadership.html",
            "type": "website"
        }
    ],
    "books": [
        {
            "title": "Host: Six new roles of engagement for teams, organizations, communities and movements by Mark McKergow and Helen Bailey",
            "url": "https://www.amazon.com/dp/0954974980?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Dev Concepts",
            "url": "https://dev-concepts.dev",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-20",
    "dateModified": "2026-02-20"
}
