{
  "id": "humanism",
  "name": "Humanism",
  "summary": "A philosophical stance emphasizing human agency, reason, and welfare as the basis for ethics and meaning without appeal to supernatural authority.",
  "explanation": "Humanism is a philosophical stance that emphasizes human agency, reason, and welfare as the basis for ethics and meaning—without appeal to supernatural authority. Renaissance humanism recovered classical learning; Enlightenment humanism championed reason, science, and individual rights; modern secular humanism grounds ethics in human flourishing rather than divine command.\n\nCore commitments include: human dignity and rights, reason and evidence over faith, this-worldly ethics focused on reducing suffering and promoting well-being. The humanist framework emphasizes expanding moral circles to include more beings over time.\n\nCritics argue humanism is anthropocentric (ignoring animals and the environment) or that it smuggles in values it cannot justify without religion. Defenders counter that humanist ethics—rooted in empathy, reason, and expanding moral circles—has driven moral progress including abolition and rights movements.",
  "tags": [
    "philosophies",
    "ethics",
    "values",
    "rationality",
    "well-being"
  ],
  "category": "Philosophy & Wisdom",
  "icon": "FaLightbulb",
  "featured": false,
  "aliases": [
    "Secular Humanism"
  ],
  "relatedConcepts": [
    "rationalism"
  ],
  "relatedNotes": [
    "https://notes.dsebastien.net/30+Areas/33+Permanent+notes/33.02+Content/Humanism"
  ],
  "articles": [],
  "books": [
    {
      "title": "Enlightenment Now by Steven Pinker",
      "url": "https://www.amazon.com/dp/0525427570?tag=dsebastien00-20"
    }
  ],
  "references": [
    {
      "title": "Humanism - Wikipedia",
      "url": "https://en.wikipedia.org/wiki/Humanism",
      "type": "website"
    },
    {
      "title": "Clarity 101 Workshop",
      "url": "https://store.dsebastien.net/product/clarity-101",
      "type": "other"
    },
    {
      "title": "Knowii Community",
      "url": "https://store.dsebastien.net/product/knowii-community",
      "type": "other"
    }
  ],
  "tutorials": [],
  "datePublished": "2026-01-28",
  "dateModified": "2026-01-29"
}
