{
    "id": "hype-cycle",
    "name": "Hype Cycle",
    "summary": "A model developed by Gartner that describes the typical progression of emerging technologies through phases of inflated expectations, disillusionment, and eventual productive adoption.",
    "explanation": "The Hype Cycle is a branded graphical model created by the research and advisory firm Gartner in 1995 to represent the maturity, adoption, and social application of specific technologies. It provides a framework for understanding how new technologies move through predictable phases of public perception, from initial excitement through disappointment to eventual productive use.\n\nThe model describes five distinct phases. The Innovation Trigger is when a potential technology breakthrough gets things started, often through early proof-of-concept stories and media interest. No usable products exist yet, and commercial viability is unproven. The Peak of Inflated Expectations follows as early publicity produces a number of success stories, often accompanied by scores of failures, but the failures receive less attention. A bandwagon effect takes hold as companies rush to adopt or claim association with the technology.\n\nThe Trough of Disillusionment arrives as interest wanes after experiments and implementations fail to deliver on the inflated promises. Producers of the technology shake out or fail, and investments continue only if surviving providers improve their products. The Slope of Enlightenment emerges as more instances of how the technology can benefit the enterprise start to crystallize. Second and third generation products appear, and more organizations fund pilots, though conservative companies remain cautious.\n\nFinally, the Plateau of Productivity is reached when mainstream adoption starts to take off. The technology's broad market applicability and relevance are clearly paying off. At this stage, assessment criteria for provider viability are more clearly defined, and the technology's real-world effectiveness is demonstrated and accepted.\n\nGartner publishes annual Hype Cycle reports for various technology domains, including artificial intelligence, emerging technologies, and digital workplace technologies. These reports plot dozens of specific technologies along the curve, providing organizations with a visual assessment of where each technology stands in its maturation.\n\nThe Hype Cycle has both advocates and critics. Supporters find it useful for tempering unrealistic expectations and timing technology investments. Critics argue it oversimplifies technology adoption, lacks empirical validation, conflates media hype with actual technology progress, and that Gartner's technology placements can be influenced by vendor relationships. Despite these criticisms, the model has become one of the most widely referenced frameworks for discussing technology maturity and is frequently invoked in discussions about AI hype, blockchain, metaverse, and other emerging technologies.",
    "tags": ["frameworks", "technologies", "innovation", "critical-thinking", "strategies"],
    "category": "Frameworks",
    "icon": "FaStream",
    "featured": false,
    "aliases": ["Gartner Hype Cycle", "Technology Hype Cycle"],
    "relatedConcepts": ["technology-adoption-lifecycle", "ai-washing", "techno-solutionism", "greenwashing"],
    "relatedNotes": [],
    "references": [
        {"title": "Gartner hype cycle - Wikipedia", "url": "https://en.wikipedia.org/wiki/Gartner_hype_cycle", "type": "website"}
    ],
    "articles": [],
    "books": [],
    "tutorials": [],
    "datePublished": "2026-02-27",
    "dateModified": "2026-02-27"
}
