{
    "id": "idea-maze",
    "name": "Idea Maze",
    "summary": "A mental model for navigating the complex landscape of startup decisions by understanding all possible paths and their historical outcomes.",
    "explanation": "The idea maze, coined by Balaji Srinivasan and popularized by Chris Dixon, represents the complex decision landscape that founders must navigate when building a company. Rather than thinking of a startup as executing on a single idea, the maze metaphor captures how every startup idea branches into countless possible paths, each leading to different outcomes—some to success, many to dead ends. A founder who truly knows their idea maze understands: the history of their market going back decades, why previous attempts succeeded or failed, what technological or market shifts now enable new possibilities, who the key players are, and which paths have already been tried. Investors like Marc Andreessen use the idea maze as a framework to assess founders—those who can articulate their maze demonstrate deep domain expertise and strategic thinking. The practical implication is that startup success isn't about having a brilliant idea, but about having the knowledge to navigate correctly when each decision point arrives. This requires studying market history, understanding competitive dynamics, and developing strong mental models for predicting which paths lead to treasure versus certain death. Critics note the maze is more random than it appears, but the framework remains valuable for forcing systematic thinking about strategic options.",
    "tags": [
        "startups",
        "entrepreneurship",
        "strategies",
        "decisions",
        "mental-models"
    ],
    "category": "Business & Economics",
    "icon": "FaProjectDiagram",
    "featured": false,
    "aliases": [
        "Startup maze",
        "Decision maze",
        "Strategic navigation"
    ],
    "relatedConcepts": [
        "first-principles",
        "pivot-or-persevere",
        "path-dependence",
        "lean-startup",
        "customer-discovery",
        "product-market-fit",
        "decision-tree"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "The Hard Thing About Hard Things by Ben Horowitz",
            "url": "https://www.amazon.com/dp/0062273205?tag=dsebastien00-20"
        },
        {
            "title": "Zero to One by Peter Thiel",
            "url": "https://www.amazon.com/dp/0804139296?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "The idea maze - cdixon",
            "url": "https://cdixon.org/2013/08/04/the-idea-maze/",
            "type": "website"
        },
        {
            "title": "Balaji Srinivasan on the Idea Maze",
            "url": "https://spark-public.s3.amazonaws.com/startup/lecture_slides/lecture5-market-702702start.pdf",
            "type": "paper"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-16",
    "dateModified": "2026-01-16"
}
