{
  "id": "infinite-games",
  "name": "Infinite Games",
  "summary": "Games played with the purpose of continuing play rather than winning.",
  "explanation": "Infinite games, a concept introduced by philosopher James Carse in 'Finite and Infinite Games' (1986) and later popularized by Simon Sinek in 'The Infinite Game' (2019), are games where the objective is not to win but to perpetuate the game itself. Unlike finite games with fixed rules, known players, and clear endpoints, infinite games have no finish line - the goal is to keep playing.\n\nKey characteristics of infinite games:\n\n1. Unknown players: New participants can join at any time\n2. Changeable rules: Rules evolve as the game progresses\n3. No defined endpoint: The game continues indefinitely\n4. Success = longevity: Staying in the game matters more than short-term wins\n\nExamples of infinite games:\n- Business: Companies don't 'win' business - they aim to stay viable indefinitely\n- Education: Learning is lifelong, not something you complete\n- Relationships: Healthy relationships don't have victory conditions\n- Career: Professional development continues throughout life\n- Democracy: Political systems aim to perpetuate themselves\n\nThe infinite mindset requires:\n- A just cause (purpose beyond profit)\n- Trusting teams (vulnerability-based relationships)\n- Worthy rivals (competitors who make you better)\n- Existential flexibility (willingness to make drastic strategic shifts)\n- Courage to lead (prioritizing long-term over short-term)\n\nProblems arise when infinite games are played with a finite mindset: obsessing over quarterly results, treating business as war to be won, burning out to 'beat' competitors. These approaches may yield short-term gains but often lead to long-term failure.\n\nFor knowledge workers, the infinite game perspective encourages: building sustainable careers over chasing promotions, developing lasting relationships over transactional networking, creating enduring value over quick wins, and viewing setbacks as part of ongoing play rather than defeats.",
  "tags": [
    "strategies",
    "leadership",
    "philosophies",
    "game-theory",
    "long-term-thinking"
  ],
  "category": "Philosophy & Wisdom",
  "icon": "FaInfinity",
  "featured": false,
  "aliases": [
    "The Infinite Game",
    "Infinite mindset",
    "Playing infinite games"
  ],
  "relatedConcepts": [
    "finite-games",
    "game-theory",
    "zero-sum-positive-sum"
  ],
  "relatedNotes": [],
  "articles": [],
  "books": [
    {
      "title": "Finite and Infinite Games by James P. Carse",
      "url": "https://www.amazon.com/dp/1476731713?tag=dsebastien00-20"
    },
    {
      "title": "The Infinite Game by Simon Sinek",
      "url": "https://www.amazon.com/dp/073521350X?tag=dsebastien00-20"
    }
  ],
  "references": [
    {
      "title": "Finite and Infinite Games - Wikipedia",
      "url": "https://en.wikipedia.org/wiki/Finite_and_Infinite_Games",
      "type": "website"
    }
  ],
  "tutorials": [],
  "datePublished": "2026-01-16",
  "dateModified": "2026-01-16"
}
