{
    "id": "information-gap-theory",
    "name": "Information Gap Theory",
    "summary": "A psychological theory proposing that curiosity arises when we perceive a gap between what we know and what we want to know.",
    "explanation": "Information gap theory, developed by behavioral economist George Loewenstein in 1994, explains curiosity as a response to a perceived gap between current knowledge and desired knowledge. When we become aware that we don't know something - and that knowledge seems attainable - we experience an aversive feeling that motivates information-seeking behavior.\n\nKey principles of the theory: (1) Curiosity requires some prior knowledge - complete ignorance doesn't trigger curiosity because we don't know what we're missing. (2) The gap must seem closeable - we're curious about things we believe we can learn. (3) Curiosity intensifies as we get closer to the answer - partial information increases the drive to complete our understanding. (4) The feeling of curiosity is mildly unpleasant, creating motivation to resolve the gap.\n\nThis explains several phenomena: why cliffhangers work (they create salient gaps), why experts are often more curious than novices (they know enough to see the gaps), why trivial questions can become obsessions (the gap feels closeable), and why spoilers reduce engagement (they close the gap prematurely).\n\nApplications include: education (activate prior knowledge before introducing new concepts), content creation (create and manage information gaps strategically), product design (progressive disclosure maintains engagement), and personal learning (cultivate awareness of knowledge gaps to fuel curiosity).\n\nCriticisms include: the theory doesn't fully explain intrinsic interest in topics without obvious gaps, and it may oversimplify the diverse types of curiosity people experience.",
    "tags": [
        "psychology",
        "curiosity",
        "motivation",
        "learning",
        "behavioral-economics"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaSearch",
    "featured": false,
    "aliases": [
        "Loewenstein's curiosity theory",
        "Knowledge gap theory"
    ],
    "relatedConcepts": [
        "curiosity",
        "curiosity-gap",
        "epistemic-curiosity",
        "diversive-curiosity",
        "intrinsic-motivation",
        "progressive-disclosure"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "The Psychology of Curiosity: A Review and Reinterpretation (Loewenstein, 1994)",
            "url": "https://www.cmu.edu/dietrich/sds/docs/loewenstein/PsychofCuriosity.pdf",
            "type": "paper"
        },
        {
            "title": "Information gap theory - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Information_gap_theory",
            "type": "website"
        },
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "DeveloPassion's Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-30",
    "dateModified": "2026-02-20"
}
