{
    "id": "information-literacy",
    "name": "Information Literacy",
    "summary": "The ability to recognize when information is needed and to effectively find, evaluate, and use it.",
    "explanation": "Information literacy is the set of competencies that enable a person to recognize when information is needed and then to effectively locate, critically evaluate, and appropriately use that information. It goes beyond simply knowing how to search - it encompasses the full cycle of identifying a knowledge gap, formulating good questions, selecting appropriate sources, assessing credibility, synthesizing findings, and applying knowledge ethically.\n\nThe concept has become increasingly important in the age of misinformation and information overload. With vast amounts of content available at our fingertips, the ability to distinguish reliable sources from unreliable ones, to recognize bias and manipulation, and to evaluate evidence critically has become a survival skill for knowledge workers and citizens alike.\n\nThe Association of College and Research Libraries (ACRL) Framework for Information Literacy identifies several key threshold concepts, including the understanding that authority is constructed and contextual, that information creation is a process, that information has value, that research is inquiry-based, that scholarship is a conversation, and that searching is strategic exploration. These ideas emphasize that information literacy is not a checklist of skills but a way of thinking about knowledge and its sources.\n\nInformation literacy connects closely with media literacy - the ability to critically analyze media messages and understand how media shapes perceptions. Together, they form a foundation for navigating the modern information landscape, where news, opinion, advertising, propaganda, and research often blend together.\n\nPKM practices naturally develop information literacy skills. When you regularly evaluate sources before adding them to your knowledge base, annotate and critique what you read, connect ideas across multiple sources, and organize your understanding into your own words, you are practicing information literacy. Building a personal knowledge management system is, in many ways, an ongoing exercise in becoming a more skilled and discerning consumer and producer of information.",
    "tags": [
        "learning",
        "critical-thinking",
        "information-management",
        "education"
    ],
    "category": "Learning & Education",
    "icon": "FaSearch",
    "featured": false,
    "aliases": [
        "Info literacy",
        "Research literacy"
    ],
    "relatedConcepts": [
        "critical-thinking",
        "information-filtering",
        "information-overload",
        "data-literacy",
        "source-criticism",
        "media-literacy"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Information literacy - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Information_literacy",
            "type": "website"
        },
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Personal Knowledge Management Library",
            "url": "https://store.dsebastien.net/product/pkm-library",
            "type": "other"
        },
        {
            "title": "DeveloPassion's Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-22",
    "dateModified": "2026-02-22"
}
