{
    "id": "interference-theory",
    "name": "Interference Theory",
    "summary": "The theory that forgetting occurs because other memories compete with or disrupt the retrieval of target information.",
    "explanation": "Interference theory proposes that forgetting is not simply decay over time but results from competition between memories. When we try to retrieve information, other similar memories can interfere, making the target harder to access. This explains why we often remember distinctive experiences better than routine ones, and why learning similar material in succession can be problematic.\n\n**Two main types of interference**:\n\n**Proactive interference** occurs when older memories interfere with newer ones. Learning Spanish may interfere with later learning French, as Spanish vocabulary intrudes when trying to recall French words. The more thoroughly learned the earlier material, the more it can interfere with new learning. This is why unlearning old habits can be difficult - the old pattern keeps intruding.\n\n**Retroactive interference** occurs when newer memories interfere with older ones. Learning French may impair your ability to recall Spanish you learned earlier. New information can overwrite or obscure previously stored information, particularly if the material is similar.\n\n**Factors affecting interference**:\n- **Similarity**: More similar material produces more interference. Learning two similar programming languages creates more interference than learning a language and a musical instrument.\n- **Degree of learning**: Better-learned material is more resistant to interference but also produces more interference for competing memories.\n- **Time intervals**: Longer delays between learning sessions can reduce interference by allowing consolidation.\n- **Retrieval cues**: Distinctive cues help discriminate between competing memories, reducing interference.\n\n**Theoretical mechanisms**:\n- **Response competition**: Multiple responses become associated with the same cue, creating conflict at retrieval\n- **Unlearning**: New learning may cause the unlearning of older associations\n- **Cue overload**: When cues become associated with too many items, their effectiveness decreases\n- **Inhibition**: Active suppression of competing memories during retrieval\n\n**Implications for learning and knowledge management**:\n\n- **Space similar content**: Don't study similar subjects back-to-back; interleave with different material\n- **Create distinctive encoding**: Make information unique and memorable to reduce confusion with similar content\n- **Use specific cues**: Develop specific retrieval cues rather than generic ones that link to multiple items\n- **Strengthen target memories**: More retrieval practice makes memories more resistant to interference\n- **Organize knowledge**: Clear categorization and structure helps keep similar information distinct\n- **Allow consolidation time**: Sleeping between learning sessions reduces interference effects",
    "tags": [
        "memory",
        "forgetting",
        "learning",
        "psychology",
        "cognitive-science"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaBrain",
    "featured": false,
    "aliases": [
        "Proactive interference",
        "Retroactive interference",
        "Memory interference"
    ],
    "relatedConcepts": [
        "memory",
        "forgetting-curve",
        "retrieval-induced-forgetting",
        "spacing-effect",
        "interleaving"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Interference theory - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Interference_theory",
            "type": "website"
        },
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "DeveloPassion's Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-04",
    "dateModified": "2026-02-04"
}
