{
    "id": "intentional-attention",
    "name": "Intentional Attention",
    "summary": "The deliberate practice of choosing where to direct your attention rather than passively reacting to environmental stimuli.",
    "explanation": "Intentional attention is the practice of deliberately and consciously choosing where to direct your focus, rather than allowing external stimuli, notifications, or habits to dictate what occupies your mind. It represents a shift from reactive attention management, where the environment controls your focus, to proactive attention management, where you decide in advance what deserves your cognitive resources.\n\nAt the core of intentional attention is the recognition that what you attend to shapes your experience of reality. William James famously noted that our experience is determined by what we choose to attend to. By deliberately directing attention toward what matters most, you can improve the quality of your work, relationships, and overall well-being.\n\nIntention-setting is a key component of this practice. Before beginning a work session, a meeting, or even a conversation, taking a moment to clarify your intention helps anchor attention on what is most important. This simple act of pausing to set an intention creates a reference point that makes it easier to notice when attention has drifted and to redirect it back.\n\nAttention can be trained and strengthened through practices like meditation, which builds the capacity to notice where attention has gone and gently bring it back to the chosen focus. Mindfulness meditation, in particular, is essentially a repeated exercise in intentional attention. Over time, this practice increases the ability to sustain focus and resist distraction.\n\nEnvironment design also plays a critical role in supporting intentional attention. By structuring your physical and digital environments to minimize unwanted stimuli and cues, you reduce the cognitive effort needed to maintain focus. This includes strategies like removing phone notifications, using website blockers during deep work, and creating dedicated workspaces that signal focus to the brain.",
    "tags": [
        "attention",
        "mindfulness",
        "focus",
        "self-management"
    ],
    "category": "Attention & Focus",
    "icon": "FaCrosshairs",
    "featured": false,
    "aliases": [
        "Deliberate attention",
        "Attention management"
    ],
    "relatedConcepts": [
        "mindfulness",
        "attention-management",
        "deep-work",
        "focus-rituals",
        "digital-minimalism"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Journaling Deep Dive Workshop",
            "url": "https://store.dsebastien.net/product/journaling-deep-dive",
            "type": "other"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/product/clarity-101",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-22",
    "dateModified": "2026-02-22"
}
