{
  "id": "inverted-pyramid",
  "name": "Inverted Pyramid",
  "summary": "A writing structure that puts the most important information first, followed by supporting details in decreasing order of importance.",
  "explanation": "The inverted pyramid is a journalistic writing structure where information is presented in descending order of importance. The most newsworthy and essential information comes first (the wide base of the inverted pyramid), followed by important details, then general background information. This contrasts with traditional narrative structures that build toward a climax.\n\nOrigins and rationale: developed in the 19th century for telegraph transmission (messages could be cut off at any point), then adopted by newspapers where editors needed to cut stories from the bottom to fit available space. The structure ensures that even if readers stop early, they've received the most critical information.\n\nThe structure typically follows: lead (the essential who, what, when, where, why, how), body (important supporting details and quotes), and tail (background information and less critical details). Each paragraph should be less essential than the one before it.\n\nBenefits of inverted pyramid: respects reader time (they can stop when they have enough), works for scanning and skimming, front-loads value, accommodates variable reading depths, and makes editing easier (cut from the bottom). It's particularly suited to news, reports, documentation, and any writing where readers need information quickly.\n\nLimitations: can feel anticlimactic for narrative content, doesn't build suspense, and may not engage readers emotionally. Not ideal for storytelling, persuasive essays, or content meant to be read completely. The inverted pyramid serves information delivery, not engagement.\n\nFor knowledge workers: use inverted pyramid for status updates, documentation, emails requiring action, and any writing where readers need facts efficiently. Consider other structures for content meant to persuade, entertain, or tell stories.",
  "tags": [
    "writing",
    "communications",
    "structure",
    "journalism"
  ],
  "category": "Writing & Content Creation",
  "icon": "FaSortAmountDown",
  "featured": false,
  "aliases": [
    "Inverted Pyramid Style",
    "News Writing Structure",
    "Front-Loading"
  ],
  "relatedConcepts": [
    "hook-context-main-points",
    "pyramid-of-communication",
    "scqa-model"
  ],
  "relatedNotes": [],
  "articles": [],
  "references": [
    {
      "title": "Inverted pyramid (journalism) - Wikipedia",
      "url": "https://en.wikipedia.org/wiki/Inverted_pyramid_(journalism)",
      "type": "website"
    },
    {
      "title": "Obsidian Starter Kit",
      "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
      "type": "other"
    },
    {
      "title": "AI Ghostwriter Guide",
      "url": "https://store.dsebastien.net/product/ai-ghostwriter-guide",
      "type": "other"
    },
    {
      "title": "Personal Organization 101 Workshop",
      "url": "https://store.dsebastien.net/product/personal-organization-101",
      "type": "other"
    },
    {
      "title": "Obsidian Starter Course",
      "url": "https://store.dsebastien.net/product/obsidian-starter-course",
      "type": "other"
    },
    {
      "title": "Knowledge Management for Beginners",
      "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
      "type": "other"
    },
    {
      "title": "Knowii Community",
      "url": "https://store.dsebastien.net/product/knowii-community",
      "type": "other"
    },
    {
      "title": "Knowledge Worker Kit",
      "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
      "type": "other"
    }
  ],
  "books": [],
  "tutorials": [],
  "datePublished": "2026-01-20",
  "dateModified": "2026-01-29"
}
