{
    "id": "jack-of-all-trades",
    "name": "Jack of All Trades, Master of None",
    "summary": "A saying suggesting that generalists who know many skills superficially may lack the deep expertise needed for mastery in any single domain.",
    "explanation": "\"Jack of all trades, master of none\" is a figure of speech that describes someone with a wide range of abilities but without deep expertise in any particular area. The phrase originated in the early 17th century, initially as a compliment—a \"Jack of all trades\" was a versatile handyman who could tackle diverse tasks. The \"master of none\" addition came later, shifting the meaning toward criticism of superficiality.\n\nThe full original saying may have been \"Jack of all trades, master of none, but oftentimes better than a master of one,\" which presents a more nuanced view. This longer version suggests that versatility can sometimes outweigh specialization, particularly in contexts requiring adaptability or cross-domain problem-solving.\n\n**The Generalist vs. Specialist Debate**:\n\nThis phrase encapsulates a fundamental tension in skill development:\n\n- **Specialization advantages**: Deep expertise, mastery, authority in a field, clear career path, higher pay in specialized roles\n- **Generalist advantages**: Adaptability, cross-pollination of ideas, ability to see connections others miss, resilience to industry changes, broader perspective\n\n**Modern Interpretations**:\n\nIn today's rapidly changing world, the phrase is often reconsidered:\n\n1. **T-shaped skills**: Combining broad knowledge (the horizontal bar) with deep expertise in one or two areas (the vertical bar) offers the benefits of both approaches\n2. **Polymath advantage**: Renaissance thinkers like Leonardo da Vinci showed that diverse knowledge can lead to breakthrough insights\n3. **Startup context**: Early-stage companies often need generalists who can wear many hats, while mature organizations benefit from specialists\n4. **Knowledge work**: Connecting ideas across domains often generates more value than deep but isolated expertise\n\n**Practical Wisdom**:\n\nThe key insight is that both generalism and specialism have their place. The question isn't which is better, but which approach serves your goals, context, and stage of career. Many successful people develop deep expertise in one area while maintaining broad competence across related domains—becoming \"expert generalists\" or \"generalizing specialists.\"\n\nFor knowledge management, this concept suggests the value of both depth (mastering your core domain) and breadth (exploring adjacent areas to find unexpected connections).",
    "tags": [
        "skills",
        "expertise",
        "learning",
        "career-development",
        "specialization"
    ],
    "category": "Learning & Education",
    "icon": "FaPuzzlePiece",
    "featured": false,
    "aliases": [
        "Generalist vs Specialist",
        "Jack of all trades",
        "Renaissance man"
    ],
    "relatedConcepts": [
        "t-shaped-skills",
        "polymath",
        "expertise",
        "domain-expertise",
        "deliberate-practice",
        "core-competencies"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Range: Why Generalists Triumph in a Specialized World by David Epstein",
            "url": "https://www.amazon.com/dp/0735214484?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Jack of all trades, master of none - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Jack_of_all_trades,_master_of_none",
            "type": "website"
        },
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "DeveloPassion's Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-04",
    "dateModified": "2026-02-04"
}
