{
    "id": "kill-your-darlings",
    "name": "Kill Your Darlings",
    "summary": "The writing principle of cutting beloved content that does not serve the overall work.",
    "explanation": "Kill your darlings is a writing principle advising authors to cut passages, phrases, or ideas they are personally attached to when those elements do not serve the overall work. The phrase is often attributed to William Faulkner ('In writing, you must kill all your darlings'), though similar advice has been given by Arthur Quiller-Couch, Stephen King, and many other writers throughout literary history.\n\nThe 'darlings' are typically: a beautifully crafted sentence that does not advance the narrative, a clever metaphor that distracts from the point, a character or subplot you love but that weakens the story, a piece of research you spent hours on but that clutters the argument, or a joke that makes you laugh but confuses the reader. What makes them dangerous is precisely that they are good in isolation but harmful in context.\n\nThe principle addresses a universal creative weakness: attachment to our own output. We naturally resist cutting something we worked hard on or feel proud of, even when it does not belong. This attachment creates bloat, weakens focus, and prioritizes the writer's ego over the reader's experience. The willingness to cut is what separates competent writing from good writing.\n\nThe principle extends well beyond fiction writing. In business communication, it means cutting impressive but unnecessary jargon. In presentations, it means removing slides that are interesting but tangential. In product development, it means cutting features you love but users do not need. In personal knowledge management, it means pruning notes and ideas that no longer serve your thinking rather than hoarding everything.\n\nPractical approaches include: writing first drafts freely without editing (separate creation from judgment), reviewing with the question 'does this serve the reader and the purpose?', keeping a 'darlings file' where you save cut material (reducing the psychological pain of deletion), and getting feedback from others who are not attached to your darlings. The hardest part is not recognizing what to cut but having the courage to do it.",
    "tags": [
        "writing",
        "editing",
        "craft",
        "principles",
        "creativity"
    ],
    "category": "Writing & Content Creation",
    "icon": "FaCut",
    "featured": false,
    "aliases": [
        "Murder your darlings",
        "Editing ruthlessly",
        "Cutting the precious"
    ],
    "relatedConcepts": [
        "show-dont-tell",
        "conciseness",
        "less-is-more",
        "editing",
        "active-voice",
        "writing-is-thinking",
        "revision"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Kill your darlings - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Kill_your_darlings",
            "type": "website"
        },
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "AI Ghostwriter Guide",
            "url": "https://store.dsebastien.net/product/ai-ghostwriter-guide",
            "type": "other"
        }
    ],
    "books": [],
    "tutorials": [],
    "datePublished": "2026-02-13",
    "dateModified": "2026-02-13"
}
