{
    "id": "knowledge-commons",
    "name": "Knowledge Commons",
    "summary": "Shared knowledge resources that are collectively maintained and freely accessible to a community.",
    "explanation": "Knowledge Commons refers to shared pools of knowledge that are collectively created, maintained, and governed by a community. The concept draws heavily from Elinor Ostrom's pioneering work on the governance of common-pool resources, extending her framework from natural resources to intellectual and informational ones.\n\nProminent examples of knowledge commons include Wikipedia, open-source software documentation, community wikis, and shared knowledge bases like Stack Overflow. These resources thrive because contributors voluntarily add, curate, and improve content for the collective benefit.\n\nHowever, knowledge commons face their own version of the tragedy of the commons. Free-riding occurs when individuals consume shared knowledge without contributing back. Quality degradation can happen when governance is weak or when contributors lack the incentive to maintain high standards. Vandalism, misinformation, and neglect can erode the value of a knowledge commons over time.\n\nEffective governance models are essential for sustaining knowledge commons. These include clear contribution guidelines, peer review processes, community moderation, and reputation systems that reward quality contributions. Wikipedia's editorial policies and open-source projects' contribution workflows are well-known examples of such governance.\n\nThere is a meaningful relationship between personal knowledge management (PKM) and contributing to knowledge commons. Individuals who maintain robust personal knowledge systems are often better positioned to contribute meaningfully to shared resources. The flow from private notes to public knowledge creation strengthens both the individual's understanding and the collective resource.\n\nThe open access movement plays a crucial role in knowledge democratization, advocating for research, educational materials, and cultural works to be freely available. By lowering barriers to access, open access initiatives expand the knowledge commons and enable broader participation in knowledge creation and consumption.",
    "tags": [
        "knowledge-management",
        "collaboration",
        "community",
        "sharing"
    ],
    "category": "Concepts",
    "icon": "FaGlobeAmericas",
    "featured": false,
    "aliases": [
        "Shared knowledge",
        "Public knowledge base"
    ],
    "relatedConcepts": [
        "knowledge-sharing",
        "communities-of-practice",
        "wiki",
        "multiplayer-knowledge-bases",
        "open-source",
        "open-access"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowledge commons - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Knowledge_commons",
            "type": "website"
        },
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Personal Knowledge Management Library",
            "url": "https://store.dsebastien.net/product/pkm-library",
            "type": "other"
        },
        {
            "title": "Personal Knowledge Management Coaching",
            "url": "https://store.dsebastien.net/product/pkm-coaching",
            "type": "other"
        },
        {
            "title": "DeveloPassion's Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "books": [],
    "datePublished": "2026-02-22",
    "dateModified": "2026-02-22"
}
