{
    "id": "knowledge-audit",
    "name": "Knowledge Audit",
    "summary": "A systematic review and evaluation of knowledge assets to identify gaps, redundancies, and improvement opportunities.",
    "explanation": "A knowledge audit is a systematic assessment of the knowledge assets held by an organization or individual. It aims to create a clear picture of what knowledge exists, where it resides, how it flows, and where critical gaps or redundancies lie. Think of it as taking inventory of your intellectual resources and evaluating their health.\n\nThe knowledge audit process typically involves several stages. First, you **inventory existing knowledge** - cataloging what you know, what is documented, and where information lives. Second, you **identify gaps** - determining what knowledge is missing, outdated, or insufficient for your goals. Third, you **assess quality and relevance** - evaluating whether existing knowledge is accurate, current, and aligned with your needs. Fourth, you **evaluate accessibility** - checking whether knowledge can be easily found and used when needed.\n\nIn organizational Knowledge Management, knowledge audits help companies understand their intellectual capital, identify at-risk knowledge (such as expertise held by a single person about to retire), discover duplicated efforts, and prioritize investments in knowledge sharing and documentation.\n\nFor personal knowledge management, a knowledge audit translates into periodically reviewing your vault, notebook, or knowledge system. This means looking for outdated notes that need updating, orphan content that is not connected to anything, missing connections between related ideas, topics with insufficient coverage, and areas where your understanding has evolved but your notes have not kept pace. It also means examining your workflows - are you capturing knowledge effectively? Can you find things when you need them? Are your organizational structures still serving you?\n\nRegular knowledge audits are a form of system maintenance that keeps your knowledge base healthy and useful over time. Without periodic review, knowledge systems tend to accumulate clutter, develop blind spots, and gradually lose their value as a thinking and reference tool. Many practitioners schedule audits as part of their periodic review routines - weekly, monthly, or quarterly - depending on the scope and pace of their knowledge work.",
    "tags": [
        "knowledge-management",
        "reviews",
        "improvement",
        "organizations"
    ],
    "category": "Methods",
    "icon": "FaClipboardCheck",
    "featured": false,
    "aliases": [
        "Knowledge review",
        "Knowledge assessment",
        "PKM audit"
    ],
    "relatedConcepts": [
        "knowledge-management",
        "knowledge-debt",
        "periodic-reviews",
        "knowledge-organization",
        "refactoring-notes"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Personal Knowledge Management Library",
            "url": "https://store.dsebastien.net/product/pkm-library",
            "type": "other"
        },
        {
            "title": "Personal Knowledge Management Coaching",
            "url": "https://store.dsebastien.net/product/pkm-coaching",
            "type": "other"
        },
        {
            "title": "DeveloPassion's Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        },
        {
            "title": "Personal Organization 101 Workshop",
            "url": "https://store.dsebastien.net/product/personal-organization-101",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-22",
    "dateModified": "2026-02-22"
}
