{
    "id": "languishing",
    "name": "Languishing",
    "summary": "A state of mental stagnation and emptiness characterized by a sense of joylessness and aimlessness without meeting the criteria for clinical depression.",
    "explanation": "Languishing is a psychological state that lies between flourishing and depression on the mental health spectrum. Coined by sociologist Corey Keyes, it describes a sense of stagnation, emptiness, and joylessness that many people experience without being clinically depressed.\n\nPeople who are languishing aren't necessarily sad or hopeless, but they're not thriving either. They may feel hollow, unmotivated, or stuck. Life feels muted - nothing feels particularly bad, but nothing feels particularly good either. There's a persistent sense of 'blah' or 'meh' that pervades daily experience.\n\nLanguishing became particularly relevant during and after the COVID-19 pandemic when many people found themselves in this gray zone - not depressed but definitely not doing well. Psychologist Adam Grant's influential article in The New York Times brought widespread attention to this often-overlooked mental state.\n\nKey characteristics of languishing include:\n- Feeling empty or hollow rather than sad\n- Lack of motivation and interest\n- Difficulty concentrating or focusing\n- A sense that life lacks meaning or purpose\n- Going through the motions without engagement\n- Neither thriving nor seriously struggling\n\nThe antidote to languishing is often found through flow states - becoming fully absorbed in activities that challenge and engage us. Setting small achievable goals, reconnecting with things that used to bring joy, and giving yourself uninterrupted time for deep engagement can help shift from languishing toward flourishing.\n\nRecognizing languishing is important because it can be a risk factor for future mental health problems if left unaddressed. It's also valuable to have language for this experience - naming it helps normalize it and empowers people to take action.",
    "tags": [
        "well-being",
        "mental-health",
        "psychology",
        "positive-psychology",
        "emotions",
        "flourishing"
    ],
    "category": "Well-Being & Happiness",
    "icon": "FaCloud",
    "featured": false,
    "aliases": [
        "Mental Languishing",
        "Psychological Languishing"
    ],
    "relatedConcepts": [
        "eudaimonia",
        "flow-state",
        "burnout",
        "depression",
        "positive-psychology",
        "meaningful-pursuits",
        "positive-emotions"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Languishing - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Languishing",
            "type": "website"
        },
        {
            "title": "There's a Name for the Blah You're Feeling: It's Called Languishing - NY Times",
            "url": "https://www.nytimes.com/2021/04/19/well/mind/covid-mental-health-languishing.html",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-15",
    "dateModified": "2026-01-15"
}
