{
    "id": "learning-agility",
    "name": "Learning Agility",
    "summary": "Learning agility is the ability to rapidly learn from experience and effectively apply those lessons to new, unfamiliar, and challenging situations.",
    "explanation": "## What Is Learning Agility?\n\nLearning agility is not about what you already know — it's about how quickly you can learn what you don't know. It refers to the willingness and ability to learn from experience, and then apply those lessons to succeed in new and first-time situations. Unlike traditional intelligence or expertise, learning agility is a dynamic capability that enables individuals to thrive amid uncertainty and change.\n\n## Key Dimensions\n\nResearch identifies several core dimensions of learning agility:\n\n- **Mental agility**: Embracing complexity, examining problems from fresh angles, and making unexpected connections between ideas.\n- **People agility**: Understanding others, communicating effectively, and navigating diverse social situations with skill.\n- **Change agility**: Experimenting with new approaches, taking risks, and remaining calm and effective under pressure.\n- **Results agility**: Delivering outcomes in first-time or ambiguous situations by drawing on transferable skills and resourcefulness.\n- **Self-awareness**: Knowing your own strengths, limitations, and blind spots, and actively seeking feedback to improve.\n\n## Why It Matters\n\nLearning-agile individuals are comfortable with ambiguity, actively seek feedback, reflect deeply on their experiences, and transfer insights across different contexts. They treat every situation — whether a success or failure — as an opportunity to learn.\n\nOrganizations increasingly value learning agility over specific technical skills because in fast-changing environments, what you *can* learn matters more than what you *already* know. Research consistently shows that learning agility is one of the strongest predictors of leadership potential and long-term career success.\n\n## How to Develop Learning Agility\n\nBuilding learning agility involves cultivating curiosity, embracing discomfort, volunteering for stretch assignments, and reflecting systematically on what worked and what didn't. It also means being open to feedback, willing to unlearn outdated approaches, and committed to continuous growth.",
    "tags": [
        "learning",
        "adaptability",
        "personal-growth",
        "skills",
        "leadership"
    ],
    "category": "Learning & Education",
    "icon": "FaBolt",
    "featured": false,
    "aliases": [
        "Learn-to-Learn",
        "Adaptive Learning",
        "Learning Ability"
    ],
    "relatedConcepts": [
        "growth-mindset",
        "cognitive-flexibility",
        "resilience",
        "autodidacticism",
        "self-directed-learning",
        "double-loop-learning",
        "metacognition"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Learning Agility: Unlock the Lessons of Experience by David F. Hoff, W. Warner Burke, and George P. Hollenbeck",
            "url": "https://www.amazon.com/dp/0979-0071?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Learning agility - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Learning_agility",
            "type": "website"
        },
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "DeveloPassion's Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        },
        {
            "title": "Journaling Deep Dive Workshop",
            "url": "https://store.dsebastien.net/product/journaling-deep-dive",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-11",
    "dateModified": "2026-02-11"
}
