{
    "id": "learn-drive",
    "name": "Learn Drive",
    "summary": "An innate neurological mechanism that generates the desire to acquire new knowledge, driven by curiosity and rewarded by the pleasure of learning.",
    "explanation": "The learn drive is a concept developed by Piotr Wozniak, the creator of SuperMemo and a pioneer of spaced repetition. It describes an innate brain mechanism that drives humans to seek out and absorb new knowledge. The learn drive operates through a reward system: when we encounter information that is novel, comprehensible, and relevant, the brain releases dopamine, creating a pleasurable sensation that reinforces the desire to continue learning.\n\nThe learn drive functions optimally when learning is self-directed. When an individual follows their own curiosity—choosing what to learn, when, and how—the learn drive produces maximum engagement and retention. In contrast, coercive learning environments such as rigid school curricula can suppress the learn drive by forcing learners to process information that their brain's knowledge valuation network deems irrelevant or poorly timed.\n\nWozniak identifies several factors that strengthen or weaken the learn drive. Sleep, exercise, and emotional well-being enhance it. Stress, coercion, and information overload suppress it. The learn drive is closely linked to the concept of desirable difficulties: material that is slightly beyond current understanding but still comprehensible produces the strongest reward signal.\n\nThe learn drive has important implications for education and knowledge management. It suggests that the most effective learning happens when individuals are free to follow their curiosity, use tools like incremental reading and spaced repetition to manage knowledge flow, and maintain the physiological conditions that support neurological reward. Understanding the learn drive helps explain why self-directed learners often outperform those in structured environments, and why intrinsic motivation is more powerful than external incentives for deep learning.",
    "tags": [
        "learning",
        "neuroscience",
        "motivation",
        "curiosity",
        "self-directed-learning",
        "spaced-repetition"
    ],
    "category": "Learning & Education",
    "icon": "FaBrain",
    "featured": false,
    "aliases": [
        "Learning Drive"
    ],
    "relatedConcepts": [
        "intrinsic-motivation",
        "curiosity",
        "spaced-repetition",
        "self-directed-learning",
        "desirable-difficulties",
        "dopamine",
        "forgetting-curve",
        "flow-state",
        "lifelong-learning",
        "pleasure-of-learning",
        "incremental-reading",
        "toxic-memory",
        "knowledge-valuation-network",
        "autonomy"
    ],
    "relatedNotes": [],
    "references": [
        {
            "title": "Piotr Wozniak - I would never send my kids to school",
            "url": "https://supermemo.guru/wiki/I_would_never_send_my_kids_to_school",
            "type": "website"
        },
        {
            "title": "Learn drive - SuperMemo Guru",
            "url": "https://supermemo.guru/wiki/Learn_drive",
            "type": "website"
        },
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "DeveloPassion's Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "articles": [],
    "books": [],
    "tutorials": [],
    "datePublished": "2026-02-20",
    "dateModified": "2026-02-20"
}
