{
    "id": "learning-in-public",
    "name": "Learning in Public",
    "summary": "The practice of openly sharing your learning process, notes, and progress to accelerate growth and help others.",
    "explanation": "Learning in Public is the practice of documenting and sharing what you learn as you learn it, rather than waiting until you have achieved mastery or produced polished outputs. The concept was popularized by Shawn Wang (Swyx) in his influential essay, which argued that the fastest way to learn is to create a public exhaust of your learning process.\n\nThe benefits of learning in public are numerous. Accountability comes naturally when others can see your progress. Feedback from more experienced practitioners accelerates learning and corrects misconceptions early. Serendipitous connections emerge when people with shared interests discover your work. Over time, consistent public learning builds a reputation and a body of work that serves as a portfolio of competence and curiosity. Perhaps most importantly, sharing what you learn helps others who are a few steps behind you on the same path.\n\nLearning in public takes many forms across various platforms. Blog posts and articles capture structured reflections. Twitter/X threads and social media posts share quick insights and questions. YouTube videos and podcasts document longer explorations. Digital gardens serve as evolving, interconnected knowledge bases. GitHub repositories showcase code-based learning. Each format has its strengths, and many practitioners use several simultaneously.\n\nA key distinction separates learning in public from traditional publishing. Traditional publishing emphasizes polished, authoritative outputs. Learning in public embraces works-in-progress, rough drafts, and honest accounts of confusion and mistakes. This vulnerability is a feature, not a bug: it makes the content more relatable and the learning process more visible.\n\nOvercoming the fear of being wrong in public is the biggest hurdle for most people. The antidote is recognizing that everyone starts as a beginner, that being corrected publicly is one of the fastest ways to learn, and that the community generally rewards effort and honesty over perfection.",
    "tags": [
        "techniques",
        "learning",
        "sharing",
        "personal-growth"
    ],
    "category": "Techniques",
    "icon": "FaBullhorn",
    "featured": false,
    "aliases": [
        "Learn in public",
        "Open learning",
        "Working out loud"
    ],
    "relatedConcepts": [
        "learn-in-public",
        "digital-garden",
        "blogging",
        "knowledge-sharing",
        "growth-mindset"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "DeveloPassion's Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        },
        {
            "title": "Journaling Deep Dive Workshop",
            "url": "https://store.dsebastien.net/product/journaling-deep-dive",
            "type": "other"
        }
    ],
    "tutorials": [],
    "books": [],
    "datePublished": "2026-02-22",
    "dateModified": "2026-02-22"
}
