{
    "id": "levels-of-processing",
    "name": "Levels of Processing",
    "summary": "Memory theory stating that deeper, more meaningful processing of information leads to stronger and more durable memory traces.",
    "explanation": "The levels of processing framework, proposed by Fergus Craik and Robert Lockhart in 1972, revolutionized our understanding of memory by shifting focus from structural models (short-term vs. long-term memory) to the nature of cognitive processing during encoding. The central insight is that memory is not determined by where information is stored, but by how deeply it is processed.\n\nProcessing depth exists on a continuum:\n\n- **Shallow (structural) processing**: Focus on physical features - what does a word look like? How many letters? This produces weak, quickly-forgotten memory traces.\n\n- **Intermediate (phonemic) processing**: Focus on sound properties - does this word rhyme with another? What does it sound like? This produces somewhat better retention.\n\n- **Deep (semantic) processing**: Focus on meaning - what does this concept mean? How does it relate to other knowledge? Does it fit this sentence? This produces strong, durable memories.\n\nDeeper processing enhances memory through elaboration (connecting new information to existing knowledge), distinctiveness (making information stand out), and effort (more effortful processing generally improves encoding). The self-reference effect demonstrates that relating information to oneself produces particularly strong encoding, as it connects to our richest knowledge networks.\n\nImplications for learning and knowledge management:\n\n- **Active engagement over passive reading**: Simply highlighting or re-reading text involves shallow processing. Generating questions, explaining concepts, and making connections involves deep processing.\n\n- **Elaborative interrogation**: Asking \"why\" and \"how\" questions forces semantic processing that creates durable memories.\n\n- **Relating to prior knowledge**: New information encoded in relation to existing knowledge benefits from deeper processing and better retrieval cues.\n\n- **Note-taking strategies**: Writing summaries in your own words, creating concept maps, and building connections between notes all involve deep processing.\n\n- **The generation effect**: Producing information (generating answers, creating examples) typically involves deeper processing than passively receiving it.\n\nCriticisms of the theory include the difficulty of independently measuring processing depth (the circularity problem) and evidence that transfer-appropriate processing sometimes matters more than depth per se. However, the core insight that meaningful engagement with material produces better memory than superficial exposure remains foundational to evidence-based learning strategies.",
    "tags": [
        "memory",
        "learning",
        "psychology",
        "cognitive-science",
        "encoding"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaLayerGroup",
    "featured": false,
    "aliases": [
        "Depth of processing",
        "Craik and Lockhart model",
        "Processing depth"
    ],
    "relatedConcepts": [
        "elaboration",
        "generation-effect",
        "encoding-specificity",
        "memory",
        "active-recall"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Levels of processing - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Levels_of_processing_model",
            "type": "website"
        },
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "DeveloPassion's Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-04",
    "dateModified": "2026-02-04"
}
