{
    "id": "lifelogging",
    "name": "Lifelogging",
    "summary": "The comprehensive documentation of daily life through continuous capture of experiences, activities, and data.",
    "explanation": "Lifelogging is the practice of capturing extensive records of one's daily life, often using technology for continuous or near-continuous documentation. Unlike selective journaling or targeted tracking, lifelogging aims for comprehensive capture—creating a detailed, searchable archive of your existence. Methods include: wearable cameras that automatically photograph throughout the day (like the discontinued Narrative Clip), continuous audio recording, GPS location logging, automatic time tracking of digital activities, physiological monitoring, and comprehensive journaling. Pioneer Gordon Bell's MyLifeBits project attempted to digitize and store everything—emails, documents, photos, videos, web pages visited, and more. Benefits include: extended memory (searchable personal archive), pattern discovery across long timeframes, life review and reflection, legacy creation, and research data for self-understanding. The practice intersects with the Quantified Self movement but emphasizes breadth of capture over specific metrics. Challenges include: massive data storage requirements, privacy concerns (for yourself and others around you), the burden of review and organization, social awkwardness of continuous recording, and the question of what to do with all this data. Modern lifelogging often focuses on specific domains: automatic photo organization, digital activity logs, or location history. For knowledge workers, partial lifelogging can support memory augmentation, project documentation, and understanding long-term work patterns.",
    "tags": [
        "self-documentation",
        "technologies",
        "memory",
        "data",
        "personal-archives",
        "digital-life"
    ],
    "category": "Methods",
    "icon": "FaVideo",
    "featured": false,
    "aliases": [
        "Life logging",
        "Digital life logging",
        "Personal archiving",
        "Total capture"
    ],
    "relatedConcepts": [
        "quantified-self",
        "life-tracking",
        "benefits-of-journaling",
        "daily-notes",
        "second-brain"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Lifelog - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Lifelog",
            "type": "website"
        },
        {
            "title": "MyLifeBits - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/MyLifeBits",
            "type": "website"
        }
    ],
    "books": [],
    "tutorials": [],
    "datePublished": "2026-01-25",
    "dateModified": "2026-01-25"
}
