{
    "id": "looking-glass-self",
    "name": "Looking-Glass Self",
    "summary": "The sociological concept that individuals form their self-concept and identity largely based on how they believe others perceive them, as if seeing themselves reflected in a social mirror.",
    "explanation": "The looking-glass self, introduced by sociologist Charles Horton Cooley in 1902, proposes that a person's sense of self is primarily formed through their perception of how others see them. In essence, other people serve as mirrors in which we see ourselves reflected.\n\nThe concept involves three components:\n\n1. **Imagination of appearance**: We imagine how we appear to another person\n2. **Imagination of judgment**: We imagine what judgment that person makes about our appearance\n3. **Self-feeling**: We develop a feeling about ourselves (pride, shame, confidence, insecurity) based on that imagined judgment\n\nImportantly, the looking-glass self is based on **perceived** judgments, not actual ones. We respond not to what others truly think of us (which we can never fully know), but to what we imagine they think. This means our self-concept can be built on entirely inaccurate assumptions about others' opinions.\n\nThe looking-glass self has several practical implications:\n\n- **Social validation of beliefs**: When you share an idea with friends and they affirm it, the idea feels more real and solid — not because of logic, but because of social mirroring.\n- **Identity construction**: We 'know' ourselves partly through how others reflect us back. This is why telling others about a decision makes it feel more committed.\n- **Vulnerability to manipulation**: Because self-concept is socially constructed, it can be shaped by the social mirrors we choose to surround ourselves with.\n\nUnderstanding this concept helps explain why peer groups so strongly influence identity, and why deliberately choosing your social environment is a form of self-design.",
    "tags": [
        "sociology",
        "identity",
        "self-awareness",
        "psychology",
        "social-psychology"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaBrain",
    "featured": false,
    "aliases": [
        "Social Mirror"
    ],
    "relatedConcepts": [
        "social-proof",
        "empathy"
    ],
    "relatedNotes": [],
    "references": [
        {
            "title": "Looking-glass self - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Looking-glass_self",
            "type": "website"
        },
        {
            "title": "Useful Not True by Derek Sivers",
            "url": "https://sive.rs/u",
            "type": "website"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Journaling Deep Dive Workshop",
            "url": "https://store.dsebastien.net/product/journaling-deep-dive",
            "type": "other"
        }
    ],
    "articles": [],
    "books": [],
    "tutorials": [],
    "datePublished": "2026-02-11",
    "dateModified": "2026-02-11"
}
