{
    "id": "make-or-buy-decision",
    "name": "Make or Buy Decision",
    "summary": "Strategic choice between producing goods or services internally versus purchasing them from external suppliers.",
    "explanation": "The make or buy decision is a strategic choice companies face when determining whether to produce a component, product, or service internally or purchase it from external suppliers. Factors favoring 'make' include: protecting proprietary knowledge, maintaining quality control, utilizing excess capacity, and strategic importance of the activity. Factors favoring 'buy' include: lower costs from specialized suppliers, lack of internal expertise, desire to focus on core competencies, and need for flexibility. Transaction cost economics suggests buying when market transactions are efficient and making when internal coordination is more efficient. The decision framework considers: total cost of ownership (not just unit price), strategic implications, risks of dependency, and opportunity costs. Many companies use a hybrid approach - making strategically important components while buying commoditized ones. For knowledge workers, this concept applies to decisions about which skills to develop deeply versus when to delegate or collaborate.",
    "tags": [
        "decisions",
        "strategies",
        "businesses",
        "operations"
    ],
    "category": "Business & Economics",
    "icon": "FaBalanceScale",
    "featured": false,
    "aliases": [
        "Make vs Buy",
        "Build or Buy",
        "Insource vs Outsource"
    ],
    "relatedConcepts": [
        "outsourcing",
        "core-competencies",
        "value-chain",
        "transaction-costs"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Make-or-buy decision - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Make-or-buy_decision",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-03",
    "dateModified": "2026-02-03"
}
