{
    "id": "maker-schedule",
    "name": "Maker Schedule",
    "summary": "Paul Graham's concept that creative and technical workers need long, uninterrupted blocks of time to do their best work.",
    "explanation": "The Maker Schedule is a concept introduced by Paul Graham in his 2009 essay that distinguishes between two fundamentally different ways of organizing a workday: the maker's schedule and the manager's schedule.\n\n## Maker's Schedule vs Manager's Schedule\n\nManagers typically operate on an hour-by-hour schedule, where the day is divided into one-hour blocks. Meetings are the norm, and switching between topics every hour is expected. For managers, a meeting is just a practical necessity that fits naturally into their day.\n\nMakers — programmers, writers, designers, and other creative workers — operate on a fundamentally different schedule. They need long, uninterrupted blocks of time (at least half a day) to produce meaningful work. Creative and technical work requires loading complex context into working memory, achieving a state of flow, and sustaining deep concentration.\n\n## Why a Single Meeting Can Destroy Productivity\n\nFor someone on a maker's schedule, a single meeting in the middle of the afternoon does not just cost the duration of the meeting. It effectively breaks the day into two pieces, neither of which may be large enough for serious work. The maker knows the meeting is coming, which makes it difficult to start something ambitious beforehand. After the meeting, it takes significant time to reload context and regain focus. A day with a meeting in the middle can feel like a day with no productive time at all.\n\n## Practical Strategies for Protecting Maker Time\n\n- **Batch meetings**: Group all meetings on specific days or specific times (e.g., mornings only), leaving other blocks entirely free for deep work.\n- **Office hours**: Adopt a policy where you are available for meetings only during designated hours, similar to a professor's office hours.\n- **Block the calendar**: Proactively schedule \"maker time\" blocks on your calendar so that others cannot book meetings during those periods.\n- **Communicate the schedule**: Make sure managers and colleagues understand the maker's schedule concept and why uninterrupted time matters.\n- **Start early or work late**: Some makers protect their creative time by working outside normal business hours when interruptions are unlikely.\n- **Set expectations**: Delay responses to non-urgent messages during maker blocks to prevent interruptions from accumulating.\n\n## Organizational Implications\n\nOrganizations that respect the maker's schedule tend to get better creative output. Companies can support this by establishing meeting-free days, encouraging asynchronous communication, and creating a culture that respects deep work time. The tension between maker and manager schedules is one of the most common sources of friction in knowledge-work organizations.",
    "tags": [
        "productivity",
        "focus",
        "scheduling",
        "creative-work"
    ],
    "category": "Productivity",
    "icon": "FaCode",
    "featured": false,
    "aliases": [
        "Maker's schedule",
        "Maker vs manager schedule"
    ],
    "relatedConcepts": [
        "deep-work",
        "time-blocking",
        "context-switching",
        "flow-state",
        "pomodoro-technique",
        "task-switching-cost"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Maker's Schedule, Manager's Schedule - Paul Graham",
            "url": "http://www.paulgraham.com/makersschedule.html",
            "type": "website"
        },
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Personal Knowledge Management Coaching",
            "url": "https://store.dsebastien.net/product/pkm-coaching",
            "type": "other"
        },
        {
            "title": "DeveloPassion's Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/product/clarity-101",
            "type": "other"
        },
        {
            "title": "Personal Organization 101 Workshop",
            "url": "https://store.dsebastien.net/product/personal-organization-101",
            "type": "other"
        },
        {
            "title": "AI Master Prompt Workshop",
            "url": "https://store.dsebastien.net/product/ai-master-prompt",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-21",
    "dateModified": "2026-02-21"
}
