{
    "id": "make-time",
    "name": "Make Time",
    "summary": "A productivity framework by Jake Knapp and John Zeratsky that uses four daily steps - Highlight, Laser, Energize, and Reflect - to help you focus on what matters most.",
    "explanation": "Make Time is a productivity framework developed by Jake Knapp (creator of Design Sprint) and John Zeratsky, both former Google and YouTube designers. Rather than proposing a complete lifestyle overhaul, it offers a flexible system of tactics you can customize to fit your life. The framework acknowledges that modern life pulls us in two directions: the 'Busy Bandwagon' (endless tasks and meetings) and the 'Infinity Pools' (infinitely scrolling apps and content). Make Time provides a counter-strategy.\n\nThe framework consists of four daily steps:\n\n**1. Highlight**: Each day, choose ONE priority - your Highlight. This is the single activity that, if accomplished, will make you feel satisfied with your day. It could take 60-90 minutes and might be urgent, satisfying, or joyful. By picking just one focus, you escape the trap of endless to-do lists and give yourself a clear success criterion.\n\n**2. Laser**: Protect your Highlight by beating distractions. This step involves creating barriers against Infinity Pools like social media, email, and news. Tactics include removing apps from your phone, using website blockers, logging out of accounts, and designing your environment to reduce temptation. The goal is sustained, focused attention on your Highlight.\n\n**3. Energize**: Recharge your mental and physical batteries through ancient practices your brain and body crave. This includes exercise (even brief movement counts), real food (avoiding processed options), strategic caffeine use, quality sleep, and face-to-face social interaction. Energy is the fuel that makes focus possible.\n\n**4. Reflect**: At the end of each day, spend a few minutes noting what worked and what did not. Did you complete your Highlight? What distracted you? How was your energy? This simple practice creates a feedback loop that helps you fine-tune your tactics over time.\n\nMake Time is deliberately imperfect and experimental. The authors encourage treating each tactic as a hypothesis to test rather than a rule to follow. The book provides 87 specific tactics organized across the four steps, allowing readers to pick and choose what works for their situation.",
    "tags": [
        "productivity",
        "time-management",
        "focus",
        "methods",
        "prioritization",
        "distraction-management",
        "energy-management"
    ],
    "category": "Methods",
    "icon": "FaLightbulb",
    "featured": false,
    "aliases": [
        "Make Time Method",
        "Make Time Framework",
        "Make Time System"
    ],
    "relatedConcepts": [
        "highlight-of-the-day",
        "deep-work",
        "time-blocking",
        "digital-minimalism",
        "energy-management",
        "decision-minimalism"
    ],
    "relatedNotes": [
        "https://notes.dsebastien.net/30+Areas/32+Literature+notes/32.03+Book+notes/Make+Time+(book)"
    ],
    "articles": [],
    "books": [
        {
            "title": "Make Time: How to Focus on What Matters Every Day by Jake Knapp and John Zeratsky",
            "url": "https://www.amazon.com/dp/0525572422?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Make Time - Official Website",
            "url": "https://maketime.blog/",
            "type": "website"
        },
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Personal Knowledge Management Library",
            "url": "https://store.dsebastien.net/product/pkm-library",
            "type": "other"
        },
        {
            "title": "Personal Knowledge Management Coaching",
            "url": "https://store.dsebastien.net/product/pkm-coaching",
            "type": "other"
        },
        {
            "title": "DeveloPassion's Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/product/clarity-101",
            "type": "other"
        },
        {
            "title": "Personal Organization 101 Workshop",
            "url": "https://store.dsebastien.net/product/personal-organization-101",
            "type": "other"
        },
        {
            "title": "AI Master Prompt Workshop",
            "url": "https://store.dsebastien.net/product/ai-master-prompt",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-29",
    "dateModified": "2026-01-29"
}
