{
    "id": "marginal-utility",
    "name": "Marginal Utility",
    "summary": "The additional satisfaction or benefit gained from consuming one more unit of a good or service.",
    "explanation": "Marginal utility is a foundational economic concept describing the additional satisfaction (utility) a person receives from consuming one more unit of a good or service. The key insight is that utility is not constant - each additional unit typically provides less satisfaction than the previous one.\n\nThis connects directly to the Law of Diminishing Marginal Utility: the first slice of pizza when you're hungry provides enormous satisfaction, the second is still enjoyable, but by the fifth or sixth slice, additional pizza may provide little pleasure or even become unpleasant. This pattern holds across most consumption and activities.\n\nMarginal utility explains many economic behaviors: why people diversify their consumption rather than maximizing one thing, why demand curves slope downward (people only buy more at lower prices because additional units provide less utility), and why variety is valuable. It also explains the 'water-diamond paradox' - water is essential but cheap because additional water provides little marginal utility when it's abundant, while diamonds are expensive because their scarcity keeps marginal utility high.\n\nFor decision-making, marginal utility thinking means evaluating choices at the margin - not 'Is this valuable?' but 'Is the NEXT unit valuable enough to justify its cost?' This applies to time allocation (another hour of work versus rest), learning (another book on this topic versus exploring something new), and resource allocation (another feature versus polish on existing ones).\n\nKey applications include: recognizing when to stop (when marginal utility approaches zero or the cost), understanding why more isn't always better, making allocation decisions across competing uses, and optimizing at the margin rather than in absolutes.",
    "tags": [
        "economics",
        "decision-making",
        "optimizations"
    ],
    "category": "Business & Economics",
    "icon": "FaChartLine",
    "featured": false,
    "aliases": [
        "Diminishing Marginal Utility",
        "Law of Diminishing Marginal Utility"
    ],
    "relatedConcepts": [
        "diminishing-returns",
        "opportunity-cost",
        "minimum-effective-dose"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Marginal utility - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Marginal_utility",
            "type": "website"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/product/clarity-101",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        }
    ],
    "books": [],
    "tutorials": [],
    "datePublished": "2026-01-20",
    "dateModified": "2026-01-29"
}
