{
    "id": "marys-room",
    "name": "Mary's Room",
    "summary": "A thought experiment arguing that knowing all the physical facts about color vision would not prepare someone for the subjective experience of actually seeing color.",
    "explanation": "Mary's Room (also known as the Knowledge Argument) is a thought experiment proposed by philosopher Frank Jackson in 1982. It challenges physicalism - the view that all facts are physical facts - by suggesting that subjective experience involves knowledge that cannot be captured by physical description alone.\n\n**The Thought Experiment:**\n\nMary is a brilliant scientist who has spent her entire life in a black-and-white room. She has never seen color. However, she has studied color vision exhaustively and knows everything physical there is to know about it: the wavelengths of light, how the retina processes them, which neural pathways are activated, how the brain produces color perception, and how people behave when they see colors.\n\nOne day, Mary leaves her room and sees a red rose for the first time. The question is: does she learn something new?\n\n**The Argument:**\n\nIf Mary learns something new when she sees red for the first time - if she gains new knowledge about what red looks like - then her complete physical knowledge was not complete knowledge. There are facts about experience (qualia) that cannot be captured by physical description. This would mean physicalism is false.\n\n**Responses and Objections:**\n\n- **The Ability Hypothesis** (David Lewis): Mary doesn't gain new knowledge but rather a new ability - the ability to recognize, imagine, and remember red\n- **The Acquaintance Hypothesis**: Mary gains acquaintance with a property she already knew about, not propositional knowledge\n- **Dennett's Reply**: A truly omniscient scientist would already know what seeing red is like; our intuition that she wouldn't is simply a failure of imagination\n- **Jackson himself** later rejected his own argument, accepting physicalism\n\nThe thought experiment remains one of the most discussed arguments in philosophy of mind because it crystallizes the tension between scientific explanation and lived experience.",
    "tags": [
        "philosophies",
        "consciousness",
        "philosophy-of-mind",
        "thought-experiments",
        "subjective-experience",
        "qualia"
    ],
    "category": "Philosophy & Wisdom",
    "icon": "FaLightbulb",
    "featured": false,
    "aliases": [
        "Knowledge Argument",
        "Mary the Color Scientist",
        "Jackson's Knowledge Argument"
    ],
    "relatedConcepts": [
        "qualia",
        "hard-problem-of-consciousness",
        "physicalism",
        "consciousness",
        "philosophical-zombies",
        "philosophy-of-mind"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "There's Something About Mary by Peter Ludlow, Yujin Nagasawa, and Daniel Stoljar",
            "url": "https://www.amazon.com/dp/0262621894?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Mary's Room - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Mary%27s_room",
            "type": "website"
        },
        {
            "title": "Qualia: The Knowledge Argument - Stanford Encyclopedia of Philosophy",
            "url": "https://plato.stanford.edu/entries/qualia-knowledge/",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-28",
    "dateModified": "2026-02-28"
}
