{
    "id": "meditation",
    "name": "Meditation",
    "summary": "The practice of training attention and awareness through various techniques to achieve mental clarity, emotional calm, and enhanced self-understanding.",
    "explanation": "Meditation is a broad family of practices that train attention, awareness, and mental faculties through deliberate, structured exercises. While often associated with spiritual traditions, meditation has been extensively studied scientifically and adopted in secular contexts for its cognitive, emotional, and physiological benefits.\n\nMajor categories of meditation practice include:\n\n**Focused attention meditation**: Concentrating on a single object such as the breath, a mantra, a candle flame, or a body sensation. When attention wanders, the practitioner notices and gently returns focus. This strengthens the ability to sustain concentration and notice distraction.\n\n**Open monitoring meditation**: Rather than focusing on one object, the practitioner cultivates broad, non-reactive awareness of whatever arises in experience - thoughts, sensations, emotions, sounds - without attachment or judgment. Mindfulness meditation is the most well-known form.\n\n**Loving-kindness meditation (Metta)**: Systematically cultivating feelings of warmth, compassion, and goodwill toward oneself, loved ones, neutral people, difficult people, and eventually all beings.\n\n**Transcendental Meditation**: A mantra-based technique emphasizing effortless repetition of a specific sound to allow the mind to settle into quieter states of awareness.\n\n**Movement-based meditation**: Practices like yoga, tai chi, qigong, and walking meditation that integrate physical movement with meditative awareness.\n\n**Contemplative and analytical meditation**: Sustained reflection on specific topics, questions, or texts - common in Buddhist (e.g., kōan practice) and Christian contemplative traditions.\n\nScientific research has documented numerous benefits of regular meditation practice:\n\n- **Neuroplasticity**: Long-term meditators show structural changes in brain regions associated with attention, emotional regulation, and self-awareness\n- **Stress reduction**: Decreased cortisol levels and reduced activity in the amygdala\n- **Attention improvement**: Enhanced ability to sustain focus, resist distraction, and switch between tasks\n- **Emotional regulation**: Greater ability to observe emotions without being overwhelmed by them\n- **Default mode network changes**: Reduced mind-wandering and rumination\n\nFor knowledge workers, meditation is increasingly recognized as a core skill for managing attention in an age of constant distraction. Even brief daily practice (10-20 minutes) has been shown to produce measurable improvements in focus, emotional resilience, and decision-making quality.",
    "tags": [
        "psychology",
        "cognition",
        "philosophy"
    ],
    "category": "Well-Being & Happiness",
    "icon": "FaBrain",
    "featured": false,
    "aliases": [
        "Meditative Practice",
        "Contemplative Practice"
    ],
    "relatedConcepts": [
        "mindfulness",
        "focused-attention-meditation",
        "transcendental-meditation",
        "mantra",
        "zazen",
        "koan",
        "anchor-attention",
        "attention-training",
        "savers",
        "miracle-morning"
    ],
    "relatedNotes": [],
    "references": [
        {
            "title": "Meditation - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Meditation",
            "type": "website"
        }
    ],
    "articles": [],
    "books": [
        {
            "title": "Altered Traits by Daniel Goleman and Richard J. Davidson",
            "url": "https://www.amazon.com/dp/0399184392?tag=dsebastien00-20"
        },
        {
            "title": "The Mind Illuminated by Culadasa",
            "url": "https://www.amazon.com/dp/1501156985?tag=dsebastien00-20"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-08",
    "dateModified": "2026-02-08"
}
