{
    "id": "media-literacy",
    "name": "Media Literacy",
    "summary": "The ability to critically analyze, evaluate, and create media in various forms to navigate the modern information landscape.",
    "explanation": "Media literacy is the ability to access, analyze, evaluate, create, and act using media in all its forms - from traditional print and broadcast media to social media, podcasts, videos, and interactive digital content. It equips individuals with the skills to be thoughtful consumers and responsible producers of media in an environment where information, entertainment, persuasion, and misinformation are deeply intertwined.\n\nAt its core, media literacy involves several key competencies. It requires the ability to identify bias in how stories are framed, which perspectives are included or excluded, and what language choices reveal about the creator's intent. It involves understanding media ownership and how economic incentives shape what gets published and promoted. It means recognizing persuasion techniques such as emotional appeals, selective use of statistics, false equivalence, and the strategic use of images. And it demands the skill to evaluate visual media, including understanding how photographs can be cropped, staged, or digitally altered to change their meaning.\n\nMedia literacy is closely related to, but distinct from, several adjacent literacies. Information literacy focuses broadly on finding, evaluating, and using information from any source. Digital literacy encompasses the technical skills needed to navigate digital environments. News literacy specifically addresses the ability to evaluate journalistic content and distinguish reporting from opinion. Media literacy integrates elements of all these while adding a particular focus on understanding how media messages are constructed and how they shape perceptions of reality.\n\nThe rise of social media has fundamentally changed how people encounter and consume information. Algorithmic curation creates filter bubbles that reinforce existing beliefs. The speed of sharing means misinformation can spread faster than corrections. User-generated content blurs the line between professional journalism and amateur reporting. Influencer culture mixes authentic expression with undisclosed commercial promotion. Understanding these dynamics is now an essential part of media literacy.\n\nFact-checking practices are a practical application of media literacy. This includes verifying claims against primary sources, using reverse image searches to check the authenticity and context of photographs, consulting established fact-checking organizations, checking whether a story appears in multiple reputable outlets, and being alert to common indicators of unreliable content such as sensational headlines, anonymous sources, and lack of dates or bylines.\n\nMedia literacy education has become increasingly recognized as a critical defense against misinformation, propaganda, and manipulation. Countries like Finland have integrated media literacy into their national curricula from an early age, and their populations consistently rank among the most resistant to misinformation. Teaching people to ask critical questions about every piece of media they encounter - Who made this? Why? What is missing? How might others interpret this differently? - builds habits of mind that serve as a durable defense in a rapidly changing media environment.",
    "tags": [
        "learning",
        "critical-thinking",
        "media",
        "education"
    ],
    "category": "Learning & Education",
    "icon": "FaNewspaper",
    "featured": false,
    "aliases": [
        "News literacy",
        "Digital media literacy"
    ],
    "relatedConcepts": [
        "information-literacy",
        "critical-thinking",
        "source-criticism",
        "information-filtering",
        "persuasion"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Media literacy - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Media_literacy",
            "type": "website"
        },
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "DeveloPassion's Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-22",
    "dateModified": "2026-02-22"
}
