{
    "id": "memory",
    "name": "Memory",
    "summary": "The cognitive faculty that encodes, stores, and retrieves information, serving as the foundation of learning, identity, and intelligent behavior.",
    "explanation": "Memory is not a single system but a collection of distinct processes and brain regions working together. It encompasses sensory memory (brief retention of sensory input), short-term/working memory (temporary storage for immediate use, limited to about 7 items), and long-term memory (potentially lifelong storage of knowledge and experiences).\n\nLong-term memory divides into explicit (declarative) memory, which includes episodic memory (personal experiences) and semantic memory (facts and concepts), and implicit (non-declarative) memory, which includes procedural memory (skills and habits), priming, and conditioning.\n\nThe key memory processes are encoding (transforming input into memory traces), storage (maintaining information over time through consolidation), retrieval (accessing stored information), and forgetting (loss of access through decay or interference). Importantly, memory is reconstructive rather than reproductive - we rebuild experiences rather than replaying recordings, making memory susceptible to distortions like false memories and the misinformation effect.\n\nModern memory research began with Hermann Ebbinghaus's 1885 studies of forgetting curves and was transformed by discoveries including George Miller's working memory limits, the Atkinson-Shiffrin multi-store model, and Endel Tulving's distinction between episodic and semantic memory. Understanding memory has practical applications in education through spaced repetition and retrieval practice, personal knowledge management, and treating disorders like amnesia and PTSD.",
    "tags": [
        "psychology",
        "cognition",
        "neuroscience",
        "learning",
        "cognitive-science"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaBrain",
    "featured": false,
    "aliases": [
        "Human Memory",
        "Memory Systems"
    ],
    "relatedConcepts": [
        "working-memory",
        "cognitive-psychology",
        "spaced-repetition",
        "retrieval-practice",
        "forgetting-curve",
        "chunking",
        "active-learning",
        "pkm"
    ],
    "relatedNotes": [
        "https://notes.dsebastien.net/30+Areas/33+Permanent+notes/33.02+Content/Memory"
    ],
    "articles": [],
    "books": [
        {
            "title": "Make It Stick by Peter Brown",
            "url": "https://www.amazon.com/dp/0674729013?tag=dsebastien00-20"
        },
        {
            "title": "Moonwalking with Einstein by Joshua Foer",
            "url": "https://www.amazon.com/dp/0143120530?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Memory - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Memory",
            "type": "website"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/l/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://knowledge-management-for-beginners.com",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-28",
    "dateModified": "2026-01-28"
}
