{
    "id": "meta-skills",
    "name": "Meta-Skills",
    "summary": "Higher-order abilities that help you acquire, improve, and adapt other skills more effectively.",
    "explanation": "Meta-skills are skills about skills—higher-order abilities that accelerate learning, adaptation, and performance across domains. They include learning how to learn, self-regulation, metacognition, adaptability, and the ability to unlearn outdated knowledge. Meta-skills don't directly accomplish tasks but amplify your ability to develop task-specific competencies.\n\nIn a rapidly changing world, meta-skills become increasingly valuable. Specific technical skills have shrinking half-lives, but the ability to quickly acquire new skills remains perpetually useful. Someone with strong meta-skills can pivot careers, adopt new technologies, and stay relevant despite disruption. They're the ultimate transferable skills.\n\nKey meta-skills include: learning agility (quickly acquiring new knowledge and skills), self-awareness (understanding your strengths, weaknesses, and learning style), emotional regulation (managing states conducive to learning and performance), feedback processing (extracting lessons from experience), and strategic thinking (choosing what to learn and when).\n\nDeveloping meta-skills requires reflection and deliberate practice at a higher level of abstraction. Instead of just learning a skill, you analyze how you're learning it. Instead of just performing, you evaluate your performance process. This meta-level attention is effortful but compounds over time, making all future learning more efficient. Investing in meta-skills is investing in your capacity to invest in any skill.",
    "tags": [
        "skills",
        "learning",
        "meta-learning",
        "personal-development",
        "adaptability"
    ],
    "category": "Learning & Education",
    "icon": "FaBrain",
    "featured": false,
    "aliases": [
        "Higher-Order Skills",
        "Learning Skills",
        "Foundational Skills"
    ],
    "relatedConcepts": [
        "meta-learning",
        "metacognition",
        "growth-mindset",
        "transferable-skills"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Ultralearning by Scott Young",
            "url": "https://www.amazon.com/dp/006285268X"
        },
        {
            "title": "Peak by Anders Ericsson",
            "url": "https://www.amazon.com/dp/0544456238"
        }
    ],
    "references": [
        {
            "title": "Metacognition - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Metacognition",
            "type": "website"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "DeveloPassion's Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-25",
    "dateModified": "2026-01-25"
}
