{
    "id": "metamemory",
    "name": "Metamemory",
    "summary": "Knowledge and awareness about one's own memory processes, including beliefs about memory capabilities, monitoring of learning, and strategic memory use.",
    "explanation": "Metamemory refers to our knowledge, beliefs, and judgments about our own memory systems and processes. It is a form of metacognition specifically focused on memory - essentially, knowing what you know (and don't know) about your ability to remember.\n\nMetamemory operates at several levels:\n\n**Declarative metamemory** involves explicit knowledge about memory:\n- How memory works in general (memory as reconstructive, not reproductive)\n- What factors affect memory (sleep, stress, attention, encoding strategies)\n- Your own memory strengths and weaknesses (good with faces, poor with names)\n- Knowledge of effective memory strategies (spaced repetition, elaboration)\n\n**Procedural metamemory** involves using this knowledge to regulate learning:\n- Judging whether material has been learned (judgments of learning)\n- Predicting future memory performance (feeling of knowing)\n- Allocating study time strategically\n- Choosing appropriate memory strategies for different tasks\n\n**Monitoring processes** track memory states in real-time:\n- Ease of learning judgments (how difficult will this be?)\n- Judgments of learning (have I learned this well enough?)\n- Feeling of knowing (I can't recall it now, but I know it)\n- Tip-of-the-tongue states (it's on the tip of my tongue)\n- Confidence judgments (how sure am I this memory is accurate?)\n\nMetamemory accuracy is crucial because poor calibration leads to suboptimal learning. Students often stop studying material they judge as learned when it isn't, or fail to use effective strategies because they don't recognize their value. The illusion of fluency is particularly dangerous - material that feels easy during study is often poorly retained.\n\nImplications for knowledge management and learning:\n\n- **Trust testing over feeling**: Retrieval practice reveals actual memory state better than subjective judgments\n- **Build awareness of biases**: Knowing about illusions of learning helps you compensate\n- **Document what you know**: External systems (notes, PKM) augment unreliable metamemory\n- **Track your learning**: Spaced repetition systems provide objective feedback on memory\n- **Question confidence**: High confidence doesn't always mean accurate memory\n\nMetamemory research has shown that metacognitive skills can be trained, and that good metacognition is often more important for academic success than raw memory ability. People who accurately monitor their learning allocate study time more effectively and achieve better outcomes.",
    "tags": [
        "memory",
        "metacognition",
        "learning",
        "psychology",
        "self-awareness",
        "cognitive-science"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaBrain",
    "featured": false,
    "aliases": [
        "Meta-memory",
        "Memory awareness",
        "Metacognitive monitoring"
    ],
    "relatedConcepts": [
        "metacognition",
        "memory",
        "dunning-kruger-effect"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Metamemory - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Metamemory",
            "type": "website"
        },
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "DeveloPassion's Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        },
        {
            "title": "Journaling Deep Dive Workshop",
            "url": "https://store.dsebastien.net/product/journaling-deep-dive",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-04",
    "dateModified": "2026-02-04"
}
