{
    "id": "mimetic-desire",
    "name": "Mimetic Desire",
    "summary": "Desires learned through imitation of others rather than arising from authentic needs, based on René Girard's theory that we want what others want.",
    "explanation": "Mimetic desire is French philosopher René Girard's theory that human desire is fundamentally imitative - we learn what to want by observing what others want. Rather than desires arising autonomously from within, we look to models (people we admire or identify with) to determine what's desirable. The child wants the toy precisely because another child is playing with it. The professional pursues status markers because peers value them.\n\nGirard distinguished between three types of models: internal mediators (rivals within our social sphere), external mediators (distant figures like celebrities), and metaphysical mediators (abstract ideals). When we desire through internal mediation, rivalry emerges - we compete with our model for the same object. This creates the paradox where getting what we want often disappoints because the desire was never truly ours.\n\nMimetic desire explains several puzzling phenomena: why advertising works (it shows models desiring products), why scarcity increases demand (if others want it, it must be valuable), why we want things we didn't know existed until someone else had them, and why achievement often feels hollow (we achieved someone else's definition of success).\n\nFor knowledge workers, understanding mimetic desire illuminates the difference between authentic aspiration and borrowed ambition. Social media amplifies mimetic desire by constantly displaying others' choices, achievements, and possessions. The entrepreneur building someone else's idea of a successful company, the writer pursuing acclaim rather than expression - these are mimetic desires masquerading as authentic ones. Recognizing mimetic patterns helps distinguish thick desires (genuinely transformative) from thin desires (often mimetically acquired). The question isn't 'Do I want this?' but 'Would I want this if no one else did?'",
    "tags": [
        "philosophies",
        "psychology",
        "social-dynamics",
        "awareness",
        "intentionality",
        "values",
        "decision-making",
        "influence"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaUsers",
    "featured": false,
    "aliases": [
        "Mimetic theory",
        "Imitative desire",
        "Social desire",
        "Girardian desire"
    ],
    "relatedConcepts": [
        "npc-mindset",
        "social-scripts",
        "thin-desires",
        "social-proof",
        "shiny-object-syndrome",
        "existential-authenticity",
        "bandwagon-effect"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "René Girard - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Ren%C3%A9_Girard",
            "type": "website"
        },
        {
            "title": "Mimetic theory - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Mimetic_theory",
            "type": "website"
        }
    ],
    "books": [
        {
            "title": "Wanting: The Power of Mimetic Desire in Everyday Life by Luke Burgis",
            "url": "https://www.amazon.com/dp/1250262488?tag=dsebastien00-20"
        },
        {
            "title": "Deceit, Desire, and the Novel by René Girard",
            "url": "https://www.amazon.com/dp/080187553X?tag=dsebastien00-20"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-06",
    "dateModified": "2026-01-16"
}
