{
    "id": "mind-body-problem",
    "name": "Mind-Body Problem",
    "summary": "The philosophical question of how mental states, experiences, and consciousness relate to the physical states of the brain and body.",
    "explanation": "The Mind-Body Problem is one of the oldest and most fundamental questions in philosophy: how do mind and body relate? How can subjective mental experiences arise from objective physical matter? When you feel pain, how does a physical event (tissue damage) produce a subjective experience (the feeling of pain)?\n\n**Historical Development:**\n\nRene Descartes formalized the problem through substance dualism, arguing that mind (res cogitans) and body (res extensa) are fundamentally different substances. This immediately raised the interaction problem: how can a non-physical mind cause physical effects, and vice versa? Descartes speculated the pineal gland was the point of interaction, but this merely relocated the mystery.\n\n**Major Positions:**\n\n- **Dualism**: Mind and body are distinct. Variants include substance dualism (Descartes), property dualism (mental properties are non-physical), and epiphenomenalism (mental states exist but have no causal power)\n- **Physicalism/Materialism**: Everything is physical. Identity theory equates mental states with brain states. Eliminative materialism argues mental concepts will be replaced by neuroscience\n- **Functionalism**: Mental states are defined by their functional roles, not their physical composition - what matters is the pattern, not the substrate\n- **Neutral monism**: Both mind and matter are manifestations of a more fundamental substance\n- **Panpsychism**: Consciousness is a fundamental feature of all matter\n\n**Why It Matters:**\n\nThe Mind-Body Problem underpins questions about artificial intelligence (can machines think?), free will (are our choices determined by physics?), personal identity (what makes you 'you' over time?), and the ethics of consciousness (which beings deserve moral consideration?).",
    "tags": [
        "philosophies",
        "consciousness",
        "philosophy-of-mind",
        "dualism",
        "neuroscience"
    ],
    "category": "Philosophy & Wisdom",
    "icon": "FaBrain",
    "featured": false,
    "aliases": [
        "Mind-Body Dualism",
        "Mind-Body Relation",
        "Cartesian Dualism Problem"
    ],
    "relatedConcepts": [
        "consciousness",
        "qualia",
        "philosophy-of-mind",
        "dualism",
        "physicalism",
        "hard-problem-of-consciousness",
        "epiphenomenalism",
        "cogito-ergo-sum"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Philosophy of Mind by Jaegwon Kim",
            "url": "https://www.amazon.com/dp/0813344581?tag=dsebastien00-20"
        },
        {
            "title": "The Mind-Body Problem by Jonathan Westphal",
            "url": "https://www.amazon.com/dp/0262529521?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Mind-Body Problem - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Mind%E2%80%93body_problem",
            "type": "website"
        },
        {
            "title": "The Mind/Body Problem - Stanford Encyclopedia of Philosophy",
            "url": "https://plato.stanford.edu/entries/dualism/",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-28",
    "dateModified": "2026-02-28"
}
