{
    "id": "moat",
    "name": "Economic Moat",
    "summary": "Sustainable competitive advantage that protects a company from competitors, like a moat protects a castle.",
    "explanation": "Economic moat, a term popularized by Warren Buffett, describes a company's ability to maintain competitive advantages to protect long-term profits and market share from competitors. The metaphor compares business advantages to the moat surrounding a medieval castle - the wider and deeper the moat, the harder it is for competitors to attack. Types of moats include: network effects (value increases with users), switching costs (painful for customers to leave), cost advantages (economies of scale, superior processes), intangible assets (brands, patents, regulatory licenses), and efficient scale (natural monopolies in limited markets). Moats erode over time as competitors innovate and markets change. Buffett advises investing in companies with wide moats and management committed to widening them. For knowledge workers, building personal moats means developing unique combinations of skills and relationships that are difficult to replicate, creating sustainable career advantages.",
    "tags": [
        "investments",
        "strategies",
        "businesses",
        "competition"
    ],
    "category": "Business & Economics",
    "icon": "FaShieldAlt",
    "featured": false,
    "aliases": [
        "Moat",
        "Business Moat",
        "Competitive Moat",
        "Buffett's Moat"
    ],
    "relatedConcepts": [
        "competitive-advantage",
        "network-effects",
        "switching-costs",
        "economies-of-scale",
        "barriers-to-entry"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Economic moat - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Economic_moat",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-03",
    "dateModified": "2026-02-03"
}
