{
    "id": "model-collapse",
    "name": "Model Collapse",
    "summary": "The degradation of AI model quality when trained on synthetic data generated by other AI models, causing progressive loss of diversity and accuracy.",
    "explanation": "Model collapse is a phenomenon where AI models trained on data generated by other AI models progressively degrade in quality, losing diversity, accuracy, and the ability to represent the full range of the original training distribution. First formally described in research by Shumailov et al. (2023), the concept warns of a potential crisis as AI-generated content increasingly dominates the internet that future models will be trained on.\n\nThe mechanism works through iterative distortion. When a model generates text, it slightly favors high-probability outputs and underrepresents rare but valid patterns. When a second model trains on this output, it further amplifies the bias toward common patterns. Over successive generations, the tails of the distribution are progressively clipped - rare words, unusual constructions, minority perspectives, and specialized knowledge gradually vanish. The result is models that produce increasingly homogeneous, bland, and inaccurate outputs.\n\nModel collapse has two distinct phases. In early model collapse, the model begins losing information about the tails of the distribution - rare events, unusual patterns, and minority viewpoints are underrepresented. In late model collapse, the model converges to a narrow distribution that may bear little resemblance to the original data, producing outputs that are repetitive and disconnected from reality.\n\nThe concept has broader implications beyond AI. It mirrors how any feedback loop without fresh external input can lead to degradation: academic echo chambers that cite only each other, corporate cultures that lose touch with customers, or media ecosystems that recycle the same narratives. The antidote in all cases is maintaining contact with primary sources and diverse inputs.\n\nFor the AI ecosystem, model collapse underscores the value of human-generated content, the importance of curating training data, and the need for techniques that preserve distributional diversity. It also connects to semantic ablation: the same tendency to lose rare, high-information content operates within a single model's generation process and across model generations.",
    "tags": [
        "ai",
        "machine-learning",
        "limitations",
        "training",
        "risks"
    ],
    "category": "AI",
    "icon": "FaRecycle",
    "featured": false,
    "aliases": [
        "AI Model Degradation",
        "Recursive Training Collapse",
        "Synthetic Data Degradation"
    ],
    "relatedConcepts": [
        "semantic-ablation",
        "lexical-flattening",
        "ai-hallucination",
        "generative-ai",
        "large-language-models",
        "synthetic-media",
        "dead-internet-theory",
        "fine-tuning"
    ],
    "relatedNotes": [],
    "articles": [
        {
            "title": "The Curse of Recursion: Training on Generated Data Makes Models Forget",
            "url": "https://arxiv.org/abs/2305.17493",
            "type": "paper"
        }
    ],
    "books": [],
    "references": [
        {
            "title": "Model collapse - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Model_collapse",
            "type": "website"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "AI Ghostwriter Guide",
            "url": "https://store.dsebastien.net/product/ai-ghostwriter-guide",
            "type": "other"
        },
        {
            "title": "DeveloPassion's Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        },
        {
            "title": "Knowii Voice AI",
            "url": "https://voice-ai.knowii.net",
            "type": "other"
        },
        {
            "title": "AI Master Prompt Workshop",
            "url": "https://store.dsebastien.net/product/ai-master-prompt",
            "type": "other"
        },
        {
            "title": "Model Context Protocol (MCP) Workshop",
            "url": "https://store.dsebastien.net/product/model-context-protocol",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-20",
    "dateModified": "2026-02-20"
}
