{
    "id": "mood-tracking",
    "name": "Mood Tracking",
    "summary": "The practice of recording emotional states over time to identify patterns and improve emotional awareness.",
    "explanation": "Mood tracking is the systematic recording of emotional states to gain insight into patterns, triggers, and trends in your psychological wellbeing. At its simplest, it involves rating your mood on a scale (1-10 or emoji-based) at regular intervals. More detailed tracking includes: specific emotions (not just good/bad but anxious, content, frustrated, excited), intensity levels, context (time, location, activities, people), potential triggers, sleep and energy correlation, and brief notes on what happened. Methods range from paper journals and mood diaries to dedicated apps (Daylio, Pixels, Bearable) that can generate visualizations and insights. Benefits include: increased emotional awareness (recognizing feelings as they occur), pattern recognition (discovering what activities, people, or times affect mood), early warning detection (spotting downward trends before they become crises), better communication with therapists or doctors, and validation of interventions (seeing if changes actually improve wellbeing). The practice leverages the mere measurement effect—simply paying attention to emotions tends to improve emotional regulation. For knowledge workers, mood tracking reveals how work patterns affect wellbeing, identifies optimal conditions for different types of work, and supports burnout prevention through early detection of stress patterns.",
    "tags": [
        "well-being",
        "self-awareness",
        "mental-health",
        "emotions",
        "journaling",
        "measurement"
    ],
    "category": "Well-Being & Happiness",
    "icon": "FaSmile",
    "featured": false,
    "aliases": [
        "Emotion tracking",
        "Mood journaling",
        "Mood diary",
        "Emotional logging"
    ],
    "relatedConcepts": [
        "quantified-self",
        "life-tracking",
        "benefits-of-journaling",
        "emotional-intelligence",
        "interoception",
        "mere-measurement-effect"
    ],
    "relatedNotes": [],
    "articles": [
        {
            "title": "Announcing Life Tracker: A New Obsidian Plugin",
            "url": "https://www.dsebastien.net/announcing-life-tracker-a-new-obsidian-plugin",
            "type": "website"
        }
    ],
    "references": [
        {
            "title": "Obsidian Life Tracker Base View - GitHub",
            "url": "https://github.com/dsebastien/obsidian-life-tracker-base-view",
            "type": "website"
        },
        {
            "title": "Clarity 101",
            "url": "https://www.store.dsebastien.net/product/clarity-101",
            "type": "other"
        },
        {
            "title": "Mood tracking - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Mood_tracking",
            "type": "website"
        },
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Journaling Deep Dive Workshop",
            "url": "https://store.dsebastien.net/product/journaling-deep-dive",
            "type": "other"
        }
    ],
    "books": [],
    "tutorials": [],
    "datePublished": "2026-01-25",
    "dateModified": "2026-01-25"
}
