{
    "id": "moral-circle-expansion",
    "name": "Moral Circle Expansion",
    "summary": "The historical and philosophical trend of extending moral concern and rights to an ever-wider range of beings, from kin to strangers to animals and potentially to future beings.",
    "explanation": "Moral circle expansion refers to the historical tendency and philosophical argument for broadening the range of entities considered worthy of moral consideration. The concept was popularized by philosopher Peter Singer and historian of morality W.E.H. Lecky, and has become a central theme in effective altruism and animal ethics.\n\nThe 'moral circle' metaphor imagines a boundary around those beings whose interests we take seriously. Throughout history, this circle has expanded in recognizable stages:\n\n**Historical progression**: Early human moral concern was largely confined to immediate family and tribe. Over millennia, it expanded to include fellow citizens, then people of the same nation, then all humans regardless of race, gender, or nationality. Each expansion met fierce resistance from those who considered the existing boundary natural and immutable.\n\n**Key expansions**:\n- Abolition of slavery: Recognizing the full moral status of enslaved peoples\n- Women's rights: Extending equal moral consideration to women\n- Civil rights: Overcoming racial discrimination\n- Children's rights: Recognizing children as moral patients with their own interests\n- Disability rights: Including people with disabilities in full moral consideration\n- Animal rights: Extending concern to non-human sentient beings\n\n**Current frontiers**: Contemporary discussions focus on extending moral consideration to all sentient animals (including insects and fish), future generations, potential digital minds, and even ecosystems as entities with intrinsic value.\n\nThe philosophical basis for moral circle expansion typically rests on the argument that the morally relevant feature is the capacity to suffer or have interests, not membership in a particular group. Singer's famous principle holds that 'the interests of every being affected by an action are to be taken into account and given the same weight as the like interests of any other being.'\n\nSeveral cognitive biases work against moral circle expansion. In-group favoritism leads us to privilege those similar to us. Speciesism mirrors earlier forms of discrimination by drawing moral boundaries along species lines. Scope insensitivity makes it difficult to emotionally engage with the suffering of vast numbers of unfamiliar beings.\n\nCritics argue that moral circle expansion can become too demanding if taken to its logical conclusion, that not all entities deserve equal moral consideration, and that expanding the circle too far may dilute our ability to care effectively for those closest to us.",
    "tags": ["ethics", "philosophy", "psychology"],
    "category": "Philosophy & Wisdom",
    "icon": "FaCompass",
    "featured": false,
    "aliases": ["Expanding Circle", "Expanding Moral Circle"],
    "relatedConcepts": ["effective-altruism", "altruism", "utilitarianism", "scope-insensitivity", "in-group-bias", "longtermism", "empathy"],
    "relatedNotes": [],
    "references": [{"title": "The Expanding Circle - Wikipedia", "url": "https://en.wikipedia.org/wiki/The_Expanding_Circle", "type": "website"}],
    "articles": [],
    "books": [{"title": "The Expanding Circle by Peter Singer", "url": "https://www.amazon.com/dp/0691150699?tag=dsebastien00-20"}, {"title": "The Better Angels of Our Nature by Steven Pinker", "url": "https://www.amazon.com/dp/0143122010?tag=dsebastien00-20"}],
    "tutorials": [],
    "datePublished": "2026-02-08",
    "dateModified": "2026-02-08"
}
