{
    "id": "naive-cynicism",
    "name": "Naive Cynicism",
    "summary": "The tendency to expect others to be more self-interested and cynical than they actually are, assuming negative motives when neutral or positive ones may apply.",
    "explanation": "Naive Cynicism is a cognitive bias in which people naively expect more egocentric bias in others than actually exists. First formally proposed by psychologists Justin Kruger and Thomas Gilovich in 1999, this bias leads us to assume that other peoples actions and judgments are driven by self-interest, even when their motivations may be genuine, neutral, or altruistic. The core premise can be summarized as: I am not biased, you are biased if you disagree with me, and your intentions reflect your underlying egocentric biases.\n\nNaive cynicism is the counterpart to naive realism, and both biases stem from the same root assumption: that we see the world objectively while others do not. Where naive realism leads us to believe our own perceptions are unbiased and accurate, naive cynicism extends this to expecting that others motivations are tainted by self-interest in ways our own are not. Both biases are also closely related to the bias blind spot, where we recognize how biases affect others judgments but fail to see those effects in ourselves. Research shows this cynical tendency develops early, with children as young as seven already demonstrating cynical assumptions about others motivations.\n\nThe consequences of naive cynicism can be significant across personal and professional domains. In relationships and negotiations, assuming the worst about others motives damages trust and cooperation, often creating self-fulfilling prophecies where our suspicious behavior provokes the very defensiveness we expected. Studies on married couples, workplace collaborators, and negotiators consistently show that people expect others responsibility allocations to be motivationally biased while viewing their own as fair, even when the actual allocations show no such pattern. Recognizing this bias is essential for improving interpersonal relationships, conducting fairer negotiations, and building collaborative environments. The antidote involves consciously considering that others may have legitimate, non-selfish reasons for their positions and practicing the same charitable interpretation we automatically extend to ourselves.",
    "tags": [
        "cognitive-biases",
        "psychology",
        "social-psychology",
        "judgments"
    ],
    "category": "Cognitive Biases",
    "icon": "FaBrain",
    "featured": false,
    "aliases": [
        "Cynical Attribution Bias"
    ],
    "relatedConcepts": [
        "naive-realism",
        "fundamental-attribution-error",
        "bias-blind-spot",
        "self-serving-bias"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Naive cynicism - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Na%C3%AFve_cynicism",
            "type": "website"
        },
        {
            "title": "Naive Cynicism in Everyday Theories of Responsibility Assessment: On Biased Assumptions of Bias - Kruger & Gilovich",
            "url": "https://www.researchgate.net/publication/232506118_Naive_Cynicism_in_Everyday_Theories_of_Responsibility_Assessment_On_Biased_Assumptions_of_Bias",
            "type": "paper"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-29",
    "dateModified": "2026-01-29"
}
