{
    "id": "narrative-misdirection",
    "name": "Narrative Misdirection",
    "summary": "Deliberately misleading the audience through selective information revelation, false emphasis, and manipulation of narrative focus.",
    "explanation": "Narrative misdirection is the strategic manipulation of what information receives attention and how it's presented to create false impressions or hide truth. Unlike simple red herrings (single false clues), misdirection is a broader technique involving the entire narrative structure, pacing, and emphasis. It's about directing the audience's mental spotlight away from what matters. Techniques of misdirection: emphasizing irrelevant details (make unimportant things seem crucial), underplaying key information (mention truth casually so it's forgotten), timing manipulation (reveal truth when audience is focused elsewhere), false patterns (establish expectations then break them), and narrator manipulation (use unreliable narrators or perspective tricks). Misdirection vs lies: good misdirection doesn't lie - it tells the truth but makes you look the wrong way. Everything needed to solve the mystery is present, but attention is skillfully diverted. Examples: magicians use misdirection - 'look at my right hand' while the left hand does the trick. In stories: focus on emotional scenes while crucial plot information slips by unnoticed, or center story on one character while the real protagonist operates in the background. Effective misdirection requires: understanding audience expectations (to subvert them), careful control of information flow (what's revealed when), and trust management (audience must believe they're getting the full picture). In the three-sided knowledge structure, misdirection exploits the gap between what the author knows, what they choose to emphasize, and what readers focus on.",
    "tags": [
        "storytelling",
        "writing",
        "techniques",
        "psychology",
        "communications",
        "persuasions"
    ],
    "category": "Writing & Content Creation",
    "icon": "FaMagic",
    "featured": false,
    "aliases": [
        "Narrative sleight of hand",
        "Story misdirection",
        "Attention manipulation"
    ],
    "relatedConcepts": [
        "unreliable-narrator",
        "red-herring",
        "dramatic-irony",
        "foreshadowing",
        "narrative-perspective",
        "information-asymmetry"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Misdirection - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Misdirection_(magic)",
            "type": "website"
        },
        {
            "title": "AI Ghostwriter Guide",
            "url": "https://store.dsebastien.net/product/ai-ghostwriter-guide",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-06",
    "dateModified": "2026-01-29"
}
