{
    "id": "narrative-perspective",
    "name": "Narrative Perspective",
    "summary": "The viewpoint from which a story is told, determining what information is revealed to the reader and how they experience the narrative.",
    "explanation": "Narrative perspective (or point of view) determines who tells the story and what information they can access and reveal. This fundamental choice shapes the entire reading experience by controlling the flow of information. Types of perspective: first-person (narrator is a character using 'I', limited to their knowledge and experience), second-person (addresses reader as 'you', rare and experimental), third-person limited (narrator outside the story, follows one character's thoughts), third-person omniscient (narrator knows everything about all characters), and third-person objective (narrator reports only observable actions, no internal thoughts). Each perspective creates different effects: first-person creates intimacy and immediacy but limits information; omniscient allows broad context and multiple viewpoints but can feel distant; limited third-person balances closeness with flexibility. Perspective choices affect: what readers can know (omniscient reveals all, limited restricts), emotional connection (first-person typically feels closest), reliability (first-person narrators can be biased or unreliable), and pacing (omniscient can jump freely, first-person must justify scene shifts). The three-sided knowledge structure depends on perspective - it determines how the author can portion out information between themselves, characters, and readers. Choosing perspective is choosing what to reveal and when.",
    "tags": [
        "storytelling",
        "writing",
        "narratives",
        "techniques",
        "literature",
        "communications"
    ],
    "category": "Writing & Content Creation",
    "icon": "FaEye",
    "featured": false,
    "aliases": [
        "Point of view",
        "POV",
        "Narrative voice",
        "Narrative viewpoint"
    ],
    "relatedConcepts": [
        "unreliable-narrator",
        "narrative-structure",
        "show-dont-tell",
        "dramatic-irony",
        "theory-of-mind"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Narration - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Narration",
            "type": "website"
        },
        {
            "title": "Point of view (narrative) - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Point_of_view_(narrative)",
            "type": "website"
        },
        {
            "title": "AI Ghostwriter Guide",
            "url": "https://store.dsebastien.net/l/ai-ghostwriter-guide",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-06",
    "dateModified": "2026-01-06"
}
