{
    "id": "net-present-value",
    "name": "Net Present Value (NPV)",
    "summary": "The value today of a future sum of money, accounting for the time value of money through discounting.",
    "explanation": "Net Present Value (NPV) is a financial metric that calculates the present value of all future cash flows (both incoming and outgoing) generated by an investment, minus the initial investment cost. It answers the fundamental question: 'Is this investment worth more than it costs?'\n\n**The Formula**:\nNPV = Σ (Cash Flow / (1 + r)^t) - Initial Investment\n\nWhere r is the discount rate (often the cost of capital or required rate of return) and t is the time period.\n\n**Interpreting NPV**:\n- NPV > 0: The investment creates value; it earns more than the required return\n- NPV = 0: The investment breaks even at the required return rate\n- NPV < 0: The investment destroys value; it earns less than required\n\n**Why NPV matters**:\n- Accounts for the time value of money (a dollar today is worth more than a dollar tomorrow)\n- Provides a single number to compare different investment options\n- Considers all cash flows over the investment's lifetime\n- Incorporates risk through the discount rate\n\n**Applications beyond finance**:\nNPV thinking applies to any resource investment:\n- Learning: Is this course worth the time investment given future career benefits?\n- Projects: Does the long-term value justify the upfront effort?\n- Decisions: How do I compare options with different timing of costs and benefits?\n\n**Limitations**:\n- Requires estimating future cash flows (inherently uncertain)\n- The choice of discount rate significantly affects results\n- Doesn't account for strategic options or flexibility\n- May favor smaller projects over larger ones with similar NPV\n\nFor knowledge workers, NPV provides a framework for thinking about the true value of investments when costs and benefits occur at different times.",
    "tags": [
        "finance",
        "decision-making",
        "metrics",
        "investments"
    ],
    "category": "Business & Economics",
    "icon": "FaCalculator",
    "featured": false,
    "aliases": [
        "NPV",
        "Net present value",
        "Discounted cash flow"
    ],
    "relatedConcepts": [
        "return-on-investment",
        "time-value-of-money",
        "opportunity-cost",
        "payback-period",
        "break-even-analysis"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Net present value - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Net_present_value",
            "type": "website"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/product/clarity-101",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-16",
    "dateModified": "2026-01-18"
}
