{
  "id": "neurophilosophy",
  "name": "Neurophilosophy",
  "summary": "The interdisciplinary field that brings neuroscience to bear on traditional philosophical questions about mind, knowledge, and consciousness.",
  "explanation": "Neurophilosophy is the interdisciplinary field that integrates neuroscience with philosophy to address fundamental questions about the mind, consciousness, and cognition. The term was coined by Patricia Churchland in her 1986 book *Neurophilosophy: Toward a Unified Science of the Mind-Brain*.\n\nThe core claim of neurophilosophy is that philosophy of mind must be informed by and constrained by empirical findings from neuroscience. Patricia Churchland and Paul Churchland argue that armchair philosophy about the mind is inadequate—we need actual data about how brains work. This approach contrasts sharply with traditional analytic philosophy, which often relied purely on conceptual analysis and thought experiments.\n\nNeurophilosophy connects to eliminative materialism: the view that as neuroscience advances, our everyday \"folk psychological\" concepts (like beliefs, desires, and intentions) may need to be replaced by more accurate neuroscientific concepts. This is analogous to how concepts like \"phlogiston\" were replaced by oxygen in chemistry.\n\nCritics of neurophilosophy argue that it neglects first-person subjective experience and that conceptual analysis still has an important role to play in understanding the mind. The debate between neurophilosophers and their critics remains a central tension in contemporary philosophy of mind.\n\nKey claims of neurophilosophy include: the mind is identical to the brain (physicalism), neuroscience should constrain philosophical theorizing (no pure armchair philosophy), and folk psychology may ultimately prove to be a false theory of mind (eliminativism is possible).",
  "tags": [
    "philosophies",
    "neuroscience",
    "consciousness",
    "philosophy-of-mind",
    "physicalism"
  ],
  "category": "Philosophy & Wisdom",
  "icon": "FaBrain",
  "featured": false,
  "aliases": [
    "Neurophilosophy"
  ],
  "relatedConcepts": [
    "philosophy-of-mind",
    "consciousness"
  ],
  "relatedNotes": [
    "https://notes.dsebastien.net/33+02+Content/Neurophilosophy"
  ],
  "articles": [],
  "books": [
    {
      "title": "Neurophilosophy: Toward a Unified Science of the Mind-Brain by Patricia Churchland",
      "url": "https://www.amazon.com/dp/0262530856?tag=dsebastien00-20"
    }
  ],
  "references": [
    {
      "title": "Wikipedia: Neurophilosophy",
      "url": "https://en.wikipedia.org/wiki/Neurophilosophy",
      "type": "website"
    }
  ],
  "tutorials": [],
  "datePublished": "2026-01-28",
  "dateModified": "2026-01-28"
}
