{
    "id": "newsletter",
    "name": "Newsletter",
    "summary": "An email-based content distribution format that builds direct relationships with subscribers through regular, curated, or original content.",
    "explanation": "Newsletters are a content distribution channel that provides direct, unmediated access to an audience through email. Unlike social media, where algorithms determine who sees content, newsletters land directly in subscribers' inboxes, offering ownership of the audience relationship and consistent reach.\n\nThe newsletter renaissance of recent years has been driven by platforms that make it easy to publish and monetize email content. Advantages over social media include intimacy (a personal message rather than a broadcast), higher engagement rates, and independence from platform algorithm changes. Newsletters come in several forms: curated editions that collect and comment on relevant links, original content newsletters that function as serialized writing, and hybrid formats that blend both approaches.\n\nGrowth strategies include cross-promotion, referral programs, lead magnets, and leveraging existing audiences from blogs or social media. Content consistency, both in quality and frequency, builds trust and retention. Monetization pathways include paid subscriptions, sponsorships, and using newsletters as a funnel to other products or services. For knowledge workers and creators, newsletters serve as a powerful tool for building a personal brand and establishing thought leadership in a specific domain.",
    "tags": [
        "writing",
        "content-creation",
        "marketing",
        "communication"
    ],
    "category": "Writing & Content Creation",
    "icon": "FaEnvelopeOpenText",
    "featured": false,
    "aliases": [
        "Email newsletter",
        "Substack",
        "Email list"
    ],
    "relatedConcepts": [
        "blogging",
        "content-strategy",
        "writing-process",
        "audience-awareness",
        "personal-branding"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "AI Ghostwriter Guide",
            "url": "https://store.dsebastien.net/product/ai-ghostwriter-guide",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-21",
    "dateModified": "2026-02-21"
}
