{
    "id": "next-in-line-effect",
    "name": "Next-in-Line Effect",
    "summary": "A memory phenomenon where people have reduced recall for what someone says immediately before their own turn to speak, due to anxiety and rehearsal focus.",
    "explanation": "The Next-in-Line Effect is a cognitive phenomenon first documented by psychologists Malcolm Brenner in 1973. It describes the common experience of being unable to remember what the person immediately before you said when you are about to speak in a group setting. This memory impairment occurs because anticipating one's own turn creates a state of heightened anxiety and self-focus that interferes with the encoding of incoming information.\n\nSeveral psychological mechanisms contribute to this effect. First, performance anxiety diverts cognitive resources away from listening and toward self-monitoring. Second, mental rehearsal of what you plan to say occupies working memory that would otherwise be used to process others' contributions. Third, self-focused attention narrows your perceptual field, causing you to miss external information. The effect is strongest in high-stakes situations such as job interviews, formal presentations, or meetings where you feel evaluated.\n\nThe practical implications are significant for professional and social settings. In meetings, participants often miss crucial context provided by the speaker before them, leading to redundant points or disconnected discussions. In educational settings like round-robin classroom activities, students may fail to build on previous answers. In presentations with Q&A sessions, panelists may not respond coherently to preceding comments.\n\nTo mitigate the Next-in-Line Effect, consider these strategies: take brief notes during others' turns to maintain engagement; prepare your contributions in advance when possible to reduce rehearsal load; use structured turn-taking formats that give speakers a moment to collect thoughts; practice active listening techniques that anchor attention externally; and in facilitation roles, briefly summarize previous points before calling on new speakers. Awareness of this effect alone can help you consciously redirect attention during critical moments when others are speaking just before your turn.",
    "tags": [
        "cognitive-biases",
        "memory",
        "attention",
        "communication",
        "social-psychology"
    ],
    "category": "Cognitive Biases",
    "icon": "FaBrain",
    "featured": false,
    "aliases": [],
    "relatedConcepts": [
        "attentional-bias",
        "anxiety"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Next-in-line effect - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Next-in-line_effect",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-30",
    "dateModified": "2025-12-30"
}
