{
    "id": "nirvana-fallacy",
    "name": "Nirvana Fallacy",
    "summary": "A logical fallacy that occurs when someone rejects a realistic, useful but imperfect solution by comparing it unfavorably to an idealized, perfect solution that does not or cannot exist.",
    "explanation": "The nirvana fallacy, also known as the perfect solution fallacy, occurs when someone dismisses a practical but imperfect option by comparing it to an idealized alternative that doesn't exist in reality. The reasoning follows the pattern: 'Solution X isn't perfect, therefore it's no good.'\n\nThis fallacy was identified by economist Harold Demsetz, who observed that policy analysts often compared real-world institutions to theoretical ideals, then concluded that the real-world versions were failures — without considering whether the ideal was actually achievable.\n\nThe nirvana fallacy appears in many contexts:\n\n- **Personal decisions**: Refusing to start a business because the plan isn't perfect, rather than launching and iterating.\n- **Tool selection**: Rejecting a useful framework, philosophy, or method because it has some flaws, rather than extracting what's valuable.\n- **Relationships**: Ending relationships because a partner doesn't meet an impossible standard.\n- **Policy debates**: Dismissing workable solutions because they don't solve 100% of the problem.\n\nDerek Sivers applies this concept to beliefs and ideas: when people discover that a framework, religion, or philosophy contains some falsehood or inconsistency, they often discard the entire thing — losing all its benefits. The phrase 'true is the enemy of useful' captures this dynamic: insisting on perfection prevents you from benefiting from what's merely good.\n\nThe antidote is **pragmatic evaluation**: judge solutions by whether they improve the situation compared to doing nothing, not by whether they achieve perfection.",
    "tags": [
        "cognitive-biases",
        "logical-fallacies",
        "thinking",
        "decision-making",
        "perfectionism"
    ],
    "category": "Cognitive Biases",
    "icon": "FaBrain",
    "featured": false,
    "aliases": [
        "Perfect Solution Fallacy",
        "Perfect is the Enemy of Good"
    ],
    "relatedConcepts": [
        "pragmatism",
        "beliefs-as-tools",
        "perfectionism",
        "cognitive-biases"
    ],
    "relatedNotes": [],
    "references": [
        {
            "title": "Nirvana fallacy - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Nirvana_fallacy",
            "type": "website"
        },
        {
            "title": "Useful Not True by Derek Sivers",
            "url": "https://sive.rs/u",
            "type": "website"
        },
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/product/clarity-101",
            "type": "other"
        }
    ],
    "articles": [],
    "books": [],
    "tutorials": [],
    "datePublished": "2026-02-11",
    "dateModified": "2026-02-11"
}
