{
    "id": "no-free-lunch",
    "name": "No Free Lunch",
    "summary": "Every gain comes with a trade-off or hidden cost that must be paid.",
    "explanation": "\"There ain't no such thing as a free lunch\" (TANSTAAFL) is an economic adage expressing that it is impossible to get something for nothing. Even when something appears free, there is always a cost paid by someone, somewhere, in some form. The phrase originated in American saloons that offered \"free\" lunches to patrons who purchased drinks. The concept applies universally: free software may cost your privacy, free advice may come with strings attached, shortcuts may incur technical debt, and quick wins often sacrifice long-term value. In decision-making and knowledge work, this principle reminds us to identify hidden costs before committing - time, attention, opportunity cost, maintenance burden, or future flexibility. Understanding this helps avoid naive optimism and make more realistic assessments of true costs and benefits.",
    "tags": [
        "economics",
        "decision-making",
        "principles",
        "thinking"
    ],
    "category": "Principles",
    "icon": "FaBalanceScale",
    "featured": false,
    "aliases": [
        "TANSTAAFL",
        "There ain't no such thing as a free lunch",
        "There is no free lunch",
        "No free meal"
    ],
    "relatedConcepts": [
        "opportunity-cost",
        "diminishing-returns",
        "sunk-cost-fallacy",
        "scarcity",
        "hidden-time-cost"
    ],
    "relatedNotes": [
        "https://notes.dsebastien.net/30+Areas/32+Literature+notes/32.05+Quotes/There+is+no+free+lunch"
    ],
    "articles": [],
    "books": [
        {
            "title": "The Moon Is a Harsh Mistress by Robert A. Heinlein",
            "url": "https://www.amazon.com/dp/0312863551?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "There ain't no such thing as a free lunch - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/There_ain%27t_no_such_thing_as_a_free_lunch",
            "type": "website"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/l/knowii-clarity-101",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-14",
    "dateModified": "2026-01-14"
}
