{
    "id": "nonviolent-communication",
    "name": "Nonviolent Communication",
    "summary": "Marshall Rosenberg's framework for compassionate communication based on observations, feelings, needs, and requests.",
    "explanation": "Nonviolent Communication (NVC) is a communication framework developed by psychologist Marshall Rosenberg that aims to foster empathy, understanding, and connection in human interactions. At its core, NVC is built on the premise that all human behavior is an attempt to meet universal needs, and that conflict arises not from our needs themselves but from the strategies we use to meet them.\n\nThe NVC framework consists of four interconnected components. First, *observations* involve describing what you see or hear without adding evaluation or judgment. For example, saying 'You arrived at 9:15 when we agreed on 9:00' rather than 'You're always late.' Second, *feelings* require identifying and expressing your emotional state in response to what you observed, taking ownership of your emotions rather than blaming others. Third, *needs* involve connecting your feelings to the underlying universal human needs they reflect, such as needs for respect, autonomy, connection, or safety. Fourth, *requests* involve making clear, specific, actionable requests (not demands) that would help meet your needs.\n\nRosenberg used the metaphors of jackal and giraffe language to illustrate two contrasting communication patterns. Jackal language is characterized by judgment, criticism, blame, and demands. It focuses on what is wrong with others and tends to provoke defensiveness. Giraffe language (named because giraffes have the largest hearts of any land animal) is the language of NVC: it speaks from the heart, expresses vulnerability, seeks understanding, and invites collaboration.\n\nOne of the most transformative aspects of NVC is its capacity to turn conflict into connection. When people in disagreement can identify and articulate their underlying needs, they often discover that their needs are not in opposition at all, only their chosen strategies are. This realization opens space for creative solutions that honor everyone's needs.\n\nNVC has broad applications across personal relationships, parenting, workplace dynamics, education, mediation, and social justice work. It is practiced in over sixty countries and has been used in conflict resolution contexts ranging from intimate partnerships to post-conflict reconciliation in regions affected by violence. The practice requires genuine self-awareness and a willingness to be vulnerable, making it both simple in concept and deeply challenging in practice.",
    "tags": [
        "communication",
        "relationships",
        "empathy",
        "conflict-resolution"
    ],
    "category": "Communication",
    "icon": "FaDove",
    "featured": false,
    "aliases": [
        "NVC",
        "Compassionate communication",
        "Giraffe language"
    ],
    "relatedConcepts": [
        "empathy",
        "active-listening",
        "emotional-intelligence",
        "assertiveness",
        "conflict-resolution"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Nonviolent Communication by Marshall Rosenberg",
            "url": "https://www.amazon.com/dp/189200528X?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Nonviolent communication - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Nonviolent_Communication",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-22",
    "dateModified": "2026-02-22"
}
