{
    "id": "note-making",
    "name": "Note-Making",
    "summary": "The active practice of creating original notes that synthesize and transform source material into personal understanding.",
    "explanation": "Note-making is the deliberate, active practice of creating original notes that transform source material into personal understanding. It stands in contrast to passive note-taking, where information is simply transcribed or copied from external sources without meaningful cognitive engagement.\n\nWhile note-taking captures information in its original form, note-making involves actively processing, rewriting, connecting, and synthesizing ideas in your own words. This distinction is crucial because the act of reformulation forces deeper cognitive engagement with the material, leading to better comprehension and longer-lasting retention.\n\nSönke Ahrens, in his influential book How to Take Smart Notes, emphasizes this distinction as central to the Zettelkasten method. In the Zettelkasten workflow, literature notes capture key ideas from sources, but the real intellectual work happens when creating permanent notes: rewriting ideas in your own words, connecting them to existing knowledge, and expressing how they relate to your thinking. This transformation from source material to personal knowledge is the essence of note-making.\n\nEffective note-making strategies include: elaboration (expanding on ideas by adding examples, implications, and questions), questioning (challenging assumptions and exploring why something matters), connecting (linking new ideas to existing knowledge and other notes), summarizing in your own words (forcing reformulation rather than copying), and arguing with the material (developing your own perspective in response to what you read).\n\nNote-making leads to deeper understanding and retention because it engages multiple cognitive processes: comprehension (you must understand to rewrite), evaluation (you decide what matters), synthesis (you connect to existing knowledge), and creation (you produce something new). This multi-layered engagement is far more effective for learning than the single-pass process of transcription that characterizes passive note-taking.\n\nThe shift from note-taking to note-making represents a fundamental change in how knowledge workers relate to information: from being consumers who collect to being creators who transform.",
    "tags": [
        "techniques",
        "note-taking",
        "knowledge-management",
        "learning"
    ],
    "category": "Techniques",
    "icon": "FaEdit",
    "featured": false,
    "aliases": [
        "Active note-taking",
        "Note creation",
        "Writing notes"
    ],
    "relatedConcepts": [
        "note-taking-vs-note-making",
        "smart-notes",
        "permanent-notes",
        "evergreen-notes",
        "elaboration",
        "knowledge-synthesis",
        "characteristics-of-good-notes",
        "rrr"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Personal Knowledge Management Library",
            "url": "https://store.dsebastien.net/product/pkm-library",
            "type": "other"
        },
        {
            "title": "Personal Knowledge Management Coaching",
            "url": "https://store.dsebastien.net/product/pkm-coaching",
            "type": "other"
        },
        {
            "title": "DeveloPassion's Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        },
        {
            "title": "Knowii Voice AI",
            "url": "https://voice-ai.knowii.net",
            "type": "other"
        }
    ],
    "tutorials": [],
    "books": [
        {
            "title": "How to Take Smart Notes by Sönke Ahrens",
            "url": "https://www.amazon.com/dp/3982438802?tag=dsebastien00-20"
        }
    ],
    "datePublished": "2026-02-22",
    "dateModified": "2026-02-22"
}
