{
    "id": "nudge-theory",
    "name": "Nudge Theory",
    "summary": "A behavioral science approach that subtly guides people toward better decisions by designing choice environments that make beneficial options easier to choose, without restricting freedom.",
    "explanation": "Nudge Theory is a concept in behavioral economics that proposes positive reinforcement and indirect suggestions as ways to influence the behavior and decision-making of groups or individuals. The theory was developed by economist Richard Thaler and legal scholar Cass Sunstein, popularized in their 2008 book 'Nudge: Improving Decisions About Health, Wealth, and Happiness.' Thaler received the Nobel Prize in Economics in 2017, partly for his contributions to this field.\n\nA nudge is any aspect of the choice architecture that predictably alters people's behavior without forbidding any options or significantly changing their economic incentives. To count as a nudge, the intervention must be easy and cheap to avoid. Nudges are not mandates; putting fruit at eye level in a cafeteria counts as a nudge, but banning junk food does not. This approach is sometimes called 'libertarian paternalism' because it aims to help people make better choices while preserving their freedom to choose otherwise.\n\nCommon examples of nudges include: setting retirement savings as the default option (requiring people to opt out rather than opt in), placing healthier foods at the front of cafeteria lines, sending reminders about upcoming appointments, using social norms messages ('most people in your area pay their taxes on time'), and simplifying complex forms to reduce friction. These interventions work because they leverage known cognitive biases and heuristics rather than fighting against them.\n\nNudge theory has been widely adopted in public policy, with many governments establishing 'nudge units' or behavioral insights teams. The UK's Behavioural Insights Team, established in 2010, was the first government institution dedicated to applying behavioral sciences to policy. Critics argue that nudges can be manipulative, that they may not produce lasting behavioral change, and that the same techniques can be used for harmful purposes (sometimes called 'dark nudges' or 'sludge'). Understanding nudge theory helps you recognize when you're being nudged and design your own environment to support better personal decisions.",
    "tags": [
        "psychology",
        "decision-making",
        "behavioral-economics",
        "mental-models",
        "policy"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaHandPointRight",
    "featured": false,
    "aliases": [
        "Nudging",
        "Nudge"
    ],
    "relatedConcepts": [
        "choice-architecture",
        "behavioral-economics",
        "default-effect",
        "status-quo-bias",
        "sludge"
    ],
    "relatedNotes": [
        "https://notes.dsebastien.net/30+Areas/33+Permanent+notes/33.02+Content/Nudge+theory"
    ],
    "articles": [],
    "books": [
        {
            "title": "Nudge by Richard Thaler and Cass Sunstein",
            "url": "https://www.amazon.com/dp/014311526X?tag=dsebastien00-20"
        },
        {
            "title": "Misbehaving by Richard Thaler",
            "url": "https://www.amazon.com/dp/0393352795?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Nudge theory - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Nudge_theory",
            "type": "website"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/l/knowii-clarity-101",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-28",
    "dateModified": "2026-01-28"
}
