{
    "id": "oblique-strategies",
    "name": "Oblique Strategies",
    "summary": "Card-based creative tool using lateral thinking prompts to break through blocks and find unexpected solutions.",
    "explanation": "Oblique Strategies is a card-based creative tool developed by Brian Eno and Peter Schmidt in 1975. Each card contains a cryptic constraint or instruction designed to help artists and problem-solvers break through creative blocks by approaching challenges from unexpected angles.\n\nThe cards include prompts like: \"Honor thy error as a hidden intention,\" \"What would your closest friend do?\" \"Remove ambiguities and convert to specifics,\" \"Use an old idea,\" and \"Work at a different speed.\" These prompts force lateral thinking by disrupting habitual thought patterns.\n\nHow to use Oblique Strategies: When stuck on a creative problem, draw a card randomly and apply its instruction to your situation. The prompt's ambiguity is intentional - you must interpret how it applies to your specific context. This interpretation process often reveals new perspectives.\n\nWhy Oblique Strategies work: They interrupt automatic thinking patterns, introduce random constraints that spark creativity, shift focus from the problem to a meta-level instruction, create psychological permission to try unconventional approaches, and leverage the power of arbitrary limitations to force innovation.\n\nThe tool exemplifies several creativity principles: constraints breed creativity (limitations force novel solutions), randomness can be productive (chance encounters generate insights), and oblique approaches often succeed where direct ones fail (lateral thinking bypasses mental blocks).\n\nOblique Strategies has been used by musicians like David Bowie, Coldplay, and Phoenix, but applies equally to writing, design, software development, and any creative endeavor where you're stuck.",
    "tags": [
        "creativity",
        "problem-solving",
        "lateral-thinking",
        "techniques"
    ],
    "category": "Techniques",
    "icon": "FaDice",
    "featured": false,
    "aliases": [
        "Eno's cards",
        "Creative constraints cards"
    ],
    "relatedConcepts": [
        "lateral-thinking",
        "divergent-thinking",
        "random-stimulus",
        "creative-resistance"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "A Year with Swollen Appendices by Brian Eno",
            "url": "https://www.amazon.com/dp/0571179959?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Oblique Strategies - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Oblique_Strategies",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-29",
    "dateModified": "2026-01-29"
}
