{
    "id": "observational-learning",
    "name": "Observational Learning",
    "summary": "Learning by watching and imitating the behavior of others, as described by Albert Bandura's social learning theory.",
    "explanation": "Observational learning is the process of acquiring new behaviors, skills, or knowledge by watching others. Pioneered by psychologist Albert Bandura in the 1960s through his famous Bobo doll experiments, it is a central component of social learning theory and explains how people learn without direct experience or reinforcement.\n\nBandura identified four key processes in observational learning. Attention: the learner must notice and focus on the model's behavior. Retention: the observed behavior must be remembered and stored in memory. Reproduction: the learner must be capable of reproducing the behavior. Motivation: there must be a reason to imitate — such as seeing the model rewarded (vicarious reinforcement) or punished (vicarious punishment).\n\nObservational learning extends far beyond simple imitation. It includes learning rules, strategies, and abstract principles by watching how others apply them. Children learn language, social norms, and emotional regulation largely through observation. Adults acquire professional skills, cultural practices, and problem-solving approaches by watching experts and peers.\n\nThe concept has profound implications for education, parenting, and workplace training. Modeling — deliberately demonstrating desired behaviors — is one of the most effective teaching strategies. Apprenticeship systems, mentoring relationships, and demonstration-based instruction all leverage observational learning. In the digital age, video tutorials and online courses extend observational learning beyond physical proximity.\n\nObservational learning also explains the acquisition of undesirable behaviors. Exposure to aggression, substance use, or antisocial behavior through media or social environments can lead to imitation, particularly when the model is perceived as attractive, powerful, or rewarded for the behavior.",
    "tags": [
        "psychology",
        "learning",
        "behavior-change",
        "social-psychology"
    ],
    "category": "Learning & Education",
    "icon": "FaEye",
    "featured": false,
    "aliases": [
        "Social learning",
        "Modeling",
        "Vicarious learning",
        "Learning by observation"
    ],
    "relatedConcepts": [
        "mirror-neurons",
        "mirroring",
        "chameleon-effect",
        "learning-curve",
        "deliberate-practice"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Observational learning - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Observational_learning",
            "type": "website"
        },
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "DeveloPassion's Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-11",
    "dateModified": "2026-02-11"
}
