{
    "id": "one-true-proposition-affliction",
    "name": "One True Proposition Affliction",
    "summary": "Cognitive trap of believing there is only one correct answer or truth about complex matters, ignoring nuance and context.",
    "explanation": "The One True Proposition Affliction is the cognitive trap of believing that for any given question or domain, there exists exactly one correct answer that must be universally true. This manifests as: seeking 'the' answer rather than 'an' answer, dismissing valid alternatives because they contradict the chosen truth, and becoming intellectually rigid when evidence challenges the proposition.\n\nThis affliction appears across domains: in productivity (believing there's one perfect system), in philosophy (seeking the one true meaning of life), in business (the one right strategy), in relationships (the one soulmate), and in learning (the one correct interpretation). The sufferer confuses 'a truth' with 'the truth.'\n\nThe problem isn't seeking truth—it's the assumption of singularity. Complex domains typically have multiple valid frameworks, context-dependent answers, and truths that coexist without contradiction. What works for one person may not work for another. What's true at one scale may not be true at another.\n\nAntidotes include: epistemic humility (acknowledging the limits of knowledge), contextual thinking (asking 'true under what conditions?'), holding multiple models simultaneously, and recognizing that usefulness often matters more than universal truth. The Zen concept of Mu suggests some questions are based on false premises—the very framing assumes a singular answer exists.\n\nFor knowledge workers, this means: collecting multiple frameworks rather than seeking the one true system, accepting that different approaches work in different contexts, and being suspicious when anyone claims to have found 'the' answer to complex questions.",
    "tags": [
        "cognitive-biases",
        "thinking",
        "mental-models",
        "epistemology",
        "critical-thinking"
    ],
    "category": "Cognitive Biases",
    "icon": "FaBullseye",
    "featured": false,
    "aliases": [
        "Single truth fallacy",
        "One right answer trap",
        "Monistic thinking"
    ],
    "relatedConcepts": [
        "false-dichotomy",
        "all-or-nothing-thinking",
        "mu",
        "strong-opinions-loosely-held"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Epistemic humility - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Epistemic_humility",
            "type": "website"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/product/clarity-101",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-20",
    "dateModified": "2026-01-20"
}
