{
    "id": "openclawd",
    "name": "OpenClawd",
    "summary": "An open-source, self-hosted personal AI assistant that turns language models like Claude into proactive digital coworkers capable of executing actions across devices.",
    "explanation": "OpenClawd is an open-source, self-hosted personal AI assistant created by Peter Steinberger. It transforms powerful language models like Claude into proactive digital coworkers capable of executing meaningful actions across devices. The lobster-themed project runs entirely on your own hardware - Mac, PC, or Linux - without relying on external hosted services.\n\nThe project was originally named Clawdbot, hinting at its origins from Claude and Claude Code. After Anthropic cited trademark concerns, it was renamed to Moltbot (featuring 'Molty' the space lobster mascot), and later rebranded to OpenClawd to establish an independent identity.\n\nKey features include: self-hosted operation with full control over your hardware, multi-platform messaging through WhatsApp, Telegram, Slack, Discord, Signal, and iMessage, direct system access to filesystem, browser, email, calendar, and smart home devices, long-term memory that persists across sessions and learns preferences over time, voice support on compatible platforms, and multi-model support for Claude, OpenAI, and local models.\n\nOpenClawd operates by ingesting natural-language requests (text or screenshots) and autonomously executes tasks. It plans the approach, writes code using modern frameworks, executes and tests functionality, self-heals by debugging its own errors, and reports results back to you.\n\nCommon use cases include overnight coding supervision where agents fix bugs and open PRs while you sleep, automated daily briefings with summaries and task lists, expense tracking with automatic categorization, smart home orchestration through natural language, and cross-device workflow coordination.\n\nThe project gained viral popularity, crossing 60,000+ GitHub stars and becoming one of the fastest-growing open-source projects. Security experts recommend running it in a sandboxed environment due to its powerful system access capabilities.\n\nCompared to Claude Code, OpenClawd focuses on personal assistance and orchestration through messaging apps with persistent long-term memory and cross-device scope, while Claude Code is optimized for direct coding in repositories through terminal/CLI with session-based context.",
    "tags": [
        "ai",
        "automation",
        "tools"
    ],
    "category": "AI",
    "icon": "FaRobot",
    "featured": false,
    "aliases": [
        "Moltbot",
        "OpenClaw",
        "Clawdbot",
        "Clawd",
        "Molty"
    ],
    "relatedConcepts": [
        "ai-agent"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "OpenClawd Official Website",
            "url": "https://openclawd.com/",
            "type": "website"
        },
        {
            "title": "OpenClawd Documentation",
            "url": "https://docs.openclawd.com/",
            "type": "website"
        },
        {
            "title": "OpenClawd GitHub Repository",
            "url": "https://github.com/openclawd/openclawd",
            "type": "website"
        },
        {
            "title": "ClawHub Skills Library",
            "url": "https://clawhub.com",
            "type": "website"
        },
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Personal Knowledge Management Library",
            "url": "https://store.dsebastien.net/product/pkm-library",
            "type": "other"
        },
        {
            "title": "AI Ghostwriter Guide",
            "url": "https://store.dsebastien.net/product/ai-ghostwriter-guide",
            "type": "other"
        },
        {
            "title": "DeveloPassion's Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        },
        {
            "title": "Knowii Voice AI",
            "url": "https://voice-ai.knowii.net",
            "type": "other"
        },
        {
            "title": "AI Master Prompt Workshop",
            "url": "https://store.dsebastien.net/product/ai-master-prompt",
            "type": "other"
        },
        {
            "title": "Model Context Protocol (MCP) Workshop",
            "url": "https://store.dsebastien.net/product/model-context-protocol",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-30",
    "dateModified": "2026-01-30"
}
