{
  "id": "opening-strong",
  "name": "Opening Strong",
  "summary": "Starting content with an engaging hook that captures attention immediately and earns the right to the reader's time.",
  "explanation": "Opening strong is the practice of beginning any piece of content - articles, presentations, videos, emails - with something that immediately captures attention and creates a reason to continue. In a world of infinite content and limited attention, your opening determines whether anyone reads the rest.\n\nWhy openings matter disproportionately: readers decide within seconds whether to continue, the primacy effect means first impressions shape perception of everything that follows, and a weak opening wastes all the effort put into the rest of your content. You must earn the reader's attention before you can deliver value.\n\nTechniques for opening strong include: starting with a provocative statement or counterintuitive claim, opening with a compelling question, beginning in media res (in the middle of action), leading with a surprising statistic or fact, using a vivid anecdote or story, and making a bold promise about what the reader will gain.\n\nWhat to avoid in openings: throat-clearing ('In this article, I will discuss...'), excessive context before the hook, weak or vague statements, burying the lead, and anything that doesn't immediately signal value or intrigue.\n\nThe tension in opening strong: you need to hook attention without overpromising or using manipulative clickbait. The best openings create genuine curiosity that the content actually satisfies. They're honest previews of real value, not bait-and-switch tactics.\n\nFor knowledge workers and creators, opening strong applies to: blog posts and articles, email subject lines and opening lines, presentation introductions, video thumbnails and first seconds, meeting agendas, and documentation. Every piece of communication competes for attention - open strong or risk being ignored.",
  "tags": [
    "writing",
    "communications",
    "copywriting",
    "contents"
  ],
  "category": "Writing & Content Creation",
  "icon": "FaPlay",
  "featured": false,
  "aliases": [
    "Strong Opening",
    "Hook Writing",
    "Attention Grabber"
  ],
  "relatedConcepts": [
    "hook-context-main-points",
    "curiosity-gap",
    "primacy-effect",
    "aida-model",
    "rate-of-revelation"
  ],
  "relatedNotes": [],
  "articles": [],
  "references": [
    {
      "title": "Hook (music) - Wikipedia",
      "url": "https://en.wikipedia.org/wiki/Hook_(music)",
      "type": "website"
    },
    {
      "title": "AI Ghostwriter Guide",
      "url": "https://store.dsebastien.net/product/ai-ghostwriter-guide",
      "type": "other"
    },
    {
      "title": "Obsidian Starter Kit",
      "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
      "type": "other"
    },
    {
      "title": "Obsidian Starter Course",
      "url": "https://store.dsebastien.net/product/obsidian-starter-course",
      "type": "other"
    },
    {
      "title": "Knowledge Management for Beginners",
      "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
      "type": "other"
    },
    {
      "title": "Knowii Community",
      "url": "https://store.dsebastien.net/product/knowii-community",
      "type": "other"
    }
  ],
  "books": [],
  "tutorials": [],
  "datePublished": "2026-01-20",
  "dateModified": "2026-01-29"
}
