{
    "id": "open-access",
    "name": "Open Access",
    "summary": "The practice of making research and knowledge freely available to everyone without financial or legal barriers.",
    "explanation": "Open access is the principle and practice of providing unrestricted, free access to peer-reviewed research, educational materials, and knowledge resources. It challenges the traditional publishing model where scientific knowledge, often funded by public money, is locked behind expensive paywalls that limit who can read and build upon it.\n\nThe open access movement emerged from the recognition that restricting access to knowledge slows scientific progress and deepens inequality. When a researcher in a developing country cannot afford journal subscriptions, when a small-town doctor cannot access the latest medical research, or when a curious citizen cannot read publicly funded studies, the system fails to serve its purpose of advancing human knowledge.\n\nSeveral models of open access have developed over time. Gold open access means the publisher makes the article freely available immediately upon publication, often funded by article processing charges paid by authors or their institutions. Green open access allows authors to self-archive their manuscripts in institutional or subject repositories, sometimes after an embargo period. Diamond or platinum open access operates without charges to either authors or readers, typically funded by institutions, societies, or grants. Each model has tradeoffs involving cost, speed, and sustainability.\n\nPreprint servers have become a vital part of the open access ecosystem. Platforms like arXiv (physics, mathematics, computer science), bioRxiv (biology), and medRxiv (medicine) allow researchers to share their findings immediately, before peer review. This accelerates the dissemination of knowledge and enables rapid feedback, as demonstrated dramatically during the COVID-19 pandemic when preprints became essential for sharing urgent research.\n\nOpen educational resources (OER) extend the open access philosophy to teaching materials, textbooks, and course content. Licensed under Creative Commons or similar open licenses, these resources can be freely used, adapted, and redistributed. OER initiatives have the potential to dramatically reduce the cost of education and enable educators worldwide to build on each other's work.\n\nThe tension between traditional publishers and open access advocates remains a defining feature of the landscape. Major publishers generate substantial profits from subscription models, while researchers, librarians, and funding agencies increasingly push for open mandates. Many major research funders, including the National Institutes of Health, the European Research Council, and the Gates Foundation, now require that the research they fund be made openly available.\n\nOpen access democratizes knowledge by removing the financial barriers that determine who can participate in the creation and consumption of knowledge. It accelerates scientific progress by ensuring that discoveries reach the widest possible audience, enables interdisciplinary connections by making research visible across fields, and supports informed public discourse by giving citizens access to the evidence base underlying policy decisions.",
    "tags": [
        "knowledge-management",
        "research",
        "sharing",
        "education"
    ],
    "category": "Concepts",
    "icon": "FaUnlock",
    "featured": false,
    "aliases": [
        "OA",
        "Open science",
        "Open publishing"
    ],
    "relatedConcepts": [
        "knowledge-commons",
        "knowledge-sharing",
        "knowledge-asymmetry",
        "learning-in-public",
        "communities-of-practice"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Open access - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Open_access",
            "type": "website"
        },
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Personal Knowledge Management Library",
            "url": "https://store.dsebastien.net/product/pkm-library",
            "type": "other"
        },
        {
            "title": "Personal Knowledge Management Coaching",
            "url": "https://store.dsebastien.net/product/pkm-coaching",
            "type": "other"
        },
        {
            "title": "DeveloPassion's Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-22",
    "dateModified": "2026-02-22"
}
