{
    "id": "orthopraxy",
    "name": "Orthopraxy",
    "summary": "The emphasis on correct practice, action, and behavior rather than correct belief or doctrine, holding that what you do matters more than what you think or profess to believe.",
    "explanation": "Orthopraxy (from Greek 'ortho' meaning correct and 'praxis' meaning action or practice) is the emphasis on right action over right belief. It stands in contrast to **orthodoxy** (ortho + doxa, meaning correct belief), which emphasizes holding the right doctrines, opinions, or theological positions.\n\nIn religious contexts, orthopraxy manifests in traditions that prioritize ritual practice, ethical behavior, and community action over doctrinal agreement. Judaism, for example, has historically emphasized following the commandments (mitzvot) over theological consensus. Confucianism emphasizes proper conduct and relationships over metaphysical beliefs.\n\nThe concept extends far beyond religion:\n\n- **Philosophy**: The Stoics held that philosophy is a practice, not merely a set of beliefs. Marcus Aurelius' *Meditations* is a guide to action, not a treatise on theory.\n- **Personal development**: The principle that beliefs exist to guide actions, and if you aren't acting on your beliefs, you've missed the point of having them.\n- **Leadership**: Leaders are judged by what they do, not what they say they believe. Actions reveal true priorities.\n- **Ethics**: Moral character is demonstrated through behavior, not through professed values.\n\nDerek Sivers argues that orthopraxy resolves many religious and philosophical conflicts: if the emphasis is on practice rather than belief, then people with different and even contradictory beliefs can coexist peacefully as long as their practices align.\n\nThe practical application is straightforward: **stop debating what's true and start doing what's useful**. The value of a belief is measured by the actions it produces, not by its theoretical correctness.",
    "tags": ["philosophy", "religion", "ethics", "practices", "wisdom"],
    "category": "Philosophy & Wisdom",
    "icon": "FaCompass",
    "featured": false,
    "aliases": ["Right Practice", "Praxis Over Doctrine"],
    "relatedConcepts": ["pragmatism", "beliefs-as-tools", "stoicism", "values-and-beliefs"],
    "relatedNotes": [],
    "references": [
        {"title": "Orthopraxy - Wikipedia", "url": "https://en.wikipedia.org/wiki/Orthopraxy", "type": "website"},
        {"title": "Useful Not True by Derek Sivers", "url": "https://sive.rs/u", "type": "website"}
    ],
    "articles": [],
    "books": [],
    "tutorials": [],
    "datePublished": "2026-02-11",
    "dateModified": "2026-02-11"
}
