{
    "id": "outsourcing",
    "name": "Outsourcing",
    "summary": "Practice of delegating business functions to external providers to reduce costs or access specialized expertise.",
    "explanation": "Outsourcing is the business practice of hiring external parties to perform services or create goods that traditionally were performed in-house. Companies outsource to: reduce costs, access specialized expertise, focus on core competencies, increase flexibility, and manage risk. Common outsourced functions include IT, customer service, manufacturing, accounting, and HR. Outsourcing decisions should consider: cost savings vs. quality risks, strategic importance of the activity, coordination costs, and intellectual property concerns. The rise of global communication and standardized processes enabled offshoring (outsourcing to other countries) and business process outsourcing (BPO). Risks include: loss of control, quality issues, hidden costs, dependency on vendors, and loss of internal capabilities. The core competency framework suggests outsourcing non-core activities while protecting and developing strategic capabilities. For knowledge workers, understanding outsourcing helps evaluate which skills to develop internally vs. when to leverage external resources.",
    "tags": [
        "strategies",
        "businesses",
        "operations",
        "decisions"
    ],
    "category": "Business & Economics",
    "icon": "FaHandshake",
    "featured": false,
    "aliases": [
        "Business Process Outsourcing",
        "BPO",
        "Offshoring"
    ],
    "relatedConcepts": [
        "core-competencies",
        "value-chain",
        "competitive-advantage",
        "make-or-buy-decision",
        "specialization"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Outsourcing - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Outsourcing",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-03",
    "dateModified": "2026-02-03"
}
