{
    "id": "overconfidence-effect",
    "name": "Overconfidence Effect",
    "summary": "A cognitive bias where people's subjective confidence in their judgments is reliably greater than the objective accuracy of those judgments.",
    "explanation": "The overconfidence effect is one of the most robust and pervasive cognitive biases affecting human judgment and decision-making. Daniel Kahneman called it 'the most significant of the cognitive biases' in his book Thinking Fast and Slow. This bias causes people to systematically overestimate their knowledge, abilities, and the precision of their beliefs, leading to poor decisions in domains ranging from personal finance to medical diagnosis to business strategy.\n\nThe overconfidence effect manifests in three distinct forms. Overestimation occurs when people think they are better than they actually are at a particular task or that they have more control over outcomes than they really do. This form is especially prevalent in difficult tasks where failure is likely. Overplacement, sometimes called the 'better-than-average effect,' is the tendency to believe oneself superior to others. The classic example is Svenson's finding that 93% of American drivers rate themselves as better than the median driver, a statistical impossibility. Overprecision refers to excessive certainty in one's beliefs and knowledge. People who exhibit overprecision set confidence intervals that are far too narrow; they might claim to be 90% certain of an answer while actually being correct only 50% of the time.\n\nUnderstanding the overconfidence effect is crucial for improving decision quality. In experiments, clinical psychologists and students given more information about a case became more confident in their conclusions even though their accuracy did not improve. This illustrates how additional information can inflate confidence without enhancing judgment. Mitigating overconfidence requires deliberate effort: seeking disconfirming evidence, considering alternative viewpoints, calibrating predictions against actual outcomes, and maintaining intellectual humility. Awareness of this bias is particularly important in high-stakes domains like investing, medicine, law, and leadership where overconfident decisions can have severe consequences.",
    "tags": [
        "cognitive-biases",
        "psychology",
        "decision-making",
        "judgments"
    ],
    "category": "Cognitive Biases",
    "icon": "FaBrain",
    "featured": false,
    "aliases": [
        "Overconfidence Bias",
        "Miscalibration"
    ],
    "relatedConcepts": [
        "dunning-kruger-effect",
        "planning-fallacy",
        "optimism-bias",
        "confidence"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Overconfidence effect - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Overconfidence_effect",
            "type": "website"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/product/clarity-101",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-29",
    "dateModified": "2026-01-29"
}
