{
    "id": "panpsychism",
    "name": "Panpsychism",
    "summary": "The philosophical view that consciousness or mind-like qualities are a fundamental and ubiquitous feature of reality, present to some degree in all matter.",
    "explanation": "Panpsychism is the view that mentality or experience is a fundamental and pervasive feature of the natural world. Rather than consciousness being a rare phenomenon that emerges only in complex brains, panpsychism holds that some form of experience exists at every level of reality - from electrons to ecosystems.\n\n**Historical Roots:**\n\nPanpsychism has ancient origins, appearing in Greek philosophy (Thales, Plato's Timaeus), Eastern traditions (Vedanta, Buddhism), and Renaissance thought (Giordano Bruno, Spinoza). In the modern era, it was defended by William James, Alfred North Whitehead, and Bertrand Russell.\n\n**The Motivation:**\n\nPanpsychism responds to two deep puzzles. First, the Hard Problem of Consciousness: if matter is fundamentally non-experiential, how does experience ever arise? Emergence of consciousness from purely non-conscious matter seems either miraculous or inexplicable. Second, the combination problem works in reverse: if we start with consciousness as fundamental, we only need to explain how simple experiences combine into complex ones.\n\n**Modern Versions:**\n\n- **Constitutive panpsychism**: Macro-level consciousness is constituted by micro-level experience (as defended by Philip Goff and Galen Strawson)\n- **Cosmopsychism**: The universe as a whole has a single cosmic consciousness, and individual minds are derivative\n- **Integrated Information Theory (IIT)**: Giulio Tononi's scientific theory implies a form of panpsychism, as any system with integrated information has some degree of consciousness\n- **Russellian monism**: Physical science describes the structure of reality but not its intrinsic nature, which is experiential\n\n**The Combination Problem:**\n\nThe main challenge for panpsychism is explaining how micro-level experiences (of electrons, atoms) combine to form the rich, unified consciousness we experience. This 'combination problem' (William James) is considered the Hard Problem in reverse.",
    "tags": [
        "philosophies",
        "consciousness",
        "philosophy-of-mind",
        "metaphysics",
        "subjective-experience"
    ],
    "category": "Philosophy & Wisdom",
    "icon": "FaAtom",
    "featured": false,
    "aliases": [
        "Panexperientialism",
        "Universal Consciousness",
        "Russellian Monism"
    ],
    "relatedConcepts": [
        "consciousness",
        "qualia",
        "hard-problem-of-consciousness",
        "physicalism",
        "philosophy-of-mind",
        "mind-body-problem",
        "emergence"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Galileo's Error by Philip Goff",
            "url": "https://www.amazon.com/dp/0525564772?tag=dsebastien00-20"
        },
        {
            "title": "Consciousness and Fundamental Reality by Philip Goff",
            "url": "https://www.amazon.com/dp/0190677015?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Panpsychism - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Panpsychism",
            "type": "website"
        },
        {
            "title": "Panpsychism - Stanford Encyclopedia of Philosophy",
            "url": "https://plato.stanford.edu/entries/panpsychism/",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-28",
    "dateModified": "2026-02-28"
}
