{
    "id": "parallel-thinking",
    "name": "Parallel Thinking",
    "summary": "Edward de Bono's method where all participants think in the same direction simultaneously rather than taking adversarial positions.",
    "explanation": "Parallel thinking, developed by Edward de Bono, is a structured approach to group thinking where everyone explores the same direction at the same time, rather than adopting opposing positions and arguing against each other. Instead of adversarial debate where participants defend their own viewpoints, parallel thinking has the entire group focus collectively on one aspect of the problem before moving to the next.\n\nTraditional Western argumentative thinking, rooted in the Socratic method, works by thesis, antithesis, and synthesis. While this adversarial approach can sharpen arguments, it often generates more heat than light. Participants become invested in defending their positions rather than genuinely exploring the problem. Ego becomes entangled with ideas, making it difficult to change course even when better options emerge.\n\nParallel thinking addresses these limitations by separating the thinker from the thought. When everyone is thinking in the same direction simultaneously, there is no position to defend and no opponent to defeat. This creates psychological safety and allows ideas to be explored on their merits.\n\nThe most well-known implementation of parallel thinking is de Bono's Six Thinking Hats method, where each colored hat represents a different direction of thinking:\n\n- **White hat**: Focus on available data and information\n- **Red hat**: Express feelings and intuitions without justification\n- **Black hat**: Identify risks, dangers, and potential problems\n- **Yellow hat**: Explore benefits, value, and optimistic possibilities\n- **Green hat**: Generate creative ideas and alternatives\n- **Blue hat**: Manage the thinking process itself\n\nBy having everyone wear the same hat at the same time, the group moves through a structured exploration of the problem from multiple angles without descending into argument.\n\nThe benefits of parallel thinking for group collaboration include:\n\n- **Less ego involvement**: Since no one owns a position, there is no need to defend or attack, reducing interpersonal conflict.\n- **More comprehensive exploration**: The structured approach ensures that all aspects of a problem are considered, not just those that arise from debate.\n- **More ideas generated**: Without the pressure to critique, participants feel freer to contribute creative and unconventional ideas.\n- **Faster results**: Groups using parallel thinking often reach conclusions more efficiently because time is not spent on unproductive argument.\n\nPractical applications include meetings, brainstorming sessions, strategic planning, conflict resolution, and any situation where a group needs to think together productively. Parallel thinking transforms groups from collections of competing individuals into genuinely collaborative thinking teams.",
    "tags": [
        "thinking",
        "collaboration",
        "creativity",
        "group-dynamics"
    ],
    "category": "Thinking",
    "icon": "FaArrowsAlt",
    "featured": false,
    "aliases": [
        "Co-operative thinking",
        "De Bono parallel thinking"
    ],
    "relatedConcepts": [
        "six-thinking-hats",
        "lateral-thinking",
        "brainstorming",
        "divergent-thinking",
        "creative-thinking"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Parallel thinking - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Parallel_thinking",
            "type": "website"
        },
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/product/clarity-101",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-21",
    "dateModified": "2026-02-21"
}
