{
    "id": "passive-income",
    "name": "Passive Income",
    "summary": "Income generated with minimal ongoing time investment, decoupling earning from active labor.",
    "explanation": "Passive income is revenue that requires little to no ongoing effort to maintain once the initial work or investment is in place. It represents the key mechanism for breaking the time-money tradeoff — by building income streams that don't require proportional time, you can earn while sleeping, traveling, or working on other things.\n\n**Types of passive income**:\n\n- **Investment income**: Dividends, interest, rental income from real estate, and capital gains\n- **Digital products**: Online courses, ebooks, templates, software, and other products sold repeatedly from a single creation effort\n- **Content royalties**: Books, music, photography, and other creative works that generate ongoing royalties\n- **Business systems**: Businesses with automated operations or managed by others\n- **Licensing and franchising**: Allowing others to use your intellectual property or brand\n\n**The passive income spectrum**:\n\nTruly passive income is rare. Most passive income streams exist on a spectrum from mostly-passive to semi-active. Rental properties need maintenance, digital products need updates and marketing, and investments need monitoring. The key question is the ratio of income to ongoing time investment.\n\n**Building passive income**:\n\n- Requires significant upfront investment of time, money, or both\n- The creation phase is active and often intense — writing a book, building a course, saving enough to invest\n- Multiple small streams can add up to meaningful income\n- Compounding effects apply: reinvested returns and growing audiences amplify over time\n\n**Why it matters for freedom**:\n\n- Passive income is the primary path to financial independence and time freedom\n- Even partial passive income (covering 50% of expenses) dramatically shifts the time-money tradeoff\n- It provides a safety net that enables risk-taking — starting a business, changing careers, or taking sabbaticals\n- It converts past effort into ongoing value, aligning with the principle of time investment\n\n**Common pitfalls**:\n\n- Underestimating the upfront work required\n- Chasing passive income schemes that are actually poorly compensated active work\n- Neglecting the maintenance required to keep passive streams running\n- Putting all effort into one stream instead of diversifying",
    "tags": ["finances", "income", "time", "freedoms", "entrepreneurship"],
    "category": "Business & Economics",
    "icon": "FaCoins",
    "featured": false,
    "aliases": ["Residual income", "Portfolio income"],
    "relatedConcepts": ["financial-independence", "time-money-tradeoff", "time-freedom", "time-investment", "leverage", "compound-effect", "golden-handcuffs", "lifestyle-inflation", "solopreneurship", "productizing-yourself", "content-compounding"],
    "relatedNotes": [],
    "references": [
        {"title": "Passive income - Wikipedia", "url": "https://en.wikipedia.org/wiki/Passive_income", "type": "website"}
    ],
    "articles": [],
    "books": [],
    "tutorials": [],
    "datePublished": "2026-02-20",
    "dateModified": "2026-02-20"
}
