{
    "id": "passive-vocabulary",
    "name": "Passive Vocabulary",
    "summary": "Words one can recognize and understand but doesn't actively use in speech or writing.",
    "explanation": "Passive vocabulary (also called receptive vocabulary) refers to words a person recognizes and understands when reading or listening, but doesn't spontaneously use in their own speech or writing. This is the larger of the two vocabulary types—native speakers typically have a passive vocabulary 30-50% larger than their active vocabulary.\n\nThe passive-active gap exists because recognition and production are fundamentally different cognitive tasks. Recognition only requires matching input against stored patterns—a word just needs to 'feel familiar.' Production requires retrieving the word from memory, knowing its correct form, and using it appropriately in context. A child may understand the word 'melancholy' when reading but never think to use it when speaking.\n\nPassive vocabulary is valuable for comprehension. It allows you to read advanced texts, understand native speakers, and process complex ideas even when you couldn't express them yourself. However, relying solely on passive vocabulary creates a comprehension-production gap. You may feel fluent because you understand everything, but struggle to express yourself.\n\nTo convert passive vocabulary to active: (1) Practice retrieval—when you encounter a word, try to use it in a sentence before moving on. (2) Use spaced repetition systems that test production, not just recognition. (3) Engage in output-focused activities: writing, speaking, teaching. (4) Notice when you understand a word but wouldn't use it, and deliberately practice it. The goal isn't to make all passive vocabulary active—that's neither possible nor necessary—but to ensure important words make the transition.",
    "tags": [
        "language-learning",
        "learning",
        "memory",
        "vocabulary"
    ],
    "category": "Learning & Education",
    "icon": "FaBookReader",
    "featured": false,
    "aliases": [
        "Receptive Vocabulary",
        "Recognition Vocabulary"
    ],
    "relatedConcepts": [
        "active-vocabulary",
        "recognition-production-gap",
        "spaced-repetition"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Vocabulary - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Vocabulary",
            "type": "website"
        },
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "DeveloPassion's Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-30",
    "dateModified": "2026-01-30"
}
