{
    "id": "pay-what-you-want",
    "name": "Pay What You Want",
    "summary": "Pricing strategy where customers choose their own price, typically with a suggested minimum or average.",
    "explanation": "Pay What You Want (PWYW) lets buyers determine the price they pay, from zero to any amount they choose. The model relies on: customer goodwill and fairness norms, social pressure (especially with visible pricing), perceived value of the offering, and the seller's reputation and relationship with buyers.\n\nFamously used by Radiohead for their album 'In Rainbows' and by the Humble Bundle for games, PWYW works best with: digital products (zero marginal cost), existing audiences who feel connection to the creator, and when combined with suggested prices or social proof ('average payment: $15').\n\nPsychological factors heavily influence outcomes: guilt at paying zero, anchoring from suggested amounts, reciprocity for past value received, and identity signaling ('I support indie creators'). Adding a charity component often increases payments—the option to help others justifies paying more.\n\nRisks include: low average payments, attracting freeloaders, devaluing the offering, and unpredictable revenue. The model typically works better for established creators with loyal audiences than for newcomers building reputation.\n\nFor creators and knowledge workers, PWYW appears in: tipping jars on free content, 'name your price' ebooks, sliding-scale consulting, and community-supported models. It can be powerful for accessibility (everyone can access) while still capturing value from those willing to pay generously.",
    "tags": [
        "pricing",
        "strategies",
        "businesses",
        "psychology"
    ],
    "category": "Business & Economics",
    "icon": "FaTags",
    "featured": false,
    "aliases": [
        "PWYW",
        "Name your own price",
        "Voluntary pricing",
        "Sliding scale pricing"
    ],
    "relatedConcepts": [
        "pricing-strategies",
        "freemium",
        "reciprocity",
        "value-based-pricing"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Pay what you want - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Pay_what_you_want",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-20",
    "dateModified": "2026-01-20"
}
