{
    "id": "paying-it-forward",
    "name": "Paying It Forward",
    "summary": "The practice of responding to kindness by helping others rather than repaying the original helper.",
    "explanation": "Paying it forward is the practice of responding to kindness or help received by helping others rather than directly repaying the original benefactor. Instead of circular reciprocity (A helps B, B helps A), paying it forward creates chains of generosity (A helps B, B helps C, C helps D). The practice generates: network effects (kindness multiplies through chains), accessible reciprocity (anyone can participate), and cultural change (normalizing generosity). Research on 'upstream reciprocity' shows that people who receive help become more likely to help others, creating genuine ripple effects. Paying it forward addresses: situations where direct reciprocity isn't possible (the helper doesn't need help), power imbalances (junior people can't return senior favors equally), and anonymous giving (benefactor unknown). The practice is particularly powerful in mentorship - those mentored should mentor others rather than just thanking their mentors. For knowledge workers, paying it forward means: sharing knowledge you've received, helping newcomers the way you were helped, and responding to breaks you've received by giving others breaks.",
    "tags": [
        "reciprocity",
        "generosity",
        "kindness",
        "community",
        "social-impact"
    ],
    "category": "Concepts",
    "icon": "FaArrowRight",
    "featured": false,
    "aliases": [
        "Pay it forward",
        "Upstream reciprocity",
        "Generosity chains"
    ],
    "relatedConcepts": [
        "generalized-reciprocity",
        "generosity-principle",
        "mentorship",
        "random-acts-kindness",
        "community-building",
        "social-impact"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
