{
    "id": "penetration-pricing",
    "name": "Penetration Pricing",
    "summary": "Pricing strategy of setting low initial prices to rapidly gain market share and establish customer base.",
    "explanation": "Penetration pricing sets prices low—sometimes below cost—when entering a market, aiming to capture market share quickly before competitors can respond. The strategy bets that: initial losses will be recovered through volume and later price increases, early customers will become loyal, scale effects will reduce costs over time, and competitors will be deterred from entering.\n\nClassic examples include streaming services offering low introductory rates, software companies with aggressive free tiers, and retailers like Amazon initially prioritizing growth over profits. The strategy works best when: demand is price-elastic (customers respond strongly to price), scale economies exist, and network effects can lock in customers.\n\nRisks include: establishing price expectations that are hard to raise, attracting price-sensitive customers who churn when prices increase, starting price wars, and financial strain during the penetration phase. Some markets have seen 'penetration pricing prisoners'—companies that can never raise prices because competitors match any increase.\n\nFor creators and knowledge workers, penetration pricing might mean: launching courses at introductory prices to build testimonials and audience, offering generous free content to build email lists, or pricing consulting low initially to build reputation. The key decision is when and how to raise prices—having a clear path from penetration to sustainable pricing is essential.",
    "tags": [
        "pricing",
        "strategies",
        "businesses",
        "marketing"
    ],
    "category": "Business & Economics",
    "icon": "FaTags",
    "featured": false,
    "aliases": [
        "Market penetration pricing",
        "Low-price entry strategy"
    ],
    "relatedConcepts": [
        "pricing-strategies",
        "price-skimming",
        "loss-leader"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Penetration pricing - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Penetration_pricing",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-20",
    "dateModified": "2026-01-20"
}
