{
    "id": "performative-activism",
    "name": "Performative Activism",
    "summary": "Activism done primarily for social appearance and personal branding rather than genuine commitment to change.",
    "explanation": "Performative activism describes actions taken to signal support for a cause that are motivated primarily by the desire to appear virtuous, gain social approval, or protect one's reputation, rather than by genuine commitment to creating change. The emphasis is on the performance of caring rather than the substance of action.\n\n**How It Manifests**:\n\n- **Corporate activism**: Companies releasing statements of solidarity without changing internal practices\n- **Social media solidarity**: Posting black squares, ribbons, or hashtags without follow-through\n- **Ally theater**: Publicly declaring allyship while privately maintaining harmful behaviors\n- **Donation signaling**: Making visible charitable contributions while opposing systemic change\n\n**Why It Happens**:\n\n1. **Social pressure**: Fear of being called out for silence creates pressure to say something\n2. **Low-cost signaling**: Public statements cost nothing but earn social capital\n3. **In-group conformity**: Desire to align with one's social group's expressed values\n4. **Self-image maintenance**: Need to see oneself as a good person without the hard work\n\n**The Harm of Performative Activism**:\n\nPerformative activism can be counterproductive because it creates the appearance that action is being taken, reducing urgency for real change. It can center the privileged person's feelings rather than the affected community's needs. It can also dilute movements by filling them with uncommitted participants.\n\n**Moving Beyond Performance**:\n\n- Educate yourself privately before speaking publicly\n- Listen to and amplify affected voices rather than centering your own\n- Take concrete, sustained action beyond one-time gestures\n- Accept discomfort and be willing to sacrifice convenience or status\n- Measure impact by outcomes, not by the visibility of your support\n\nRecognizing the difference between performative and substantive activism helps direct energy toward actions that create genuine change.",
    "tags": [
        "social-psychology",
        "ethics",
        "behaviors",
        "activism",
        "social-media"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaTheaterMasks",
    "featured": false,
    "aliases": [
        "Performative allyship",
        "Optical allyship"
    ],
    "relatedConcepts": [
        "virtue-signaling",
        "slacktivism",
        "moral-licensing",
        "signaling",
        "innovation-theater"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Performative activism - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Performative_activism",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-20",
    "dateModified": "2026-02-20"
}
