{
    "id": "perma-model",
    "name": "PERMA Model",
    "summary": "Martin Seligman's framework for well-being based on five pillars: Positive emotions, Engagement, Relationships, Meaning, and Accomplishment.",
    "explanation": "The PERMA model is a well-being framework developed by Martin Seligman, the founder of positive psychology. It identifies five core elements that contribute to human flourishing and provides a comprehensive approach to understanding what makes life worth living.\n\nThe five pillars of PERMA are:\n\n**Positive Emotions (P)**: Experiencing feelings like joy, gratitude, hope, and contentment. While happiness matters, this pillar encompasses the full range of positive emotional experiences that contribute to well-being.\n\n**Engagement (E)**: Being fully absorbed in activities that challenge and interest you. This relates to the concept of flow - those moments when you're so immersed in what you're doing that time seems to stop.\n\n**Relationships (R)**: Having meaningful connections with others. Humans are inherently social beings, and positive relationships with family, friends, colleagues, and community are essential for well-being.\n\n**Meaning (M)**: Having a sense of purpose and belonging to something larger than yourself. This could come from religion, family, community, causes, or work that feels meaningful.\n\n**Accomplishment (A)**: Pursuing achievement and mastery for their own sake. The drive to accomplish goals and develop competence contributes to well-being independent of any external rewards.\n\nWhat makes PERMA powerful is that these elements are both ends in themselves and measurable. Unlike earlier definitions of well-being that focused solely on life satisfaction, PERMA provides a multidimensional view that captures different aspects of what it means to thrive. Each element can be pursued independently, and together they provide a framework for building a flourishing life.",
    "tags": [
        "positive-psychology",
        "well-being",
        "frameworks",
        "happiness",
        "flourishing",
        "psychology"
    ],
    "category": "Frameworks",
    "icon": "FaLayerGroup",
    "featured": false,
    "aliases": [
        "PERMA",
        "PERMA Theory",
        "PERMA Framework",
        "Seligman's PERMA"
    ],
    "relatedConcepts": [
        "positive-psychology",
        "eudaimonia",
        "flow-state",
        "positive-emotions",
        "meaningful-pursuits",
        "character-strengths",
        "subjective-wellbeing"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Flourish by Martin Seligman",
            "url": "https://www.amazon.com/dp/1439190763?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "PERMA Model - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Martin_Seligman#PERMA",
            "type": "website"
        },
        {
            "title": "Authentic Happiness - University of Pennsylvania",
            "url": "https://www.authentichappiness.sas.upenn.edu/",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-15",
    "dateModified": "2026-01-15"
}
