{
    "id": "phenomenology",
    "name": "Phenomenology",
    "summary": "The philosophical study of the structures of subjective experience and consciousness as lived from the first-person perspective.",
    "explanation": "Phenomenology is a philosophical tradition founded by Edmund Husserl in the early 20th century that studies the structures of experience and consciousness. Its central insight is that consciousness is always consciousness *of* something - it is intentional, directed toward objects and the world. Rather than explaining experience in terms of brain states or behavior, phenomenology seeks to describe experience as it is lived.\n\n**Husserl's Foundations:**\n\nHusserl developed phenomenology as a rigorous method for investigating consciousness. His key innovations include the phenomenological reduction (epoche) - suspending our natural assumption that the world exists independently of experience, in order to focus on how things appear to consciousness. This is not skepticism about the external world, but a methodological tool for studying the structures of experience itself.\n\n**Key Figures and Developments:**\n\n- **Martin Heidegger**: Shifted phenomenology from consciousness to Being (Dasein). His existential phenomenology asks not 'what is consciousness?' but 'what is it to exist as the kind of being we are?'\n- **Maurice Merleau-Ponty**: Emphasized embodied perception. We understand the world not primarily through abstract thought but through our bodily engagement with it\n- **Jean-Paul Sartre**: Applied phenomenology to freedom, choice, and the relationship between self and others\n- **Emmanuel Levinas**: Developed a phenomenology of ethics and the encounter with the Other\n\n**Core Concepts:**\n\n- **Intentionality**: Consciousness is always directed toward something\n- **Lifeworld (Lebenswelt)**: The pre-theoretical world of everyday experience\n- **Intersubjectivity**: How we experience other minds and build shared meaning\n- **Temporality**: How consciousness constitutes the experience of time\n\n**Contemporary Relevance:**\n\nPhenomenology has influenced cognitive science (embodied cognition, enactivism), psychology (qualitative research methods), design (user experience), and AI research (understanding what genuine understanding requires). It offers tools for investigating subjective experience that complement third-person scientific methods.",
    "tags": [
        "philosophies",
        "consciousness",
        "philosophy-of-mind",
        "subjective-experience",
        "phenomenology"
    ],
    "category": "Philosophy & Wisdom",
    "icon": "FaBrain",
    "featured": false,
    "aliases": [
        "Phenomenological Method",
        "Husserlian Phenomenology"
    ],
    "relatedConcepts": [
        "consciousness",
        "qualia",
        "intentionality",
        "epoche",
        "philosophy-of-mind",
        "introspection"
    ],
    "relatedNotes": [
        "https://notes.dsebastien.net/30+Areas/33+Permanent+notes/33.02+Content/Phenomenology"
    ],
    "articles": [],
    "books": [
        {
            "title": "Phenomenology of Perception by Maurice Merleau-Ponty",
            "url": "https://www.amazon.com/dp/0415278414?tag=dsebastien00-20"
        },
        {
            "title": "Introduction to Phenomenology by Robert Sokolowski",
            "url": "https://www.amazon.com/dp/0521667925?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Phenomenology (philosophy) - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Phenomenology_(philosophy)",
            "type": "website"
        },
        {
            "title": "Phenomenology - Stanford Encyclopedia of Philosophy",
            "url": "https://plato.stanford.edu/entries/phenomenology/",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-28",
    "dateModified": "2026-02-28"
}
