{
    "id": "philosophical-zombies",
    "name": "Philosophical Zombies",
    "summary": "Hypothetical beings physically and behaviorally identical to conscious humans but entirely lacking subjective experience, used to argue that consciousness is non-physical.",
    "explanation": "Philosophical zombies (or p-zombies) are a thought experiment in philosophy of mind. A p-zombie is a hypothetical creature that is physically identical to a normal human being in every way - same atoms, same brain states, same behavior - but has no conscious experience whatsoever. There is nothing it is like to be a p-zombie. When it sees red, no subjective redness occurs; when it stubs its toe, it recoils and says 'ouch' but feels nothing.\n\n**The Zombie Argument:**\n\nDavid Chalmers formalized the zombie argument against physicalism:\n\n1. P-zombies are conceivable (we can coherently imagine them)\n2. If they are conceivable, they are metaphysically possible\n3. If they are possible, then consciousness is not entailed by the physical facts\n4. Therefore, physicalism is false\n\nThe argument's power lies in the gap between physical structure and subjective experience. If all physical facts could exist without consciousness, then consciousness must be something over and above the physical.\n\n**Objections:**\n\n- **Inconceivability reply**: P-zombies are not actually conceivable once we fully understand consciousness. Conceivability does not entail possibility\n- **Dennett's response**: The very idea of a p-zombie is incoherent - if something is functionally identical to a conscious being, it is conscious. We confuse our intuitions about consciousness with facts about it\n- **Type-B physicalism**: Consciousness is necessarily physical even though we cannot see this a priori, similar to how water is necessarily H2O\n\nThe zombie argument remains central to debates about consciousness, AI sentience, and the nature of subjective experience. If p-zombies are possible, then building a physically perfect replica of a brain would not guarantee creating consciousness.",
    "tags": [
        "philosophies",
        "consciousness",
        "philosophy-of-mind",
        "thought-experiments",
        "subjective-experience"
    ],
    "category": "Philosophy & Wisdom",
    "icon": "FaBrain",
    "featured": false,
    "aliases": [
        "P-Zombies",
        "Zombie Argument",
        "Chalmers' Zombie Argument"
    ],
    "relatedConcepts": [
        "qualia",
        "hard-problem-of-consciousness",
        "consciousness",
        "physicalism",
        "marys-room",
        "philosophy-of-mind"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "The Conscious Mind by David Chalmers",
            "url": "https://www.amazon.com/dp/0195117891?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Philosophical Zombie - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Philosophical_zombie",
            "type": "website"
        },
        {
            "title": "Zombies - Stanford Encyclopedia of Philosophy",
            "url": "https://plato.stanford.edu/entries/zombies/",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-28",
    "dateModified": "2026-02-28"
}
