{
  "id": "philosophy-of-mind",
  "name": "Philosophy of Mind",
  "summary": "The branch of philosophy that studies the nature of the mind, mental events, consciousness, and their relationship to the physical body.",
  "explanation": "Philosophy of mind examines fundamental questions about the nature of mental phenomena: What is the relationship between mind and body? Can mental states be explained in physical terms? What is consciousness and can it be scientifically explained?\n\nThe field addresses several central problems. The mind-body problem asks how mental and physical realms interact. The hard problem of consciousness, coined by David Chalmers, questions why there is subjective experience at all. Other key problems include intentionality (how mental states can be about things), mental causation (how thoughts cause physical actions), and personal identity (what makes you the same person over time).\n\nMajor philosophical positions range from dualism (mind and body are distinct substances, as proposed by Descartes) to various forms of physicalism (everything is ultimately physical). Identity theory equates mental states with brain states, while behaviorism identifies mental states with behavioral dispositions. Functionalism, developed by Hilary Putnam and Jerry Fodor, defines mental states by their functional roles rather than physical composition, which deeply influenced AI and cognitive science by suggesting that the same mental state could be realized in different substrates.\n\nFamous thought experiments illuminate these debates: John Searle's Chinese Room challenges whether computers can truly understand; Frank Jackson's Mary's Room explores whether physical knowledge differs from experiential knowledge; and Chalmers' zombie argument suggests consciousness isn't logically entailed by physical facts.\n\nContemporary debates focus on machine consciousness, integrated information theory (Giulio Tononi), global workspace theory (Bernard Baars), and predictive processing models of the mind.",
  "tags": ["philosophy", "consciousness", "cognition", "mind-body-problem", "dualism", "functionalism"],
  "category": "Philosophy & Wisdom",
  "icon": "FaBrain",
  "featured": false,
  "aliases": ["Philosophy of Mind"],
  "relatedConcepts": ["consciousness", "cognitive-science", "theory-of-mind", "chinese-room-argument", "two-system-thinking", "extended-mind-thesis"],
  "relatedNotes": ["https://notes.dsebastien.net/30+Areas/33+Permanent+notes/33.02+Content/Philosophy+of+Mind"],
  "articles": [],
  "books": [
    {
      "title": "The Conscious Mind by David Chalmers",
      "url": "https://www.amazon.com/dp/0195117891?tag=dsebastien00-20"
    },
    {
      "title": "Consciousness Explained by Daniel Dennett",
      "url": "https://www.amazon.com/dp/0316180661?tag=dsebastien00-20"
    },
    {
      "title": "Philosophy of Mind by Jaegwon Kim",
      "url": "https://www.amazon.com/dp/0813344581?tag=dsebastien00-20"
    }
  ],
  "references": [
    {
      "title": "Philosophy of Mind - Wikipedia",
      "url": "https://en.wikipedia.org/wiki/Philosophy_of_mind",
      "type": "website"
    },
    {
      "title": "Philosophy of Mind - Stanford Encyclopedia of Philosophy",
      "url": "https://plato.stanford.edu/entries/mind-identity/",
      "type": "website"
    }
  ],
  "tutorials": [],
  "datePublished": "2026-01-28",
  "dateModified": "2026-01-28"
}
