{
    "id": "physicalism",
    "name": "Physicalism",
    "summary": "The philosophical position that everything that exists is physical or supervenes on the physical, and that all facts are ultimately physical facts.",
    "explanation": "Physicalism (also called materialism) is the philosophical thesis that everything is physical - that there is 'nothing over and above' the physical. All mental states, consciousness, and subjective experiences are ultimately physical phenomena. This is the dominant view in contemporary philosophy of mind and provides the implicit framework for most neuroscience and cognitive science.\n\n**Core Varieties:**\n\n- **Identity theory**: Mental states are literally identical to brain states. Pain just *is* C-fiber firing - not correlated with it, not caused by it, but identical to it\n- **Functionalism**: Mental states are defined by their causal roles. What makes something a pain is not its physical composition but what it does - it is caused by tissue damage, causes avoidance behavior, etc.\n- **Eliminative materialism**: Our common-sense mental vocabulary (beliefs, desires, feelings) is a folk theory that will be replaced by mature neuroscience. There are no 'beliefs' - only neural activation patterns\n- **Non-reductive physicalism**: Mental properties are real and not reducible to physical properties, but they supervene on (are determined by) physical properties\n\n**Challenges to Physicalism:**\n\nThe main challenges come from consciousness. The Hard Problem (Chalmers) asks why physical processes give rise to subjective experience. The Knowledge Argument (Mary's Room) suggests physical knowledge is incomplete. The Zombie Argument claims physically identical beings without consciousness are conceivable, implying consciousness is non-physical.\n\n**Physicalist Responses:**\n\n- These thought experiments rely on flawed intuitions about consciousness\n- Conceivability does not entail metaphysical possibility\n- The 'explanatory gap' between brain and experience is an epistemic limitation, not an ontological one\n- New physics may reveal aspects of matter that explain consciousness\n\nPhysicalism matters practically for AI ethics (if consciousness is physical, machines could be conscious), neuroscience methodology (studying the brain should eventually explain the mind), and medicine (mental illness has physical causes and treatments).",
    "tags": [
        "philosophies",
        "consciousness",
        "philosophy-of-mind",
        "metaphysics",
        "materialism"
    ],
    "category": "Philosophy & Wisdom",
    "icon": "FaAtom",
    "featured": false,
    "aliases": [
        "Materialism",
        "Physical Monism",
        "Materialist Worldview"
    ],
    "relatedConcepts": [
        "consciousness",
        "hard-problem-of-consciousness",
        "qualia",
        "mind-body-problem",
        "reductionism",
        "emergence",
        "functionalism",
        "philosophy-of-mind"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Physicalism, or Something Near Enough by Jaegwon Kim",
            "url": "https://www.amazon.com/dp/0691133859?tag=dsebastien00-20"
        },
        {
            "title": "Consciousness Explained by Daniel Dennett",
            "url": "https://www.amazon.com/dp/0316180661?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Physicalism - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Physicalism",
            "type": "website"
        },
        {
            "title": "Physicalism - Stanford Encyclopedia of Philosophy",
            "url": "https://plato.stanford.edu/entries/physicalism/",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-28",
    "dateModified": "2026-02-28"
}
