{
    "id": "pivoting",
    "name": "Pivoting",
    "summary": "Strategic shift in business model, product, or target market based on market feedback and learning.",
    "explanation": "A pivot is a structured course correction designed to test a new fundamental hypothesis about product, strategy, or growth engine. The term, popularized by Eric Ries in 'The Lean Startup,' distinguishes between changing direction (pivoting) and persevering on the current path. A pivot is not failure—it's a learning-driven strategic shift.\n\nCommon pivot types include: zoom-in pivot (one feature becomes the whole product), zoom-out pivot (product becomes one feature of something larger), customer segment pivot (same product, different customers), customer need pivot (same customers, different problem), platform pivot (application to platform or vice versa), business model pivot (changing how you capture value), channel pivot (new distribution method), and technology pivot (new technical approach to same solution).\n\nThe decision to pivot should be data-driven, not emotional. Signals that suggest pivoting: metrics aren't improving despite iterations, customer feedback consistently points elsewhere, unit economics don't work, or you've found an adjacent opportunity with better potential. The danger is pivoting too early (before learning enough) or too late (after burning resources on a dead end).\n\nFor creators and indie hackers, pivoting means staying responsive to what the market actually wants rather than what you assumed it wanted. Instagram pivoted from Burbn (check-in app) to photo sharing. Slack pivoted from a game company's internal tool. Twitter pivoted from podcast discovery. The original idea often isn't the final one—and that's okay.",
    "tags": [
        "entrepreneurship",
        "startups",
        "strategies",
        "product-development",
        "decision-making"
    ],
    "category": "Business & Economics",
    "icon": "FaExchangeAlt",
    "featured": false,
    "aliases": [
        "Business pivot",
        "Startup pivot",
        "Strategic pivot"
    ],
    "relatedConcepts": [
        "minimum-viable-product",
        "product-market-fit",
        "fail-fast",
        "shotgun-to-sniper-strategy",
        "sunk-cost-fallacy"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "The Lean Startup by Eric Ries",
            "url": "https://www.amazon.com/dp/0307887898?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Lean startup - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Lean_startup",
            "type": "website"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/product/clarity-101",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-20",
    "dateModified": "2026-01-29"
}
