{
    "id": "price-skimming",
    "name": "Price Skimming",
    "summary": "Pricing strategy of setting high initial prices and gradually lowering them over time to capture different market segments.",
    "explanation": "Price skimming starts with high prices to 'skim' maximum revenue from customers willing to pay premium, then progressively lowers prices to capture more price-sensitive segments. The strategy extracts maximum value from each customer segment over time, following the demand curve downward.\n\nThe strategy works best when: you have a genuinely innovative product with temporary monopoly, early adopters are price-insensitive, high initial prices signal quality, and production can scale to meet broader demand later. Classic examples include new technology products (smartphones, gaming consoles), pharmaceutical drugs, and fashion items.\n\nBenefits include: recovering R&D costs quickly from willing buyers, signaling quality through high prices, and having 'room' to lower prices if competition emerges. Risks include: inviting competitors who see high margins, alienating early customers when prices drop, and slow initial adoption limiting network effects.\n\nFor creators and knowledge workers, price skimming appears in: launching premium courses to committed buyers before creating affordable versions, offering exclusive high-priced coaching before group programs, or selling hardcover before paperback. The strategy pairs well with exclusivity and scarcity—early buyers get access, prestige, or bonuses that justify the premium.",
    "tags": [
        "pricing",
        "strategies",
        "businesses",
        "marketing"
    ],
    "category": "Business & Economics",
    "icon": "FaTags",
    "featured": false,
    "aliases": [
        "Skim pricing",
        "High-low pricing",
        "Market skimming"
    ],
    "relatedConcepts": [
        "pricing-strategies",
        "penetration-pricing",
        "product-launch"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Price skimming - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Price_skimming",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-20",
    "dateModified": "2026-01-20"
}
