{
    "id": "price-discrimination",
    "name": "Price Discrimination",
    "summary": "Economic practice of charging different prices to different customers for the same product based on willingness to pay.",
    "explanation": "Price discrimination is the strategy of selling identical or similar products at different prices to different buyers, not based on cost differences but on customers' varying willingness to pay. Economists identify three degrees: first-degree (perfect) charges each customer their maximum willingness to pay—rare but approximated by negotiations and auctions; second-degree offers different prices based on quantity or version purchased—think bulk discounts or software tiers; third-degree segments markets by observable characteristics like student discounts, geographic pricing, or time-based pricing (matinee movies).\n\nFor price discrimination to work, sellers need: market power (ability to set prices), ability to segment customers, and prevention of arbitrage (customers can't resell). Digital products excel at this—the same course can be sold at different prices in different countries with minimal arbitrage risk.\n\nEthical considerations matter. While economists view it as efficient (captures more value, can serve price-sensitive customers who'd otherwise be excluded), customers often perceive it as unfair when discovered. Transparency about why prices differ (student discount vs. 'they'll pay more') affects perception.\n\nFor creators and knowledge workers, price discrimination appears in: regional pricing (lower prices for emerging markets), time-based pricing (early bird vs. regular), loyalty discounts, and tiered offerings. The key is implementing it in ways customers perceive as fair—rewarding loyalty or making products accessible, rather than exploiting willingness to pay.",
    "tags": [
        "pricing",
        "economics",
        "businesses",
        "strategies"
    ],
    "category": "Business & Economics",
    "icon": "FaTags",
    "featured": false,
    "aliases": [
        "Differential pricing",
        "Price differentiation",
        "Dynamic pricing"
    ],
    "relatedConcepts": [
        "tiered-pricing",
        "pricing-strategies",
        "price-elasticity",
        "value-based-pricing"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Price discrimination - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Price_discrimination",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-20",
    "dateModified": "2026-01-20"
}
