{
    "id": "principle-of-charity",
    "name": "Principle of Charity",
    "summary": "The practice of interpreting someone's argument in the strongest and most reasonable way before critiquing it.",
    "explanation": "The Principle of Charity is a methodological principle in philosophy and critical thinking that instructs you to interpret others' statements and arguments in the most rational, reasonable, and favorable way possible before evaluating or critiquing them. When an argument can be read multiple ways, choose the interpretation that makes it strongest.\n\n## Why it matters\n\nWithout charitable interpretation, debate degenerates into attacking the weakest possible reading of what someone said—a straw man. The principle of charity elevates discourse by ensuring you engage with what people actually mean, not the easiest version to dismiss.\n\n## How it works\n\n1. **Assume competence**: Start by assuming the other person has thought about their position and has reasons for it\n2. **Choose the stronger reading**: When a statement is ambiguous, interpret it in the way that makes the most sense\n3. **Fill in gaps generously**: If an argument has unstated premises, supply the most reasonable ones\n4. **Separate expression from intent**: Poor articulation doesn't mean poor thinking\n5. **Then critique**: Only after constructing the strongest version of the argument should you identify its weaknesses\n\n## Relationship to steelmanning\n\nThe principle of charity is the foundation upon which steelmanning builds. Charity says: interpret what was said in the best light. Steelmanning goes further: actively strengthen the argument beyond what was stated, constructing the most powerful version possible before responding.\n\n## Benefits\n\n- **Better understanding**: you actually grasp what the other person means\n- **Stronger counter-arguments**: critiquing a strong interpretation is more intellectually honest and produces more robust rebuttals\n- **Productive dialogue**: others feel heard and are more willing to engage\n- **Self-correction**: engaging with the strongest version of opposing views may reveal weaknesses in your own position\n\n## Common violations\n\n- Nitpicking word choice rather than engaging with meaning\n- Taking statements out of context to make them seem absurd\n- Assuming bad faith or stupidity before considering other explanations\n- Pouncing on the weakest example while ignoring stronger points\n\n## Origins\n\nThe concept traces to philosopher Donald Davidson and has roots in hermeneutics (the theory of interpretation). Neil L. Wilson coined the term in 1959, and it became a cornerstone of analytic philosophy and critical thinking education.",
    "tags": [
        "critical-thinking",
        "philosophy",
        "communication",
        "reasoning",
        "intellectual-virtues"
    ],
    "category": "Philosophy & Wisdom",
    "icon": "FaHandshake",
    "featured": false,
    "aliases": [
        "Charitable interpretation",
        "Principle of rational accommodation"
    ],
    "relatedConcepts": [
        "steelmanning",
        "grey-thinking",
        "dialectical-thinking",
        "epistemic-humility",
        "hanlons-razor",
        "intellectual-honesty",
        "ideological-turing-test",
        "argumentation"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Principle of charity - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Principle_of_charity",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-25",
    "dateModified": "2026-02-25"
}
