{
    "id": "problem-agitate-solve",
    "name": "Problem-Agitate-Solve",
    "summary": "A three-step copywriting framework that identifies a problem, intensifies the emotional urgency around it, then presents a solution.",
    "explanation": "Problem-Agitate-Solve (PAS) is one of the most effective and widely-used copywriting frameworks in direct response marketing. It works by first identifying a specific problem the audience faces, then agitating that problem to create emotional urgency, and finally presenting a solution that addresses the pain point.\n\n**The Three Steps**\n\n*Problem*: The first step involves clearly identifying and articulating a problem that your target audience experiences. This establishes relevance and captures attention by showing you understand their situation. The problem should be specific, relatable, and genuinely felt by your audience. Generic problems create weak connections; specific problems create strong resonance.\n\n*Agitate*: This is where PAS distinguishes itself from simpler frameworks. Rather than jumping straight to the solution, you intensify the emotional impact of the problem. You explore the consequences of leaving the problem unsolved, paint vivid pictures of ongoing frustration, and help readers fully feel the weight of their situation. This step creates the emotional momentum that drives action.\n\n*Solve*: Only after the problem has been fully felt do you introduce your solution. By this point, the reader is emotionally primed and actively seeking relief. Your solution arrives as the answer they've been waiting for, making it far more compelling than if presented without the emotional buildup.\n\n**Why Agitation Works**\n\nThe agitation step leverages fundamental principles of human psychology. People are motivated more strongly by avoiding pain than by seeking pleasure—a phenomenon known as loss aversion. By helping readers fully experience their problem emotionally before presenting logic and solutions, PAS aligns with how humans actually make decisions: emotion first, rationalization second. The agitation creates cognitive dissonance that the solution then resolves.\n\n**Origins and History**\n\nPAS emerged from the direct response copywriting tradition, where measurable results drove the evolution of persuasion techniques. Legendary copywriters like Dan Kennedy, Gary Halbert, and Eugene Schwartz refined these principles through decades of testing. The framework proved especially powerful in long-form sales letters, where building emotional engagement before the pitch dramatically improved conversion rates.\n\n**Applications**\n\nPAS appears throughout modern marketing: sales pages that walk readers through their frustrations before revealing the product, email sequences that deepen problem awareness across multiple messages, landing pages that contrast current pain with potential relief, and even video scripts that follow the emotional arc from problem through solution. The framework scales from single paragraphs to entire marketing campaigns.\n\n**Ethical Considerations**\n\nEffective use of PAS requires ethical grounding. The framework should address real problems that your solution genuinely solves—not manufacture artificial fears or exaggerate minor inconveniences. Agitation should clarify existing pain, not create new anxieties. When used ethically, PAS serves readers by helping them fully understand their situation and recognize solutions they might otherwise overlook. Manipulation occurs when the problem is fabricated or the solution doesn't deliver on its promises.\n\n**Variations: PASO**\n\nSome practitioners extend PAS to PASO (Problem-Agitate-Solve-Outcome), adding a fourth step that paints a picture of life after the solution is implemented. This variation emphasizes transformation and helps readers envision their improved future state, adding positive motivation to complement the pain-avoidance dynamic.\n\n**When to Use PAS**\n\nPAS excels when your audience already experiences a known problem but may not feel sufficient urgency to act. It's particularly effective for solutions that address pain points rather than aspirational goals. For audiences unaware they have a problem, frameworks like AIDA (Attention-Interest-Desire-Action) may work better for initial awareness. For complex solutions requiring extensive education, longer frameworks may be needed. PAS works best when you can articulate a specific, felt problem and offer a clear solution that directly addresses it.",
    "tags": ["storytelling", "copywriting", "marketing", "persuasion", "frameworks"],
    "category": "Frameworks",
    "icon": "FaBullhorn",
    "featured": false,
    "aliases": ["PAS Formula", "PAS Framework", "Problem-Agitate-Solution"],
    "relatedConcepts": ["before-after-bridge", "abt-storytelling", "scqa-storytelling"],
    "relatedNotes": [],
    "references": [{"title": "PAS Formula - Copywriting", "url": "https://en.wikipedia.org/wiki/Copywriting", "type": "website"}],
    "articles": [],
    "books": [],
    "tutorials": [],
    "datePublished": "2026-01-19",
    "dateModified": "2026-01-19"
}
