{
    "id": "proprioception",
    "name": "Proprioception",
    "summary": "The sense of body position and movement in space, enabling coordination and awareness without visual input.",
    "explanation": "Proprioception is often called the \"sixth sense\" - the ability to sense the position, location, orientation, and movement of your body and its parts without relying on vision. It's what allows you to touch your nose with your eyes closed or walk without watching your feet.\n\nHow proprioception works: Specialized receptors called proprioceptors are located in muscles, tendons, and joints. They detect:\n- Muscle stretch and tension (muscle spindles)\n- Joint angle and position (joint receptors)\n- Tendon tension (Golgi tendon organs)\n\nThis information is continuously sent to the brain, creating an internal body map that updates in real-time.\n\nFunctions of proprioception:\n- Coordinated movement without visual monitoring\n- Balance and postural control\n- Sense of effort and force\n- Spatial awareness of body boundaries\n- Motor learning and skill acquisition\n\nProprioception and well-being:\n- Poor proprioception contributes to clumsiness and injury risk\n- Training proprioception improves athletic performance\n- Proprioceptive input is calming (heavy work, compression)\n- Body awareness practices (yoga, martial arts) enhance proprioception\n- Trauma can disrupt proprioceptive awareness\n\nRelated to interoception: While proprioception senses the musculoskeletal system (position/movement), interoception senses internal body states (hunger, heartbeat, emotions). Together they form body awareness.\n\nEnhancing proprioception: Balance exercises, yoga, tai chi, martial arts, dance, and activities performed with eyes closed all develop proprioceptive awareness.\n\nClinical relevance: Proprioceptive deficits occur in conditions like autism, ADHD, and after injury. Occupational therapy often addresses proprioceptive processing.",
    "tags": [
        "neuroscience",
        "body",
        "perception",
        "movement",
        "health"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaRunning",
    "featured": false,
    "aliases": [
        "Body position sense",
        "Kinesthesia",
        "Position sense"
    ],
    "relatedConcepts": [
        "interoception",
        "embodied-cognition",
        "body-scan-meditation",
        "grounding"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "The Body Keeps the Score by Bessel van der Kolk",
            "url": "https://www.amazon.com/dp/0143127748?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Proprioception - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Proprioception",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-29",
    "dateModified": "2026-01-29"
}
