{
    "id": "proportionality-bias",
    "name": "Proportionality Bias",
    "summary": "The tendency to assume that big events must have big causes, leading to the rejection of simple explanations for significant outcomes.",
    "explanation": "Proportionality bias, also known as the major event/major cause heuristic, is a cognitive tendency where people assume that the magnitude of an effect should match the magnitude of its cause. When something significant happens, we intuitively expect an equally significant explanation. As psychologist Rob Brotherton puts it, when something big happens, we tend to assume that something big must have caused it.\n\nThis bias emerges from our brain's natural pattern-seeking behavior and drive to find causality. Our cognitive systems develop schemas to process information efficiently, and equating cause-effect magnitudes reduces mental strain by maintaining a sense of order and logic. This satisfies deep psychological needs for certainty, control, and understanding. Research by Shultz and Ravinsky demonstrated that even young children exhibit this tendency, attributing loud noises to heavy objects rather than delicate ones.\n\nProportionality bias plays a significant role in the formation and persistence of conspiracy theories. When major events occur, such as the assassination of a president or the death of a beloved public figure, people often struggle to accept that mundane causes could be responsible. For instance, many found it difficult to believe that President Kennedy could be killed by a lone gunman, or that Princess Diana's death resulted from a simple car crash. Studies by Leman and Cinnirella found that participants were more likely to endorse conspiracy explanations when the consequences of an event were severe. The bias creates fertile ground for elaborate alternative explanations that feel proportionate to the significance of the outcome.\n\nUnderstanding proportionality bias helps develop critical thinking skills. Major historical events can indeed have relatively simple causes: a single mosquito carrying malaria, an overlooked O-ring on a space shuttle, or a single individual's decision. Recognizing this bias allows us to evaluate explanations based on evidence rather than intuitive expectations about cause-effect proportionality.",
    "tags": [
        "cognitive-biases",
        "psychology",
        "critical-thinking",
        "judgments",
        "conspiracy-theories"
    ],
    "category": "Cognitive Biases",
    "icon": "FaBrain",
    "featured": false,
    "aliases": [
        "Big Effects Need Big Causes Bias",
        "Major Event/Major Cause Heuristic"
    ],
    "relatedConcepts": [
        "hindsight-bias",
        "fundamental-attribution-error",
        "apophenia"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Proportionality bias - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Proportionality_bias",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-29",
    "dateModified": "2026-01-29"
}
