{
    "id": "prosopagnosia",
    "name": "Prosopagnosia",
    "summary": "A neurological condition characterized by the inability to recognize familiar faces despite having normal visual acuity.",
    "explanation": "Prosopagnosia, commonly known as face blindness, is a cognitive disorder of face perception in which the ability to recognize familiar faces, including one's own face, is impaired while other aspects of visual processing and intellectual functioning remain intact. The term comes from the Greek 'prosopon' (face) and 'agnosia' (lack of knowledge).\n\nThere are two main forms:\n\n- **Acquired prosopagnosia**: Results from brain damage, typically to the fusiform face area (FFA) or the occipital face area, often caused by stroke, traumatic brain injury, or neurodegeneration. Patients who previously had normal face recognition lose this ability.\n- **Developmental (congenital) prosopagnosia**: Present from birth without any apparent brain lesion. Estimated to affect approximately 2-2.5% of the population. People with this form have never developed normal face recognition abilities. It appears to have a genetic component and often runs in families.\n\nPeople with prosopagnosia develop compensatory strategies to recognize others: voice, gait, hairstyle, clothing, or contextual cues. They may struggle in social situations where people are out of context (meeting a colleague outside the office) or have changed their appearance.\n\nProsopagnosia is important for understanding face perception because it demonstrates that face recognition is a distinct cognitive module, separate from general object recognition. People with prosopagnosia can typically recognize objects, read text, and navigate visually; only face recognition is specifically impaired. This supports the existence of dedicated neural circuitry for face processing.\n\nThe condition also illustrates a broader principle: cognitive abilities that feel effortless and automatic (like recognizing faces) are in fact supported by sophisticated specialized processing. When that processing breaks down, we realize how much invisible work the brain was doing. This has implications for designing inclusive technology, understanding neurodiversity, and appreciating the complexity of perception.",
    "tags": [
        "cognitive-science",
        "neuroscience",
        "perception",
        "psychology"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaBrain",
    "featured": false,
    "aliases": [
        "Face Blindness",
        "Facial Agnosia"
    ],
    "relatedConcepts": [
        "face-perception",
        "holistic-processing",
        "thatcher-effect",
        "limbic-system",
        "pareidolia"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "The Man Who Mistook His Wife for a Hat by Oliver Sacks",
            "url": "https://www.amazon.com/dp/0684853949?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Prosopagnosia - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Prosopagnosia",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-08",
    "dateModified": "2026-02-08"
}
