{
    "id": "psychological-capital",
    "name": "Psychological Capital",
    "summary": "A positive psychological state comprising four resources: Hope, Efficacy, Resilience, and Optimism (HERO) that predict performance and well-being.",
    "explanation": "Psychological Capital (PsyCap) is a concept developed by organizational behavior researcher Fred Luthans that identifies four positive psychological resources that together predict performance, satisfaction, and well-being. These four resources form the acronym HERO:\n\n**Hope**: Having the willpower and pathway thinking to achieve goals. Hope involves both the determination to achieve desired outcomes (agency) and the ability to generate multiple routes to get there (pathways). Hopeful people don't just want success - they actively plan multiple ways to achieve it.\n\n**Efficacy (Self-Efficacy)**: Confidence in your ability to mobilize the motivation, cognitive resources, and actions needed to successfully execute a specific task. Self-efficacy comes from mastery experiences, vicarious learning, social persuasion, and managing physiological states.\n\n**Resilience**: The capacity to bounce back from adversity, conflict, failure, or even positive events like increased responsibility. Resilient people recover from setbacks, adapt to change, and can even grow stronger through challenges.\n\n**Optimism**: A positive attribution style that credits good events to personal, permanent, and pervasive causes while viewing bad events as temporary, specific, and external. This is realistic optimism, not blind positivity.\n\nWhat makes PsyCap powerful is that these four resources work synergistically - they're more impactful together than individually. Research consistently shows that higher PsyCap predicts better job performance, greater job satisfaction, stronger organizational commitment, and improved well-being.\n\nCrucially, PsyCap is state-like rather than trait-like, meaning it can be developed through targeted interventions. Organizations and individuals can invest in building these psychological resources through training, coaching, and creating supportive environments.",
    "tags": [
        "positive-psychology",
        "psychology",
        "organizational-behavior",
        "well-being",
        "resilience",
        "leadership"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaGem",
    "featured": false,
    "aliases": [
        "PsyCap",
        "HERO Model",
        "Positive Psychological Capital"
    ],
    "relatedConcepts": [
        "resilience",
        "self-efficacy",
        "learned-optimism",
        "positive-psychology",
        "growth-mindset",
        "positivity"
    ],
    "relatedNotes": [
        "https://notes.dsebastien.net/30+Areas/33+Permanent+notes/33.02+Content/HERO"
    ],
    "articles": [],
    "books": [
        {
            "title": "Psychological Capital by Luthans, Youssef & Avolio",
            "url": "https://www.amazon.com/dp/0195187520?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Psychological Capital - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Psychological_capital",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-15",
    "dateModified": "2026-01-15"
}
