{
  "id": "qualia",
  "name": "Qualia",
  "summary": "The subjective, qualitative aspects of conscious experience - the 'what it is like' quality of sensations such as the redness of red or the painfulness of pain.",
  "explanation": "Qualia (singular: quale) are the subjective, qualitative aspects of conscious experience - the redness of red, the painfulness of pain, what it feels like to taste chocolate. They are the 'raw feels' of experience that seem to resist physical description.\n\nThomas Nagel's influential 1974 essay 'What Is It Like to Be a Bat?' argued that even complete physical knowledge of a bat's brain wouldn't capture what echolocation actually feels like from the inside. This subjective character of experience is precisely what makes qualia philosophically challenging.\n\nQualia are central to debates about consciousness. Frank Jackson's 'Mary's Room' thought experiment imagines a color scientist who knows everything physical about color but has only seen black and white - when she sees red for the first time, does she learn something new? If so, this suggests qualia cannot be reduced to physical facts.\n\nDavid Chalmers uses qualia to argue for the 'hard problem of consciousness' - that explaining why physical processes give rise to subjective experience may be fundamentally different from explaining how the brain works. Daniel Dennett controversially denies that qualia exist as commonly conceived, calling them a philosophical illusion created by misleading intuitions about consciousness.",
  "tags": [
    "philosophies",
    "consciousness",
    "perception",
    "philosophy-of-mind",
    "subjective-experience"
  ],
  "category": "Philosophy & Wisdom",
  "icon": "FaBrain",
  "featured": false,
  "aliases": [
    "Quale",
    "Subjective Experience",
    "Raw Feels"
  ],
  "relatedConcepts": [
    "consciousness"
  ],
  "relatedNotes": [
    "https://notes.dsebastien.net/30+Areas/33+Permanent+notes/33.02+Content/Qualia"
  ],
  "articles": [],
  "books": [
    {
      "title": "The Conscious Mind by David Chalmers",
      "url": "https://www.amazon.com/dp/0195117891?tag=dsebastien00-20"
    }
  ],
  "references": [
    {
      "title": "Qualia - Wikipedia",
      "url": "https://en.wikipedia.org/wiki/Qualia",
      "type": "website"
    },
    {
      "title": "What Is It Like to Be a Bat? - Wikipedia",
      "url": "https://en.wikipedia.org/wiki/What_Is_It_Like_to_Be_a_Bat%3F",
      "type": "website"
    },
    {
      "title": "Mary's Room - Wikipedia",
      "url": "https://en.wikipedia.org/wiki/Mary%27s_room",
      "type": "website"
    }
  ],
  "tutorials": [],
  "datePublished": "2026-01-28",
  "dateModified": "2026-01-28"
}
