{
    "id": "rapport",
    "name": "Rapport",
    "summary": "A harmonious relationship characterized by mutual trust, understanding, and emotional connection between people.",
    "explanation": "Rapport is the state of harmonious understanding and mutual trust that develops between people when they feel connected and in sync with each other. It is the foundation of effective communication, successful relationships, and productive collaboration.\n\nRapport manifests through several observable markers: mutual attentiveness, positivity, and coordination. When rapport is present, conversations flow naturally, people feel heard and understood, and there is a sense of ease in the interaction. Physiologically, people in rapport often synchronize their breathing, posture, and gestures — a phenomenon known as mirroring.\n\nBuilding rapport involves several key elements. Active listening demonstrates genuine interest in the other person. Finding common ground creates a sense of shared identity. Matching communication styles — pace, tone, vocabulary level — signals that you are on the same wavelength. Showing empathy and validating the other person's experience deepens the connection.\n\nRapport is essential across many domains. In therapy, the therapeutic alliance (a form of rapport) is one of the strongest predictors of positive outcomes. In negotiations, rapport facilitates collaborative problem-solving rather than adversarial positions. In leadership, rapport with team members builds psychological safety and trust. In teaching, rapport with students enhances engagement and learning.\n\nRapport is not about manipulation or superficial charm. Authentic rapport emerges from genuine curiosity about others, empathy, and a willingness to connect. While techniques like mirroring and active listening can facilitate rapport, they work best when grounded in sincere interest and respect for the other person.",
    "tags": [
        "communication",
        "relationships",
        "psychology",
        "social-psychology",
        "influence"
    ],
    "category": "Communication",
    "icon": "FaHandshake",
    "featured": false,
    "aliases": [
        "Rapport building",
        "Social rapport",
        "Interpersonal rapport"
    ],
    "relatedConcepts": [
        "mirroring",
        "active-listening",
        "empathic-listening",
        "emotional-intelligence",
        "social-intelligence",
        "empathy"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Rapport - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Rapport",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-11",
    "dateModified": "2026-02-11"
}
