{
    "id": "razor-and-blades",
    "name": "Razor and Blades Model",
    "summary": "Business model of selling a base product cheaply while generating ongoing profits from consumables or add-ons.",
    "explanation": "The razor and blades model sells the primary product at low or no margin to create a customer base that generates recurring revenue through consumables, refills, or complementary products. Named after Gillette's strategy of selling razors cheaply while profiting from blade replacements, the model appears across industries.\n\nCore mechanics: the base product creates lock-in (technical compatibility, habit, switching costs), consumables have high margins and recurring demand, and the total customer lifetime value exceeds what one-time pricing could capture. Examples include: printers and ink cartridges, gaming consoles and games, coffee machines and pods, and streaming devices and subscriptions.\n\nVariations include the 'reverse razor and blades' (Apple sells expensive phones but cheaper apps/content) and platform models where the base product is free but usage generates revenue (social media).\n\nRisks include: third-party compatible consumables undercutting margins, customer resentment at perceived lock-in, and technological changes eliminating the consumable need. Success requires either patent protection, technical lock-in, or strong brand loyalty.\n\nFor creators and knowledge workers, the model appears in: free books that sell courses, free tools that upsell premium features, free communities that convert to paid programs, and free content that builds email lists for product launches. The 'consumable' is often attention, trust, or ongoing learning needs.",
    "tags": [
        "businesses",
        "strategies",
        "pricing",
        "business-models"
    ],
    "category": "Business & Economics",
    "icon": "FaCogs",
    "featured": false,
    "aliases": [
        "Razor-razorblade model",
        "Bait and hook",
        "Tied products model",
        "Consumables model"
    ],
    "relatedConcepts": [
        "freemium",
        "loss-leader",
        "subscription-business-model"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Razor and blades model - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Razor_and_blades_model",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-20",
    "dateModified": "2026-01-20"
}
