{
    "id": "read-later",
    "name": "Read Later",
    "summary": "The practice of saving articles and content for focused reading at a more suitable time rather than consuming them immediately.",
    "explanation": "Read later is a deliberate practice of bookmarking content for future consumption rather than reading it the moment you encounter it. This approach recognizes that the time you discover something interesting is rarely the best time to read it thoughtfully, and that context-switching to read an article mid-task disrupts focus and productivity.\n\nDedicated read-later applications such as Pocket, Instapaper, Readwise Reader, Matter, and Omnivore provide distraction-free reading environments that strip away ads, sidebars, and other visual clutter. They save articles for offline access, allow highlighting and annotation, and often integrate with note-taking tools to feed into broader PKM workflows.\n\nThe benefits of a read-later practice include: reduced distraction (you can stay focused on your current task), batched reading (processing multiple articles in a dedicated reading session), better processing (reading when you have time and attention to engage deeply), and curated consumption (being intentional about what you actually read versus what catches your eye).\n\nHowever, the read-later trap is a common pitfall where people accumulate vast queues of saved content that they never actually read. The queue grows faster than it shrinks, creating a backlog that generates guilt and becomes increasingly unmanageable. This transforms what should be a helpful practice into another source of information anxiety.\n\nStrategies for managing a healthy read-later queue include: setting regular processing times (daily or weekly reading sessions), implementing expiration dates (if you haven't read it in 30 days, it probably wasn't that important), prioritizing ruthlessly (starring or tagging must-reads versus nice-to-haves), keeping the queue small (limiting to a manageable number of items), and accepting that it is okay to delete unread articles.\n\nIntegrating read-later with PKM workflows means not just reading saved content but processing it: highlighting key passages, taking notes, connecting ideas to existing knowledge, and deciding what deserves a permanent place in your knowledge base versus what can be discarded after reading.",
    "tags": [
        "techniques",
        "reading",
        "knowledge-management",
        "productivity"
    ],
    "category": "Techniques",
    "icon": "FaClock",
    "featured": false,
    "aliases": [
        "Read-it-later",
        "Saved articles",
        "Reading queue"
    ],
    "relatedConcepts": [
        "information-diet",
        "information-triage",
        "active-reading",
        "capture-system",
        "bookmark-management",
        "reading-list"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Personal Knowledge Management Library",
            "url": "https://store.dsebastien.net/product/pkm-library",
            "type": "other"
        },
        {
            "title": "Personal Knowledge Management Coaching",
            "url": "https://store.dsebastien.net/product/pkm-coaching",
            "type": "other"
        },
        {
            "title": "DeveloPassion's Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        },
        {
            "title": "Personal Organization 101 Workshop",
            "url": "https://store.dsebastien.net/product/personal-organization-101",
            "type": "other"
        },
        {
            "title": "AI Master Prompt Workshop",
            "url": "https://store.dsebastien.net/product/ai-master-prompt",
            "type": "other"
        }
    ],
    "tutorials": [],
    "books": [],
    "datePublished": "2026-02-22",
    "dateModified": "2026-02-22"
}
