{
    "id": "reading-list",
    "name": "Reading List",
    "summary": "A curated collection of books, articles, and resources intentionally selected and organized for future reading.",
    "explanation": "A Reading List is an intentional collection of content queued for future consumption. Unlike a random pile of saved articles, a well-managed reading list reflects deliberate choices about what to learn, explore, and engage with over time.\n\nReading lists come in various forms. Themed lists focus on a specific topic or domain, gathering the best resources for deep exploration. Annual reading goals set targets for how many books or articles to consume in a year. Some people maintain separate lists for different formats: books, long-form articles, academic papers, and online courses.\n\nManaging a reading list effectively requires several strategies. Prioritization is essential, as the list will always grow faster than you can read. Regular review helps surface items that have become more or less relevant since they were added. Perhaps most importantly, accepting that you will never read everything on your list is a liberating realization that frees you to focus on what matters most right now.\n\nVarious tools support reading list management. Goodreads provides a social platform for tracking books with community reviews and recommendations. Notion and Obsidian allow reading lists to be integrated into a broader knowledge management system, linking books to notes, projects, and ideas. Dedicated read-later services handle articles and web content.\n\nThe reading list concept connects deeply to Nassim Nicholas Taleb's antilibrary idea: the books you have not read yet are potentially as valuable as those you have, because they represent the boundaries of your knowledge and the possibilities for growth. A reading list, viewed this way, is not a source of guilt about unread items but a map of intellectual territory waiting to be explored.\n\nReading lists also support intentional learning paths. Rather than consuming content reactively based on whatever algorithm surfaces next, a curated reading list lets you design your own curriculum, building knowledge systematically in areas that matter to you.",
    "tags": [
        "techniques",
        "reading",
        "planning",
        "knowledge-management"
    ],
    "category": "Techniques",
    "icon": "FaListUl",
    "featured": false,
    "aliases": [
        "To-read list",
        "Reading queue",
        "Book list"
    ],
    "relatedConcepts": [
        "antilibrary",
        "active-reading",
        "read-later",
        "information-diet",
        "lifelong-learning"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Personal Knowledge Management Library",
            "url": "https://store.dsebastien.net/product/pkm-library",
            "type": "other"
        },
        {
            "title": "Personal Knowledge Management Coaching",
            "url": "https://store.dsebastien.net/product/pkm-coaching",
            "type": "other"
        },
        {
            "title": "DeveloPassion's Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        },
        {
            "title": "Personal Organization 101 Workshop",
            "url": "https://store.dsebastien.net/product/personal-organization-101",
            "type": "other"
        }
    ],
    "tutorials": [],
    "books": [],
    "datePublished": "2026-02-22",
    "dateModified": "2026-02-22"
}
