{
    "id": "recoverable-vs-irrecoverable-decisions",
    "name": "Recoverable vs Irrecoverable Decisions",
    "summary": "A decision framework that evaluates choices by whether you can bounce back from negative outcomes, distinct from whether the decision itself can be reversed.",
    "explanation": "Recoverable vs irrecoverable decisions is a framework that shifts the focus from whether a decision can be undone (reversibility) to whether you can recover from its worst-case outcome (recoverability). This distinction is subtle but practically powerful: many irreversible decisions are still recoverable, and recognizing this dramatically reduces decision anxiety.\n\nThe key question is not 'Can I undo this?' but 'If this goes wrong, can I bounce back?' Quitting a job is irreversible (you cannot un-quit), but it is recoverable: you can find another job, freelance, or pivot. Starting a business that fails is irreversible (you cannot un-start it), but it is recoverable: you can get a job, try again, or change direction. Conversely, some decisions are truly irrecoverable: catastrophic financial ruin without a safety net, severe health damage, or destroyed relationships that cannot be rebuilt.\n\nThis framing encourages a bias for action on recoverable decisions. When the realistic worst-case outcome is something you can bounce back from, the decision deserves less agonizing and more doing. The cost of inaction (missed opportunities, stagnation) often exceeds the cost of a failed but recoverable attempt.\n\nA related framework categorizes decisions as hats (easily changed), haircuts (temporarily uncomfortable but they grow back), and tattoos (essentially permanent). Most decisions we agonize over are haircuts, not tattoos.\n\nThe practical skill is structuring situations to make more decisions recoverable. This includes: maintaining financial reserves (a failed venture is recoverable if you have savings), building diverse skills (a career setback is recoverable if you have multiple employable abilities), preserving relationships (a wrong turn is recoverable if your network is intact), and starting small (testing ideas with limited downside before full commitment).\n\nFor entrepreneurs and knowledge workers, this framework is liberating. Most professional decisions are recoverable. The fear of making the wrong choice is usually disproportionate to the actual worst-case outcome, and recognizing this enables faster, bolder decision-making.",
    "tags": [
        "decision-making",
        "mental-models",
        "frameworks",
        "risk-management",
        "entrepreneurship"
    ],
    "category": "Decision Science",
    "icon": "FaExchangeAlt",
    "featured": false,
    "aliases": [
        "Recoverability framework",
        "Decision recoverability",
        "Hat haircut tattoo framework"
    ],
    "relatedConcepts": [
        "reversible-vs-irreversible-decisions",
        "bias-for-action",
        "analysis-paralysis",
        "regret-minimization-framework",
        "risk-assessment",
        "optionality",
        "sunk-cost-fallacy",
        "antifragility"
    ],
    "relatedNotes": [],
    "articles": [
        {
            "title": "Recoverable and Irrecoverable Decisions by Herbert Lui",
            "url": "https://herbertlui.net/recoverable-and-irrecoverable-decisions/",
            "type": "website"
        }
    ],
    "references": [
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/product/clarity-101",
            "type": "other"
        }
    ],
    "books": [],
    "tutorials": [],
    "datePublished": "2026-02-13",
    "dateModified": "2026-02-13"
}
