{
    "id": "red-ocean-strategy",
    "name": "Red Ocean Strategy",
    "summary": "Competing in existing market space where industry boundaries are defined and competition is fierce.",
    "explanation": "Red ocean strategy refers to competing in existing market spaces where industry boundaries are defined and accepted, and competitive rules are known. The term 'red ocean' evokes the image of a bloody sea where companies fight over a shrinking profit pool. In red oceans, companies try to outperform rivals by capturing greater market share through cost leadership, differentiation, or focus strategies. While red ocean competition is necessary and can be successful, it often leads to: commoditization, price wars, shrinking margins, and incremental rather than breakthrough innovation. The limitations of red ocean thinking include: accepting industry boundaries as given, benchmarking against competitors rather than creating new value, and trading off between value and cost. Understanding red ocean dynamics helps recognize when to compete conventionally versus when to seek blue ocean opportunities. Most companies operate primarily in red oceans, making blue ocean strategy valuable for sustainable growth.",
    "tags": [
        "strategies",
        "businesses",
        "competition",
        "markets"
    ],
    "category": "Business & Economics",
    "icon": "FaWater",
    "featured": false,
    "aliases": [
        "Red Ocean",
        "Competitive Strategy"
    ],
    "relatedConcepts": [
        "blue-ocean-strategy",
        "competitive-advantage",
        "disruptive-innovation",
        "value-chain"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Blue Ocean Strategy by W. Chan Kim and Renée Mauborgne",
            "url": "https://www.amazon.com/dp/1625274491?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Blue Ocean Strategy - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Blue_Ocean_Strategy",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-03",
    "dateModified": "2026-02-03"
}
