{
    "id": "red-herring",
    "name": "Red Herring",
    "summary": "A misleading clue or distraction deliberately planted to divert attention from the truth and create false expectations.",
    "explanation": "A red herring is a deliberate misdirection - information that seems important but ultimately leads nowhere, or suspects who appear guilty but are innocent. The term comes from the practice of using smoked herring to throw hunting dogs off a scent. In storytelling, red herrings manipulate the three-sided knowledge structure by giving readers false clues that seem significant. Purpose of red herrings: create surprise when the truth is revealed, make mysteries more challenging and engaging, prevent premature solution, and increase reread value (seeing how you were fooled). Types: false suspects (characters who appear guilty), misleading evidence (clues that point the wrong direction), irrelevant details (information that seems important but isn't), and planted expectations (setup that suggests one outcome but delivers another). Effective red herrings must be: plausible (genuinely could be true), fair (not completely arbitrary), and resolved (eventually explained why they were false). Bad red herrings: completely random details with no logical connection, too obviously false, or never acknowledged (readers feel cheated if misleading evidence is simply forgotten). Balance: too many red herrings exhaust readers, too few make mysteries too easy. The art is making readers feel clever when they solve it, not manipulated. Red herrings work by exploiting readers' pattern-seeking - we assume every detail matters, so authors can weaponize that assumption.",
    "tags": [
        "storytelling",
        "writing",
        "mysteries",
        "techniques",
        "misdirection",
        "literature"
    ],
    "category": "Writing & Content Creation",
    "icon": "FaFish",
    "featured": false,
    "aliases": [
        "False clue",
        "Misdirection",
        "False lead",
        "Narrative diversion"
    ],
    "relatedConcepts": [
        "foreshadowing",
        "narrative-misdirection",
        "dramatic-irony",
        "unreliable-narrator"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Red herring - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Red_herring",
            "type": "website"
        },
        {
            "title": "AI Ghostwriter Guide",
            "url": "https://store.dsebastien.net/l/ai-ghostwriter-guide",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-06",
    "dateModified": "2026-01-18"
}
