{
    "id": "reflective-journaling",
    "name": "Reflective Journaling",
    "summary": "A practice of structured self-reflection through writing to gain deeper insights, examine experiences, and promote personal growth.",
    "explanation": "Reflective journaling goes beyond simply recording events or thoughts. It involves deliberately examining your experiences, decisions, emotions, and assumptions with the goal of extracting meaning, learning lessons, and fostering personal growth. Unlike a simple diary, which tends to describe what happened, reflective journaling asks why it happened, how you felt about it, and what you can learn from it.\n\nSeveral frameworks support reflective journaling. Gibbs' reflective cycle, for example, guides writers through six stages: description (what happened), feelings (what you thought and felt), evaluation (what was good and bad), analysis (what sense can you make of it), conclusion (what else could you have done), and action plan (what will you do next time). Other approaches include Kolb's experiential learning cycle and simple prompt-based reflection.\n\nThe benefits of reflective journaling are well-documented in educational and psychological research. It enhances learning by helping consolidate experiences into lasting knowledge. It supports emotional processing by creating distance between events and your response to them. It improves decision-making by making your reasoning patterns visible. And it fosters self-awareness by revealing blind spots and habitual patterns.\n\nTo practice reflective journaling effectively, set aside dedicated time, use prompts or frameworks to guide your writing, be honest and specific in your reflections, and periodically review past entries to identify growth patterns and recurring themes.",
    "tags": [
        "journaling",
        "self-reflection",
        "personal-growth",
        "learning"
    ],
    "category": "Journaling",
    "icon": "FaPenFancy",
    "featured": false,
    "aliases": [
        "Reflective writing",
        "Self-reflection journal"
    ],
    "relatedConcepts": [
        "journaling",
        "reflective-practice",
        "reflective-thinking",
        "self-awareness",
        "daily-review",
        "therapeutic-writing"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "DeveloPassion's Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        },
        {
            "title": "Journaling Deep Dive Workshop",
            "url": "https://store.dsebastien.net/product/journaling-deep-dive",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-21",
    "dateModified": "2026-02-21"
}
