{
    "id": "room-temperature",
    "name": "Room Temperature",
    "summary": "Metaphor for how systems and individuals naturally regress toward mediocrity without intentional effort to maintain distinctiveness.",
    "explanation": "Room temperature is a metaphor coined by Seth Godin: 'Left alone, a cup of coffee will gradually cool until it reaches room temperature. Stable systems regress to the mean.' The concept applies this physical principle to human systems—organizations, cultures, and individuals naturally drift toward average without deliberate intervention.\n\nThe forces pulling toward room temperature are constant and pervasive. In organizations, new employees initially spot inefficiencies that veterans have normalized; within 90 days, most conform to existing patterns. Grammar checkers suggest edits that normalize distinctive writing into conventional prose. Social systems reward alignment and penalize deviation until maintaining difference feels counterproductive.\n\nThe physics parallel is entropy—maintaining order requires continuous energy investment. Excellence is not a stable state you achieve and keep; it's an ongoing battle against the universe's pull toward disorder and averageness. A distinctive voice, an innovative culture, an exceptional standard—all require active maintenance.\n\nThe practical implications are significant: if you want to remain distinctive, you must intentionally resist the pull toward average. This means: regularly questioning whether you're drifting toward convention, creating systems that protect your unique approaches, surrounding yourself with people who support rather than normalize deviation, and accepting that maintaining excellence is perpetual work rather than a destination. The alternative is settling into comfortable mediocrity—stable, but unremarkable.",
    "tags": [
        "mental-models",
        "personal-growth",
        "excellence",
        "intentionality",
        "systems-thinking"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaThermometerHalf",
    "featured": false,
    "aliases": [
        "Regression toward average",
        "Drift toward mediocrity"
    ],
    "relatedConcepts": [
        "entropy",
        "regression-to-the-mean",
        "status-quo-bias",
        "living-on-default",
        "social-conformity",
        "overcoming-inertia"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Seth Godin on Room Temperature - LinkedIn",
            "url": "https://www.linkedin.com/posts/sethgodin_room-temperature-left-alone-a-cup-of-coffee-activity-7415685178981097472-3ERA",
            "type": "website"
        },
        {
            "title": "Entropy - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Entropy",
            "type": "website"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Journaling Deep Dive Workshop",
            "url": "https://store.dsebastien.net/product/journaling-deep-dive",
            "type": "other"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/product/clarity-101",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-20",
    "dateModified": "2026-01-20"
}
