{
    "id": "rrr",
    "name": "Remark, Relate, Reference",
    "summary": "A three-step method for processing information by noting your observations, connecting them to existing knowledge, and tracking the source.",
    "explanation": "The RRR (Remark, Relate, Reference) method is a structured approach to processing information that transforms passive consumption into active note-making. It provides a simple yet effective framework for engaging deeply with any material you encounter, whether from books, articles, conversations, or personal observations.\n\nThe method consists of three steps:\n\n**Remark**: Capture your observation, insight, or reaction to the information. This is not about copying or summarizing the source material verbatim. Instead, you write down what stands out to you, what surprises you, or what you find particularly meaningful. The act of remarking forces you to engage with the material and identify what matters most from your perspective.\n\n**Relate**: Connect the new information to what you already know. How does this insight fit with your existing knowledge, personal experience, or other notes in your system? Does it confirm, contradict, or extend something you have encountered before? This step is where real learning happens, because understanding is built by integrating new information into existing mental models. In a PKM system, this is where you create links to other notes, identify patterns across domains, and build a web of connected knowledge.\n\n**Reference**: Record where the information came from. This includes the author, title, page number, URL, timestamp, or any other details needed for attribution and future retrieval. Good referencing ensures you can always trace an idea back to its source, verify claims, and give proper credit. It also makes your notes far more valuable as a research tool.\n\nThe power of the RRR method lies in its simplicity and its insistence on going beyond mere copying. Many people take notes by highlighting or transcribing passages, but this is a shallow form of engagement that produces little lasting understanding. By requiring you to remark (add your own thinking), relate (connect to existing knowledge), and reference (track the source), the method ensures every note you create adds genuine value to your knowledge base.\n\nRRR supports the transition from note-taking to note-making. Note-taking is the mechanical act of recording information. Note-making is the creative act of transforming information into personal knowledge. The Remark step injects your own thinking. The Relate step builds connections. The Reference step maintains intellectual integrity.\n\nThis method works well in combination with other PKM practices such as literature notes, progressive summarization, and the Zettelkasten method. It can be applied to any source of information and scales naturally as your knowledge base grows.",
    "tags": [
        "methods",
        "note-taking",
        "knowledge-management",
        "processing"
    ],
    "category": "Methods",
    "icon": "FaLink",
    "featured": false,
    "aliases": [
        "RRR method",
        "Remark Relate Reference"
    ],
    "relatedConcepts": [
        "note-making",
        "active-reading",
        "literature-notes",
        "connected-notes",
        "sense-making"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Personal Knowledge Management Library",
            "url": "https://store.dsebastien.net/product/pkm-library",
            "type": "other"
        },
        {
            "title": "Personal Knowledge Management Coaching",
            "url": "https://store.dsebastien.net/product/pkm-coaching",
            "type": "other"
        },
        {
            "title": "DeveloPassion's Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        },
        {
            "title": "Knowii Voice AI",
            "url": "https://voice-ai.knowii.net",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-22",
    "dateModified": "2026-02-22"
}
