{
    "id": "save-the-cat",
    "name": "Save the Cat",
    "summary": "A screenwriting methodology by Blake Snyder that breaks stories into 15 specific beats with page-number guidelines, providing a structural template for crafting compelling narratives.",
    "explanation": "Save the Cat is a screenwriting framework developed by Blake Snyder in his 2005 book of the same name. The title comes from the concept that early in a story, the protagonist should do something sympathetic—like saving a cat—to make the audience root for them. This 'Save the Cat moment' establishes likability before the character faces their journey's challenges.\n\nThe framework centers on 15 story beats, each with specific page-number targets for a standard 110-page screenplay:\n\n**Act One (Setup):**\n1. **Opening Image (p. 1)**: A visual that establishes the tone, mood, and starting point of the protagonist's world before transformation.\n2. **Theme Stated (p. 5)**: Someone, often not the protagonist, states the movie's thematic premise—what the story is really about.\n3. **Set-Up (p. 1-10)**: Introduction to the protagonist's world, their flaws, and what needs to change. Plants elements that will pay off later.\n4. **Catalyst (p. 12)**: The inciting incident that disrupts the status quo and sets the story in motion.\n5. **Debate (p. 12-25)**: The protagonist wrestles with the call to adventure, questioning whether to accept the challenge.\n\n**Act Two (Confrontation):**\n6. **Break into Two (p. 25)**: The protagonist makes a choice and enters the 'upside-down world' of Act Two.\n7. **B Story (p. 30)**: Introduction of a secondary storyline, often a love interest or mentor who helps carry the theme.\n8. **Fun and Games (p. 30-55)**: The promise of the premise delivered—the trailer moments and core entertainment value.\n9. **Midpoint (p. 55)**: A false victory or false defeat that raises stakes. Often a public moment where the story shifts.\n10. **Bad Guys Close In (p. 55-75)**: External pressures mount while internal doubts grow. The team or plan starts falling apart.\n11. **All Is Lost (p. 75)**: The lowest point where everything seems hopeless. Often includes a 'whiff of death'—literal or metaphorical.\n12. **Dark Night of the Soul (p. 75-85)**: The protagonist processes their defeat and finds the strength or insight needed for the final push.\n\n**Act Three (Resolution):**\n13. **Break into Three (p. 85)**: Armed with new understanding (often combining A and B story lessons), the protagonist re-enters the fight.\n14. **Finale (p. 85-110)**: The protagonist confronts the antagonist, applies lessons learned, and transforms their world.\n15. **Final Image (p. 110)**: A visual that mirrors the Opening Image but shows how things have changed.\n\nSnyder also developed ten genre categories that he argued all stories fit into: Monster in the House (horror/thriller), Golden Fleece (quest stories), Out of the Bottle (wish fulfillment), Dude with a Problem (ordinary person in extraordinary circumstances), Rites of Passage (life transitions), Buddy Love (relationship stories), Whydunit (mysteries focused on motive), The Fool Triumphant (underdog comedies), Institutionalized (group dynamics), and Superhero (extraordinary person in ordinary world).\n\nThe framework became enormously influential in Hollywood, with many screenwriters, development executives, and studios adopting it as a common language for story development. Its accessibility made complex narrative structure understandable for beginners while providing professionals with a diagnostic tool for troubled scripts.\n\nHowever, Save the Cat has faced significant criticism. Detractors argue it has contributed to formulaic storytelling, with too many films feeling mechanically structured and predictable. Critics like Slate's Peter Suderman have blamed the framework for Hollywood's perceived creative stagnation. Others note that rigidly adhering to page-number guidelines can produce artificial pacing and that great films often break these 'rules.' Supporters counter that the beats describe patterns found in successful stories rather than prescribing them, and that understanding structure provides freedom rather than constraint.",
    "tags": [
        "storytelling",
        "writing",
        "screenwriting",
        "structures",
        "frameworks",
        "narratives",
        "movies"
    ],
    "category": "Frameworks",
    "icon": "FaFilm",
    "featured": false,
    "aliases": [
        "Save the Cat Beat Sheet",
        "Blake Snyder Beat Sheet",
        "STC Beat Sheet"
    ],
    "relatedConcepts": [
        "three-act-structure",
        "heros-journey",
        "story-arcs"
    ],
    "relatedNotes": [],
    "references": [
        {
            "title": "Save the Cat! - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Save_the_Cat!",
            "type": "website"
        },
        {
            "title": "AI Ghostwriter Guide",
            "url": "https://store.dsebastien.net/product/ai-ghostwriter-guide",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        }
    ],
    "articles": [],
    "books": [
        {
            "title": "Save the Cat! by Blake Snyder",
            "url": "https://www.amazon.com/dp/1932907009?tag=dsebastien00-20"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-19",
    "dateModified": "2026-01-29"
}
