{
    "id": "scarcity-mindset",
    "name": "Scarcity Mindset",
    "summary": "The belief that resources are fundamentally limited, leading to competitive and fear-driven behavior.",
    "explanation": "A scarcity mindset is the deeply held belief that there is never enough - not enough time, money, recognition, opportunities, or resources. This orientation treats life as a zero-sum game where someone else's gain necessarily means your loss. While distinct from the psychological principle of scarcity (which describes how limited availability increases perceived value), the scarcity mindset is a pervasive lens through which a person views their entire world.\n\nMullainathan and Shafir's research in 'Scarcity' demonstrates that this mindset creates a self-reinforcing cycle. When you believe resources are scarce, you: hoard rather than share (reducing collective value), compete rather than collaborate (missing positive-sum opportunities), make short-term decisions driven by fear (neglecting long-term investments), and experience a bandwidth tax that reduces cognitive capacity for planning and creativity.\n\nIn knowledge work, a scarcity mindset manifests as: reluctance to share ideas or credit, information hoarding instead of knowledge sharing, viewing colleagues as competitors rather than collaborators, difficulty delegating or trusting others, and over-collecting resources (notes, tools, courses) from fear of missing out.\n\nThe scarcity mindset also creates tunneling - an intense focus on immediate perceived shortages that causes neglect of other important areas. Someone obsessed with not having enough time may skip exercise, damaging health. Someone fixated on money may neglect relationships.\n\nBreaking free from scarcity thinking requires: recognizing the mindset as a lens rather than reality, practicing gratitude to shift attention toward what you have, building slack and buffers to reduce the feeling of constant shortage, and deliberately engaging in generous behavior to experience the positive-sum nature of most important domains.",
    "tags": [
        "mindsets",
        "psychology",
        "cognitive-biases",
        "decision-making",
        "well-being"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaCompressArrowsAlt",
    "featured": false,
    "aliases": [
        "Scarcity Mentality",
        "Fixed Pie Mentality",
        "Poverty Mindset"
    ],
    "relatedConcepts": [
        "abundance-mindset",
        "scarcity",
        "bandwidth-tax",
        "tunneling",
        "fomo",
        "loss-aversion",
        "time-scarcity-mindset",
        "zero-sum-positive-sum"
    ],
    "relatedNotes": [
        "https://notes.dsebastien.net/30+Areas/33+Permanent+notes/33.02+Content/Scarcity"
    ],
    "articles": [],
    "books": [
        {
            "title": "Scarcity by Sendhil Mullainathan and Eldar Shafir",
            "url": "https://www.amazon.com/dp/125005611X?tag=dsebastien00-20"
        },
        {
            "title": "The 7 Habits of Highly Effective People by Stephen Covey",
            "url": "https://www.amazon.com/dp/1982137274?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Scarcity (social psychology) - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Scarcity_(social_psychology)",
            "type": "website"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/product/clarity-101",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-20",
    "dateModified": "2026-02-20"
}
