{
    "id": "scopos",
    "name": "Scopos",
    "summary": "Ancient Greek concept meaning purpose, aim, or target - the overarching goal that guides one's life direction and decisions.",
    "explanation": "Scopos (Greek: σκοπός, pronounced 'skop-os') means 'target,' 'aim,' or 'mark to aim at.' In ancient Greek philosophy, it refers to the objective we strive toward - an aspect of our reason for existing. Unlike fleeting goals or temporary objectives, scopos represents a stable, overarching purpose that provides direction and coherence to our choices and actions.\n\nIn Stoic philosophy, scopos is closely linked to the metaphor of the Stoic archer. Just as an archer selects a target before drawing the bow, we must identify our scopos before we can direct our lives meaningfully. The Stoics taught that while we cannot control whether our arrow hits the mark (external outcomes), we can control our aim (our intentions and efforts). Having a clear scopos allows us to focus on what matters and let go of distractions. Epictetus and Marcus Aurelius both emphasized that a life without a clear aim is like a ship without a rudder - tossed about by circumstances rather than navigating purposefully.\n\nThe stability of one's scopos matters greatly. When our target keeps moving, we waste energy constantly readjusting rather than making progress. A stable scopos provides a consistent reference point for decision-making: when faced with choices, we can ask 'Does this move me toward my target?' In modern life design, scopos connects to finding your 'north star' - a guiding purpose that remains constant even as tactics and circumstances change. Unlike the Japanese concept of ikigai (which emphasizes the intersection of passion, skill, need, and compensation) or Aristotle's telos (the ultimate end or final cause), scopos emphasizes the practical, directional aspect of purpose - it is what we actively aim toward in our daily choices.",
    "tags": [
        "philosophies",
        "purpose",
        "goals",
        "greek-philosophy",
        "life-design",
        "stoicism"
    ],
    "category": "Philosophy & Wisdom",
    "icon": "FaCompass",
    "featured": false,
    "aliases": [
        "Skopos",
        "Life Purpose",
        "Life Target"
    ],
    "relatedConcepts": [
        "ikigai",
        "eudaimonia",
        "life-design",
        "stoic-archer",
        "dichotomy-of-control",
        "stoicism"
    ],
    "relatedNotes": [
        "https://notes.dsebastien.net/30+Areas/33+Permanent+notes/33.02+Content/Scopos+(σκοπός)"
    ],
    "articles": [],
    "books": [
        {
            "title": "Meditations by Marcus Aurelius",
            "url": "https://www.amazon.com/dp/0140449337?tag=dsebastien00-20"
        },
        {
            "title": "Enchiridion by Epictetus",
            "url": "https://www.amazon.com/dp/0486433595?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Skopos theory - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Skopos_theory",
            "type": "website"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/product/clarity-101",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-29",
    "dateModified": "2026-01-29"
}
