{
    "id": "self-soothing",
    "name": "Self-Soothing",
    "summary": "Techniques for calming oneself through the five senses and nurturing self-care during emotional distress.",
    "explanation": "Self-soothing refers to the ability to calm and comfort yourself during times of emotional distress. It's a fundamental skill for emotional regulation, drawing on sensory experiences and nurturing behaviors to activate the body's relaxation response.\n\nSelf-soothing through the five senses:\n\n1. Vision: Look at beautiful images, nature, art, photos of loved ones, calming colors, candles\n\n2. Hearing: Listen to soothing music, nature sounds, ASMR, silence, or calming voices\n\n3. Smell: Use pleasant scents - essential oils, candles, flowers, fresh air, favorite foods cooking\n\n4. Taste: Enjoy comforting foods or drinks mindfully - tea, chocolate, soup, favorite flavors\n\n5. Touch: Wrap in soft blankets, take warm baths, pet animals, use weighted blankets, massage\n\nBeyond the senses:\n- Comforting self-talk (speaking kindly to yourself)\n- Imagining a safe place\n- Physical comfort (warmth, comfortable clothing)\n- Nurturing activities (reading, gentle movement)\n\nWhy self-soothing matters: Many people didn't learn healthy self-soothing in childhood and rely on maladaptive strategies (substances, avoidance, numbing). Deliberately building a self-soothing toolkit provides healthy alternatives.\n\nDeveloping self-soothing capacity:\n- Identify what genuinely soothes you (not just distracts)\n- Create a self-soothing kit (physical items readily available)\n- Practice when calm to build the skill\n- Use before distress becomes overwhelming\n\nSelf-soothing is a core component of DBT's distress tolerance module and is related to the broader concept of self-regulation.",
    "tags": [
        "psychology",
        "coping",
        "self-care",
        "emotional-regulation",
        "well-being"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaSpa",
    "featured": false,
    "aliases": [
        "Self-comfort",
        "Sensory soothing",
        "Self-nurturing"
    ],
    "relatedConcepts": [
        "distress-tolerance",
        "emotional-regulation",
        "self-regulation",
        "grounding",
        "self-compassion",
        "coping-skills"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Self-Compassion by Kristin Neff",
            "url": "https://www.amazon.com/dp/0061733520?tag=dsebastien00-20"
        },
        {
            "title": "The Dialectical Behavior Therapy Skills Workbook by Matthew McKay",
            "url": "https://www.amazon.com/dp/1684034582?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Self-soothing - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Self-soothing",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-29",
    "dateModified": "2026-01-29"
}
