{
    "id": "self-determination-theory",
    "name": "Self-Determination Theory",
    "summary": "A motivational framework identifying three innate psychological needs - autonomy, competence, and relatedness - that drive optimal human functioning.",
    "explanation": "Self-Determination Theory (SDT) is a comprehensive framework of human motivation developed by psychologists Edward Deci and Richard Ryan. It proposes that people have three basic psychological needs that, when satisfied, lead to optimal motivation, performance, and well-being.\n\nThe three innate needs are:\n\n**Autonomy**: The need to feel in control of your own behaviors and goals. This isn't about independence or working alone, but about feeling that your actions are self-endorsed and align with your values. When autonomy is supported, people feel ownership over their choices.\n\n**Competence**: The need to feel capable and effective in dealing with your environment. People are naturally motivated to develop skills and master challenges. When competence needs are met, people feel confident and capable.\n\n**Relatedness**: The need to feel connected to others and to belong. Humans have an inherent desire for meaningful relationships and to feel cared for and valued by others.\n\nSDT distinguishes between different types of motivation:\n- **Intrinsic motivation**: Doing something because it's inherently interesting or enjoyable\n- **Extrinsic motivation**: Doing something for external reasons (rewards, pressure, guilt)\n- **Amotivation**: Lacking any motivation to act\n\nResearch shows that when the three basic needs are supported, people experience more intrinsic motivation, better performance, greater persistence, enhanced creativity, and improved well-being. Conversely, environments that thwart these needs lead to diminished motivation and poorer outcomes.\n\nSDT has profound implications for education, parenting, management, healthcare, and personal development. It suggests that supporting autonomy (offering choices, acknowledging feelings), building competence (providing optimal challenges, effective feedback), and fostering relatedness (showing genuine care, creating belonging) are key to helping people thrive.",
    "tags": [
        "motivation",
        "psychology",
        "positive-psychology",
        "well-being",
        "autonomy",
        "frameworks"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaUserCheck",
    "featured": false,
    "aliases": [
        "SDT",
        "Deci and Ryan's Theory"
    ],
    "relatedConcepts": [
        "intrinsic-motivation",
        "extrinsic-motivation",
        "positive-psychology",
        "flow-state",
        "meaningful-pursuits"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Self-Determination Theory by Deci & Ryan",
            "url": "https://www.amazon.com/dp/1462538967?tag=dsebastien00-20"
        },
        {
            "title": "Why We Do What We Do by Edward Deci",
            "url": "https://www.amazon.com/dp/0140255265?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Self-Determination Theory - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Self-determination_theory",
            "type": "website"
        },
        {
            "title": "Self-Determination Theory Official Website",
            "url": "https://selfdeterminationtheory.org/",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-15",
    "dateModified": "2026-01-15"
}
