{
    "id": "sense-making",
    "name": "Sense-Making",
    "summary": "The cognitive process of interpreting, organizing, and constructing meaning from new information to build coherent understanding.",
    "explanation": "Sense-making is the active cognitive process of constructing meaning from information, experiences, and observations. Rather than passively absorbing data, sense-making involves interpreting, questioning, connecting, and organizing inputs into coherent understanding that can guide decisions and actions.\n\nKarl Weick's organizational sensemaking theory describes how people in organizations retrospectively make sense of ambiguous situations by constructing plausible narratives. Weick identified seven properties of sensemaking: it is grounded in identity construction, retrospective, enactive of sensible environments, social, ongoing, focused on and by extracted cues, and driven by plausibility rather than accuracy.\n\nBrenda Dervin's sense-making methodology takes a communication-centered approach, viewing sense-making as a process people use to bridge gaps in their understanding. Her model emphasizes the situation-gap-outcome framework, where individuals encounter a gap in knowledge and engage in sense-making behaviors to bridge that gap and reach a useful outcome.\n\nIn knowledge work, sense-making is the crucial step between information gathering and genuine understanding. It involves connecting dots across disparate sources, finding patterns in seemingly unrelated data, building and refining mental models, and developing insights that go beyond what any single piece of information provides.\n\nSense-making maps closely to the PKM workflow of capture, process, and synthesize. While capturing collects raw information, sense-making is where the real cognitive work happens: processing those inputs, questioning assumptions, comparing perspectives, and synthesizing them into personal understanding that becomes part of your knowledge base.\n\nThe key difference between information gathering and genuine sense-making is transformation. Gathering accumulates inputs without changing them, while sense-making transforms raw information into structured understanding, actionable insights, and connected knowledge. Without deliberate sense-making, knowledge workers risk drowning in information without ever developing the understanding needed to act on it effectively.",
    "tags": [
        "techniques",
        "knowledge-management",
        "thinking",
        "understanding"
    ],
    "category": "Techniques",
    "icon": "FaPuzzlePiece",
    "featured": false,
    "aliases": [
        "Sensemaking",
        "Making sense"
    ],
    "relatedConcepts": [
        "synthesis",
        "seek-sense-share",
        "knowledge-creation",
        "mental-models",
        "knowledge-synthesis",
        "pattern-recognition",
        "rrr"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Sensemaking - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Sensemaking",
            "type": "website"
        },
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Personal Knowledge Management Library",
            "url": "https://store.dsebastien.net/product/pkm-library",
            "type": "other"
        },
        {
            "title": "Personal Knowledge Management Coaching",
            "url": "https://store.dsebastien.net/product/pkm-coaching",
            "type": "other"
        },
        {
            "title": "DeveloPassion's Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/product/clarity-101",
            "type": "other"
        }
    ],
    "tutorials": [],
    "books": [],
    "datePublished": "2026-02-22",
    "dateModified": "2026-02-22"
}
