{
    "id": "serial-entrepreneurship",
    "name": "Serial Entrepreneurship",
    "summary": "Building multiple businesses sequentially or simultaneously, applying learnings across ventures.",
    "explanation": "Serial entrepreneurship is the practice of starting multiple businesses over a career, either sequentially (one after another) or as a portfolio (multiple concurrent ventures). Unlike one-time founders, serial entrepreneurs view company building as a repeatable skill that improves with practice.\n\nAdvantages of serial entrepreneurship include: accumulated pattern recognition across ventures, established networks of investors, talent, and partners, refined intuition for market opportunities, resilience developed through previous failures, and reputation that attracts resources. Research suggests serial entrepreneurs have higher success rates on subsequent ventures, though selection effects complicate the data.\n\nDifferent models exist: some entrepreneurs build, scale, and exit before starting the next venture (sequential). Others maintain multiple smaller projects simultaneously, like indie hackers with portfolios of micro-SaaS products (parallel). Some create holding companies or studios that systematically launch and operate multiple businesses.\n\nChallenges include: spreading attention too thin across ventures, applying outdated playbooks to new contexts, reputation risk when ventures fail, and potential burnout from perpetual startup intensity. Not everyone should be a serial entrepreneur—some founders thrive by going deep on one company for decades.\n\nFor creators and indie hackers, serial entrepreneurship offers a path to learning through volume. Each project teaches something. The shotgun-to-sniper strategy reflects serial entrepreneurship thinking: try many things, commit to winners, but maintain the optionality to start again.",
    "tags": [
        "entrepreneurship",
        "startups",
        "career",
        "businesses",
        "indie-hacking"
    ],
    "category": "Business & Economics",
    "icon": "FaRocket",
    "featured": false,
    "aliases": [
        "Serial founder",
        "Portfolio entrepreneurship",
        "Multiple ventures"
    ],
    "relatedConcepts": [
        "shotgun-to-sniper-strategy",
        "fail-fast",
        "minimum-viable-product",
        "build-in-public"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Serial entrepreneur - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Serial_entrepreneur",
            "type": "website"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-20",
    "dateModified": "2026-01-29"
}
