{
    "id": "shotgun-to-sniper-strategy",
    "name": "Shotgun to Sniper Strategy",
    "summary": "Entrepreneurial approach of starting broad with many experiments, then focusing intensely on what gains traction.",
    "explanation": "The Shotgun to Sniper Strategy, coined by indie hacker Marc Lou, describes a two-phase approach to finding product-market fit. In the shotgun phase, you spray widely: launch multiple projects, test various ideas, ship MVPs quickly, and add a buy button to everything. The goal is rapid experimentation and data collection, not perfection.\n\nThe key is observing what actually works—not what you think should work or what gets positive feedback, but what gets real traction: purchases, viral growth, and sustained revenue over months. Most ideas won't hit. That's expected. The shotgun phase is about finding the signal amid the noise.\n\nOnce you identify a winner—something that makes money and keeps making money—you switch to sniper mode. Now you focus intensely on that one project. Stop spreading attention across experiments. Double down on what's working. Build features, improve marketing, scale operations, and make it as big as possible.\n\nThis strategy counters two common failure modes: (1) focusing too early on one idea without market validation, spending months building something nobody wants; (2) perpetually experimenting without ever committing, never giving any project the focused attention needed to reach its potential. The shotgun phase finds opportunities; the sniper phase captures them.\n\nFor indie hackers and creators, this means: launch fast, measure ruthlessly, stay emotionally detached during shotgun phase, then commit fully when you find traction.",
    "tags": [
        "entrepreneurship",
        "startups",
        "strategies",
        "product-development",
        "indie-hacking"
    ],
    "category": "Business & Economics",
    "icon": "FaCrosshairs",
    "featured": false,
    "aliases": [
        "Shotgun then sniper",
        "Spray and focus",
        "Explore then exploit"
    ],
    "relatedConcepts": [
        "minimum-viable-product",
        "product-market-fit",
        "fail-fast",
        "build-in-public",
        "pivoting",
        "traction",
        "serial-entrepreneurship"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Marc Lou - Indie Hacker",
            "url": "https://marclou.com/",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-20",
    "dateModified": "2026-01-20"
}
