{
    "id": "situational-awareness",
    "name": "Situational Awareness",
    "summary": "The perception, comprehension, and projection of elements in an environment within a volume of time and space.",
    "explanation": "Situational awareness (SA) is the continuous perception and understanding of what's happening around you, combined with anticipation of what might happen next. Originally developed in aviation and military contexts, the concept applies broadly to any environment where understanding context is critical for effective action.\n\nMica Endsley's three-level model defines SA as: Level 1 - Perception (detecting relevant elements in the environment), Level 2 - Comprehension (understanding what those elements mean), Level 3 - Projection (anticipating future states based on current understanding).\n\nLoss of situational awareness is a leading cause of errors in high-stakes environments. It occurs through: attentional tunneling (focusing on one thing while missing others), task overload (too much to process), fatigue, complacency, and incorrect mental models. The dangerous aspect is that people often don't realize they've lost SA until consequences emerge.\n\nBuilding situational awareness involves: scanning systematically rather than fixating, questioning assumptions regularly, maintaining mental models of how systems work, noticing anomalies and changes, and actively projecting forward ('what happens if...').\n\nFor knowledge workers, situational awareness applies to: understanding organizational dynamics (who has power, what's politically sensitive), reading project status accurately (not just what's reported but what's real), anticipating stakeholder reactions, detecting early warning signs of problems, and navigating complex social and professional environments. The skill separates those who are constantly surprised by events from those who seem to see around corners.",
    "tags": [
        "decision-making",
        "leadership",
        "cognition"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaEye",
    "featured": false,
    "aliases": [
        "SA",
        "Environmental Awareness",
        "Context Awareness"
    ],
    "relatedConcepts": [
        "read-the-room",
        "systems-thinking",
        "mental-models"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Situation awareness - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Situation_awareness",
            "type": "website"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/product/clarity-101",
            "type": "other"
        }
    ],
    "books": [],
    "tutorials": [],
    "datePublished": "2026-01-20",
    "dateModified": "2026-01-20"
}
