{
    "id": "skill-atrophy",
    "name": "Skill Atrophy",
    "summary": "Gradual decline of abilities from lack of deliberate practice or over-reliance on tools that bypass skill use.",
    "explanation": "Skill atrophy is the deterioration of abilities that occurs when skills aren't actively practiced and maintained. Like muscles that weaken without exercise, cognitive and physical skills degrade when unused. This isn't just forgetting—it's the erosion of the neural pathways, muscle memory, and intuitions that make skilled performance possible.\n\nThe phenomenon becomes increasingly relevant in an age of AI assistance and automation. When tools handle tasks we once performed manually, we risk losing the underlying competencies: developers using AI code completion may find their ability to write code from scratch declining; professionals using calculators lose mental math facility; GPS users lose navigation intuition. The convenience is real, but so is the cost.\n\nSkill atrophy follows predictable patterns: first, speed decreases; then accuracy suffers; finally, the ability to perform at all degrades. Recovery is possible but requires deliberate practice to rebuild. The longer skills lie dormant, the more effort recovery requires.\n\nCountering skill atrophy requires intentional practice of foundational abilities, even when tools could handle them. This might mean: coding without AI assistance periodically, doing mental calculations, navigating without GPS, or writing first drafts without editing tools. The goal isn't avoiding useful tools but maintaining the underlying competencies that allow you to evaluate tool outputs, work when tools fail, and continue improving.\n\nFor knowledge workers, this means maintaining judgment and expertise even while leveraging AI—being a skilled reviewer, not just a prompt engineer.",
    "tags": [
        "skills",
        "learning",
        "expertise",
        "technology",
        "deliberate-practice"
    ],
    "category": "Learning & Education",
    "icon": "FaChartLine",
    "featured": false,
    "aliases": [
        "Skills degradation",
        "Competency erosion",
        "Use it or lose it"
    ],
    "relatedConcepts": [
        "deliberate-practice",
        "automation-paradox",
        "cognitive-offloading",
        "automation-bias",
        "vibe-coding",
        "human-in-the-loop"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Skill - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Skill",
            "type": "website"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/l/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://knowledge-management-for-beginners.com",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-20",
    "dateModified": "2026-01-20"
}
