{
    "id": "skill-acquisition",
    "name": "Skill Acquisition",
    "summary": "The process of developing competence in a skill through learning and practice, progressing from novice to expert through distinct stages of development.",
    "explanation": "Skill acquisition is the process of learning and developing proficiency in any skill, from physical abilities to cognitive tasks. The field combines insights from psychology, neuroscience, and motor learning to understand how humans progress from complete beginners to experts.\n\nFitts and Posner's (1967) influential model identifies three stages of skill acquisition. In the cognitive stage, learners consciously focus on understanding what to do, requiring high attention and explicit rule-following. The associative stage involves refining movements and strategies through practice, with gradual error correction. Finally, in the autonomous stage, performance becomes automatic and effortless, requiring minimal conscious attention.\n\nHubert Dreyfus expanded this into a five-stage model (novice, advanced beginner, competent, proficient, expert), emphasizing that true experts transcend explicit rules to act from embodied intuition and situational awareness. This challenges purely analytical approaches to expertise.\n\nAnders Ericsson's research on deliberate practice demonstrates that the quality of practice matters more than mere quantity. Effective skill acquisition requires focused attention, immediate feedback, progressive challenge slightly beyond current abilities, and targeted work on specific weaknesses. This explains why some practitioners with fewer hours of practice can outperform others with more experience.\n\nKey factors in skill acquisition include: receiving timely and accurate feedback, maintaining appropriate challenge levels (neither too easy nor overwhelming), sustaining focused attention during practice, and allowing adequate rest for memory consolidation. The process also connects to debates about the relative contributions of innate talent versus practice in developing expertise.",
    "tags": [
        "learning",
        "psychology",
        "expertise",
        "practice",
        "motor-learning",
        "performance"
    ],
    "category": "Learning & Education",
    "icon": "FaBrain",
    "featured": false,
    "aliases": [
        "Motor Learning"
    ],
    "relatedConcepts": [
        "deliberate-practice",
        "growth-mindset"
    ],
    "relatedNotes": [
        "https://notes.dsebastien.net/33+Permanent+notes/33.02+Content/Skill+Acquisition"
    ],
    "articles": [],
    "books": [
        {
            "title": "Peak by Anders Ericsson",
            "url": "https://www.amazon.com/dp/0544947223?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Skill acquisition - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Skill_acquisition",
            "type": "website"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/l/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://knowledge-management-for-beginners.com",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-28",
    "dateModified": "2026-01-28"
}
