{
    "id": "slacktivism",
    "name": "Slacktivism",
    "summary": "Low-effort online activism such as liking, sharing, or signing petitions that substitutes for meaningful engagement with a cause.",
    "explanation": "Slacktivism refers to the practice of supporting a political or social cause through low-effort actions on social media or the internet, such as liking posts, sharing hashtags, signing online petitions, or changing profile pictures. While these actions may raise awareness, critics argue they often serve as a substitute for more meaningful forms of engagement like volunteering, donating, or organizing.\n\nThe term combines 'slacker' and 'activism,' reflecting the tension between feeling good about participating and actually creating change. Research on slacktivism reveals mixed findings: some studies show that token gestures of support can satisfy people's desire to help, reducing their motivation to take further action (a form of moral licensing). Other research suggests that small online actions can serve as a gateway to deeper engagement.\n\n**Key Characteristics**:\n\n- **Low cost**: Requires minimal time, effort, or sacrifice\n- **High visibility**: Publicly signals the person's values to their social network\n- **Feel-good factor**: Provides a sense of contribution without meaningful commitment\n- **Scalability**: Can rapidly spread awareness through network effects\n\n**The Debate**:\n\nCritics argue slacktivism creates an illusion of impact while diverting energy from effective action. Supporters counter that raising awareness has value, that small actions can build toward larger movements, and that dismissing online activism ignores how modern social movements actually organize.\n\n**When Slacktivism Becomes Harmful**:\n\n1. When it replaces rather than supplements real action\n2. When it creates false confidence that problems are being addressed\n3. When it drowns out voices of those directly affected by issues\n4. When it becomes performative rather than genuine\n\nUnderstanding slacktivism helps evaluate whether online engagement is contributing to real change or merely serving as a low-cost way to feel virtuous.",
    "tags": [
        "social-psychology",
        "social-media",
        "behaviors",
        "activism",
        "ethics"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaThumbsUp",
    "featured": false,
    "aliases": [
        "Clicktivism",
        "Armchair activism",
        "Hashtag activism"
    ],
    "relatedConcepts": [
        "virtue-signaling",
        "performative-activism",
        "moral-licensing",
        "signaling",
        "social-proof"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "The Net Delusion by Evgeny Morozov",
            "url": "https://www.amazon.com/dp/1610391063?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Slacktivism - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Slacktivism",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-20",
    "dateModified": "2026-02-20"
}
