{
    "id": "slippery-slope",
    "name": "Slippery Slope",
    "summary": "A logical argument or fallacy claiming that one small step will inevitably lead to a chain of negative consequences.",
    "explanation": "The slippery slope is a type of argument that asserts that a relatively small first step will inevitably lead to a chain of related events culminating in a significant and often negative outcome. It is sometimes called the thin end of the wedge or the camel's nose in the tent.\n\nAs a logical fallacy, the slippery slope occurs when someone argues against a course of action by claiming — without sufficient evidence — that it will trigger an unstoppable cascade of increasingly extreme consequences. For example, arguing that allowing flexible work hours will lead to nobody showing up at all. The fallacy lies in treating each step as inevitable without establishing the causal links.\n\nHowever, not all slippery slope arguments are fallacious. In some cases, there are genuine mechanisms that create momentum toward escalation: precedent-setting in law, habituation in behavior, institutional inertia in policy, or positive feedback loops in systems. When these mechanisms are clearly identified and supported by evidence, slippery slope reasoning can be valid and valuable.\n\nThe concept is important in critical thinking because it appears frequently in debates about policy, ethics, technology, and personal boundaries. Recognizing when a slippery slope argument is valid versus fallacious requires evaluating whether the claimed chain of causation is plausible, whether there are natural stopping points, and whether the intermediate steps can be independently controlled.\n\nRelated concepts include the domino effect (where sequential causation is real), the boiling frog (gradual change going unnoticed), and creeping normality (where gradual shifts redefine what is considered acceptable).",
    "tags": [
        "critical-thinking",
        "logic",
        "persuasion",
        "mental-models",
        "decision-making"
    ],
    "category": "Thinking",
    "icon": "FaExclamationTriangle",
    "featured": false,
    "aliases": [
        "Thin end of the wedge",
        "Camel's nose",
        "Domino fallacy",
        "Slippery slope fallacy"
    ],
    "relatedConcepts": [
        "gateway-drug",
        "domino-effect",
        "boiling-frog",
        "creeping-normality",
        "logical-fallacies",
        "escalation-of-commitment",
        "tipping-point",
        "overton-window"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Slippery slope - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Slippery_slope",
            "type": "website"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/product/clarity-101",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-11",
    "dateModified": "2026-02-11"
}
