{
    "id": "social-intelligence",
    "name": "Social Intelligence",
    "summary": "The capacity to effectively navigate and negotiate complex social relationships and environments.",
    "explanation": "Social intelligence is the ability to understand social situations and dynamics, and to use that understanding to achieve desired outcomes in interpersonal interactions. Psychologist Edward Thorndike first described it in 1920 as 'the ability to understand and manage men and women' - though we'd now say 'people.'\n\nComponents of social intelligence include: social awareness (perceiving others' emotions, understanding social dynamics, reading nonverbal cues), social facility (interacting smoothly, presenting oneself effectively, influencing others), and social cognition (understanding why people behave as they do, predicting reactions).\n\nSocial intelligence versus related concepts: IQ measures cognitive ability; emotional intelligence focuses on recognizing and managing emotions; social intelligence emphasizes successful navigation of social environments. These overlap but aren't identical - someone might understand emotions (EQ) but struggle to act effectively in complex social situations (SQ).\n\nHigh social intelligence manifests as: making others feel at ease, adapting communication to different audiences, building rapport quickly, navigating organizational politics effectively, resolving conflicts, and influencing without formal authority.\n\nDeveloping social intelligence requires: observing social dynamics closely, practicing perspective-taking, seeking feedback on interpersonal impact, studying what works for socially skilled people, and reflecting on social successes and failures.\n\nFor knowledge workers, social intelligence is increasingly important as: technical skills become table stakes, collaboration increases in importance, influence matters more than authority, and careers depend on relationships and reputation. Technical excellence without social intelligence limits impact and advancement.",
    "tags": [
        "emotional-intelligence",
        "communications",
        "leadership"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaUserFriends",
    "featured": false,
    "aliases": [
        "Interpersonal Intelligence",
        "Social Competence",
        "People Skills"
    ],
    "relatedConcepts": [
        "emotional-intelligence",
        "read-the-room",
        "empathic-listening",
        "active-listening",
        "small-talk"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Social intelligence - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Social_intelligence",
            "type": "website"
        }
    ],
    "books": [
        {
            "title": "Social Intelligence by Daniel Goleman",
            "url": "https://www.amazon.com/dp/055338449X"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-20",
    "dateModified": "2026-01-30"
}
