{
    "id": "social-psychology",
    "name": "Social Psychology",
    "summary": "The scientific study of how people's thoughts, feelings, and behaviors are influenced by the real, imagined, or implied presence of others.",
    "explanation": "Social psychology examines how individuals think about, influence, and relate to one another. It bridges the gap between psychology and sociology by focusing on how social contexts shape individual behavior while also exploring how individuals collectively create social phenomena.\n\nKey topics in social psychology include social cognition (how we perceive and interpret information about ourselves and others), attitudes and persuasion, conformity and obedience, group dynamics, prejudice and discrimination, interpersonal attraction, and prosocial behavior. The field also studies aggression, social identity, and how cultural factors influence psychological processes.\n\nSome of the most famous experiments in psychology come from social psychology. Stanley Milgram's obedience experiments demonstrated how ordinary people would administer what they believed were painful electric shocks when instructed by an authority figure. Solomon Asch's conformity experiments showed that people would give obviously wrong answers to match a group's incorrect responses. Philip Zimbardo's Stanford Prison Experiment revealed how quickly people adopt roles and how situational factors can override individual personality.\n\nSocial psychology has profound practical applications in understanding and addressing real-world problems such as prejudice reduction, promoting prosocial behavior, improving communication, designing effective public health campaigns, and creating healthier organizational cultures. It reminds us that human behavior cannot be fully understood without considering the social context in which it occurs.",
    "tags": [
        "psychology",
        "social-psychology",
        "behaviors",
        "group-dynamics",
        "influence",
        "relationships"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaUsers",
    "featured": false,
    "aliases": [
        "Social Psych"
    ],
    "relatedConcepts": [
        "groupthink",
        "behavioral-economics",
        "cognitive-biases",
        "bystander-effect"
    ],
    "relatedNotes": [
        "https://notes.dsebastien.net/30+Areas/33+Permanent+notes/33.02+Content/Social+Psychology"
    ],
    "articles": [],
    "books": [
        {
            "title": "Influence by Robert Cialdini",
            "url": "https://www.amazon.com/dp/006124189X?tag=dsebastien00-20"
        },
        {
            "title": "The Social Animal by Elliot Aronson",
            "url": "https://www.amazon.com/dp/1464144184?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Social psychology - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Social_psychology",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-28",
    "dateModified": "2026-01-28"
}
