{
    "id": "social-scripts",
    "name": "Social Scripts",
    "summary": "Predetermined behavioral sequences and expectations that guide interactions and life choices in social situations.",
    "explanation": "Social scripts are the unwritten rules and expected sequences of behavior that guide how we act in social situations. Like a script for an actor, they tell us what to say, how to behave, and what comes next in various social contexts - from ordering coffee to conducting job interviews to planning major life milestones.\n\nThese scripts operate at multiple levels:\n\n**Micro-scripts** govern everyday interactions: greeting patterns, small talk conventions, restaurant behavior, and conversation turn-taking. They reduce cognitive load and create predictable, smooth social exchanges.\n\n**Life scripts** are broader narratives that dictate major life decisions: graduate school, find a career, get married, buy a house, have children, retire. These scripts are culturally transmitted and often internalized so deeply that following them feels like personal choice rather than social programming.\n\nSocial scripts serve important functions: they reduce anxiety in uncertain situations, enable coordination between strangers, maintain social order, and preserve cultural knowledge. Without them, every interaction would require exhausting negotiation.\n\nHowever, scripts become problematic when followed blindly. People may pursue careers, relationships, or lifestyles that don't match their authentic desires simply because 'that's what you're supposed to do.' The student who becomes a doctor because their parents expected it, the person who marries at 28 because 'it's time,' or the retiree who feels lost because their script has ended - all illustrate the costs of unreflective script-following.\n\nDeveloping script awareness involves: recognizing which behaviors are scripted versus chosen, questioning whether particular scripts serve your authentic goals, consciously deviating from scripts when they don't fit, and writing your own scripts for life's uncharted territories.\n\nThe goal isn't to abandon all scripts - they're often useful - but to follow them consciously rather than automatically, as the author of your life rather than merely an actor reciting lines.",
    "tags": [
        "psychology",
        "social-psychology",
        "behavior",
        "awareness",
        "conformity",
        "decision-making",
        "autonomy"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaScroll",
    "featured": false,
    "aliases": [
        "Behavioral Scripts",
        "Cultural Scripts",
        "Life Scripts",
        "Social Programming"
    ],
    "relatedConcepts": [
        "npc-mindset",
        "living-on-default",
        "bandwagon-effect",
        "existential-authenticity",
        "mimetic-desire",
        "status-quo-bias",
        "life-design",
        "examined-life"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Scripts, Plans, Goals, and Understanding by Roger Schank and Robert Abelson",
            "url": "https://www.amazon.com/dp/0898591384?tag=dsebastien00-20"
        },
        {
            "title": "The Presentation of Self in Everyday Life by Erving Goffman",
            "url": "https://www.amazon.com/dp/0385094027?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Social script - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Social_script",
            "type": "website"
        },
        {
            "title": "Script theory - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Script_theory",
            "type": "website"
        },
        {
            "title": "Dramaturgical analysis - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Dramaturgical_analysis",
            "type": "website"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/product/clarity-101",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-16",
    "dateModified": "2026-01-18"
}
