{
    "id": "somatic-marker-hypothesis",
    "name": "Somatic Marker Hypothesis",
    "summary": "Theory that bodily sensations (somatic markers) guide decision-making by associating emotional responses with past outcomes.",
    "explanation": "The Somatic Marker Hypothesis, proposed by neuroscientist Antonio Damasio, suggests that emotions and their bodily manifestations play a crucial role in decision-making. When we face choices, our bodies generate physiological responses—increased heart rate, sweaty palms, gut sensations—that are 'markers' of past experiences with similar situations. These markers help us rapidly evaluate options by signaling whether an outcome felt good or bad previously.\n\nDamasio developed this theory after studying patients with damage to the ventromedial prefrontal cortex, who could reason logically but made disastrous real-life decisions. Despite intact intelligence, they couldn't use emotional signals to guide choices. This revealed that pure rationality without emotional input leads to poor decision-making, especially in complex, uncertain situations.\n\nThe hypothesis distinguishes between the 'body loop'—actual physiological changes—and the 'as-if loop'—the brain simulating these body states without full physical manifestation. Both can influence decisions. The Iowa Gambling Task, a key experimental paradigm, showed that healthy participants developed 'hunches' about risky options before they could consciously explain why, demonstrating that somatic markers work below conscious awareness.\n\nFor practical application, this means trusting gut feelings, especially in domains where you have experience. Pay attention to bodily sensations when facing decisions—they encode wisdom from past experiences. However, somatic markers can also be misleading if past experiences were atypical or if you lack relevant experience. The key is integration: use emotional signals as important data alongside rational analysis, not as replacements for it.",
    "tags": [
        "decision-making",
        "neuroscience",
        "psychology",
        "emotions",
        "thinking"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaHeartbeat",
    "featured": false,
    "aliases": [
        "Somatic Markers",
        "Body-Based Decision Making",
        "Damasio's Hypothesis"
    ],
    "relatedConcepts": [
        "gut-feeling",
        "interoception",
        "two-system-thinking",
        "prefrontal-cortex"
    ],
    "relatedNotes": [
        "https://notes.dsebastien.net/30+Areas/33+Permanent+notes/33.02+Content/Gut+feeling",
        "https://notes.dsebastien.net/30+Areas/33+Permanent+notes/33.02+Content/You+cannot+choose+well+if+you+choose+only+using+your+rational+mind"
    ],
    "articles": [],
    "books": [
        {
            "title": "Descartes' Error by Antonio Damasio",
            "url": "https://www.amazon.com/dp/014303622X"
        },
        {
            "title": "The Feeling of What Happens by Antonio Damasio",
            "url": "https://www.amazon.com/dp/0156010755"
        },
        {
            "title": "Looking for Spinoza by Antonio Damasio",
            "url": "https://www.amazon.com/dp/0156028719"
        }
    ],
    "references": [
        {
            "title": "Somatic Marker Hypothesis - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Somatic_marker_hypothesis",
            "type": "website"
        },
        {
            "title": "The somatic marker hypothesis and the possible functions of the prefrontal cortex",
            "url": "https://pubmed.ncbi.nlm.nih.gov/8941953/",
            "type": "paper"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/l/knowii-clarity-101",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-25",
    "dateModified": "2026-01-25"
}
