{
    "id": "somatic-experiencing",
    "name": "Somatic Experiencing",
    "summary": "Body-oriented therapeutic approach for resolving trauma by releasing stored physical tension and completing defensive responses.",
    "explanation": "Somatic Experiencing (SE) is a body-focused therapeutic approach developed by Dr. Peter Levine for treating trauma and stress disorders. It's based on the observation that animals in the wild rarely develop trauma despite frequent life-threatening experiences - they naturally discharge survival energy through physical responses.\n\nCore premise: Trauma isn't caused by the event itself but by the incomplete physiological response to the threat. When fight, flight, or freeze responses are interrupted or suppressed, the survival energy remains trapped in the body, causing ongoing symptoms.\n\nKey concepts in SE:\n\n1. Pendulation: Gently oscillating between sensations of distress and calm, building capacity to tolerate difficult experiences\n\n2. Titration: Working with trauma in small, manageable doses rather than overwhelming catharsis\n\n3. Discharge: Allowing the body to complete interrupted defensive responses through trembling, shaking, breathing changes, or movement\n\n4. Felt sense: Attending to the whole-body experience of sensations, images, and emotions\n\n5. Resourcing: Building internal and external sources of safety and stability\n\nHow SE differs from talk therapy: Rather than focusing on narrative or cognitive processing, SE tracks bodily sensations and helps complete physiological responses. The body leads the healing process.\n\nApplications: PTSD, developmental trauma, anxiety, chronic pain, phobias, and stress-related conditions.\n\nSE sessions involve: Tracking body sensations, noticing impulses toward movement, allowing natural discharge responses, and building nervous system resilience - all within a safe, titrated framework.\n\nSE is typically practiced with trained practitioners but some principles can inform self-care and body awareness.",
    "tags": [
        "trauma",
        "therapy",
        "body",
        "psychology",
        "well-being"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaHandHoldingHeart",
    "featured": false,
    "aliases": [
        "SE therapy",
        "Levine method",
        "Somatic trauma therapy"
    ],
    "relatedConcepts": [
        "polyvagal-theory",
        "nervous-system-regulation",
        "interoception",
        "felt-sense",
        "grounding",
        "window-of-tolerance"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Waking the Tiger by Peter Levine",
            "url": "https://www.amazon.com/dp/155643233X?tag=dsebastien00-20"
        },
        {
            "title": "In an Unspoken Voice by Peter Levine",
            "url": "https://www.amazon.com/dp/1556439431?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Somatic experiencing - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Somatic_experiencing",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-29",
    "dateModified": "2026-01-29"
}
