{
    "id": "source-criticism",
    "name": "Source Criticism",
    "summary": "The systematic evaluation of information sources for reliability, credibility, and bias to determine their trustworthiness.",
    "explanation": "Source criticism is the disciplined practice of evaluating the reliability, credibility, and trustworthiness of information sources before accepting or using the information they contain. Rather than taking claims at face value, source criticism involves systematically questioning where information comes from, who produced it, why it was created, and whether it can be corroborated by independent evidence.\n\nOne of the most widely used frameworks for evaluating sources is the CRAAP test, which examines five dimensions: Currency (how recent is the information?), Relevance (does it relate to your topic?), Authority (who is the author and what are their credentials?), Accuracy (is the information supported by evidence?), and Purpose (why does this information exist - to inform, persuade, sell, or entertain?). This structured approach helps move evaluation from gut feeling to systematic analysis.\n\nUnderstanding the hierarchy of sources is also essential. Primary sources provide direct, firsthand evidence (original research, eyewitness accounts, raw data). Secondary sources analyze, interpret, or synthesize primary sources (review articles, textbooks, biographies). Tertiary sources compile and summarize secondary sources (encyclopedias, dictionaries). Each level introduces additional layers of interpretation, and knowing which type you are working with helps calibrate how much trust to place in its claims.\n\nIdentifying bias and conflicts of interest is a core skill in source criticism. Every source has a perspective shaped by its author's background, funding sources, organizational affiliation, and intended audience. The goal is not to find perfectly unbiased sources - those rarely exist - but to recognize what biases are present and account for them. Financial conflicts of interest, ideological commitments, and institutional pressures all shape how information is presented.\n\nIn the digital age, evaluating sources requires additional considerations. Domain authority, author credentials, peer review status, publication reputation, and the presence of citations all serve as quality signals. Lateral reading - the practice of leaving a source to check what other sources say about it - has proven more effective than vertical reading (closely analyzing a single source in isolation). Professional fact-checkers use lateral reading as their primary strategy.\n\nSource criticism has become increasingly important in an era of widespread misinformation, deepfakes, and AI-generated content. The ability to distinguish reliable information from unreliable information is no longer just an academic skill - it is a fundamental competency for navigating everyday life, making informed decisions, and participating meaningfully in democratic society.",
    "tags": [
        "techniques",
        "critical-thinking",
        "research",
        "information-management"
    ],
    "category": "Techniques",
    "icon": "FaSearch",
    "featured": false,
    "aliases": [
        "Source evaluation",
        "Source analysis",
        "Critical source evaluation"
    ],
    "relatedConcepts": [
        "critical-thinking",
        "information-literacy",
        "media-literacy",
        "information-filtering",
        "cognitive-biases"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Source criticism - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Source_criticism",
            "type": "website"
        },
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Personal Knowledge Management Library",
            "url": "https://store.dsebastien.net/product/pkm-library",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-22",
    "dateModified": "2026-02-22"
}
