{
    "id": "stanford-prison-experiment",
    "name": "Stanford Prison Experiment",
    "summary": "A landmark 1971 psychology study demonstrating how situational forces and assigned roles can dramatically alter human behavior, even leading ordinary people to act cruelly.",
    "explanation": "The Stanford Prison Experiment was a psychological study conducted by Philip Zimbardo at Stanford University in August 1971. The experiment examined how social roles and situational factors influence human behavior by simulating a prison environment with volunteer participants randomly assigned as either guards or prisoners. The study became one of the most famous and controversial experiments in psychology, revealing disturbing insights about the power of situations to shape behavior.\n\nTwenty-four male college students were selected from a larger group of volunteers based on psychological stability and lack of criminal background. They were randomly assigned to play either guards or prisoners in a mock prison constructed in the basement of Stanford's psychology building. Prisoners were \"arrested\" at their homes, processed like real inmates, and given numbers instead of names. Guards were given uniforms, mirrored sunglasses, and authority over the prisoners.\n\nWithin just a few days, the experiment spiraled beyond expectations. Guards began engaging in psychological abuse, imposing arbitrary punishments, and dehumanizing prisoners. Some guards became sadistic, forcing prisoners to perform degrading tasks and subjecting them to sleep deprivation. Prisoners, meanwhile, began showing signs of severe emotional distress, with some experiencing breakdowns. Several prisoners had to be released early due to extreme stress reactions.\n\nThe experiment was scheduled to last two weeks but was terminated after only six days. Christina Maslach, a graduate student and Zimbardo's future wife, visited the experiment and was horrified by what she witnessed, convincing Zimbardo to end it early. The rapid descent into cruelty shocked researchers and demonstrated how quickly ordinary people could adopt abusive behaviors when placed in certain situations.\n\nZimbardo drew several conclusions from the experiment. He argued that behavior is powerfully influenced by situational forces rather than just individual dispositions - what he called the \"Lucifer Effect.\" The study suggested that good people can do terrible things when placed in bad situations, challenging notions of fixed character traits. It highlighted how roles, rules, and power dynamics can transform behavior.\n\nThe experiment has faced significant criticism over the years. Methodological concerns include the lack of control conditions, demand characteristics (participants knew what was expected), and Zimbardo's dual role as researcher and prison superintendent. Recent investigations have revealed that some guard behavior was encouraged by experimenters, and some participant accounts suggest more acting than genuine psychological transformation. Some prisoners reported exaggerating their distress to be released.\n\nDespite controversies, the Stanford Prison Experiment remains influential in discussions of authority, obedience, dehumanization, and institutional power. It has been cited in analyses of real-world abuses including Abu Ghraib prison. The study contributed to reforms in research ethics and informed understanding of how systemic factors can enable misconduct. Whether viewed as rigorous science or cautionary demonstration, it continues to provoke important conversations about human nature and institutional design.",
    "tags": [
        "psychology",
        "social-psychology",
        "authority",
        "power",
        "ethics",
        "experiments",
        "group-dynamics"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaBrain",
    "featured": false,
    "aliases": [
        "Zimbardo Prison Experiment",
        "SPE"
    ],
    "relatedConcepts": [
        "authority-bias",
        "bystander-effect",
        "heroic-imagination"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "The Lucifer Effect: Understanding How Good People Turn Evil by Philip Zimbardo",
            "url": "https://www.amazon.com/dp/0812974441?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Stanford Prison Experiment - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Stanford_prison_experiment",
            "type": "website"
        },
        {
            "title": "Stanford Prison Experiment Official Website",
            "url": "https://www.prisonexp.org/",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-15",
    "dateModified": "2026-01-15"
}
