{
    "id": "status-games",
    "name": "Status Games",
    "summary": "Competition for social position and hierarchical standing within a group or society.",
    "explanation": "Status games are the ongoing competitions humans engage in to establish, maintain, or improve their position in social hierarchies. Unlike wealth creation, which can be positive-sum (your gain doesn't require my loss), status is inherently zero-sum: there's only one top position, and rising in rank necessarily means others fall relatively. Status games manifest in countless ways: competing for job titles, accumulating followers, displaying achievements, name-dropping connections, one-upping in conversations, or signaling membership in elite groups. While some status competition motivates genuine achievement, much of it is purely positional - effort spent on relative standing rather than absolute improvement. The problem with status games is their futility: you can win locally but the game never ends, new hierarchies always emerge, and the hedonic boost from status gains quickly fades. Naval Ravikant distinguishes status games (zero-sum, competitive) from wealth games (positive-sum, creative): playing status games means attacking others, while wealth games mean building things. Recognizing status games helps you: opt out of competitions that don't serve your goals, focus on absolute rather than relative progress, and avoid the trap of measuring yourself against constantly shifting benchmarks.",
    "tags": [
        "psychology",
        "social-psychology",
        "status",
        "competition",
        "zero-sum-games"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaTrophy",
    "featured": false,
    "aliases": [
        "Status competition",
        "Social status games",
        "Hierarchy games"
    ],
    "relatedConcepts": [
        "signaling",
        "conspicuous-consumption",
        "money-game-vs-status-game",
        "hedonic-adaptation",
        "positive-sum-game"
    ],
    "relatedNotes": [
        "https://notes.dsebastien.net/30+Areas/33+Permanent+notes/33.02+Content/Money+game+vs+status+game"
    ],
    "articles": [],
    "books": [
        {
            "title": "The Almanack of Naval Ravikant by Eric Jorgenson",
            "url": "https://www.amazon.com/dp/1544514212?tag=dsebastien00-20"
        },
        {
            "title": "The Status Game by Will Storr",
            "url": "https://www.amazon.com/dp/0063270358?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Social status - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Social_status",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-13",
    "dateModified": "2026-01-13"
}
