{
    "id": "story-circle",
    "name": "Story Circle",
    "summary": "An eight-step narrative framework created by Dan Harmon that simplifies Joseph Campbell's Hero's Journey into a circular structure for crafting compelling stories.",
    "explanation": "The Story Circle is a storytelling framework developed by television writer Dan Harmon, best known for creating Community and co-creating Rick and Morty. It distills Joseph Campbell's complex monomyth (the Hero's Journey) into eight accessible steps arranged in a circle, making it particularly useful for writers who need to craft multiple stories quickly, such as in episodic television.\n\nThe eight steps of the Story Circle are:\n\n1. **You (Comfort Zone)**: A character exists in their ordinary world, comfortable and familiar with their surroundings. This establishes the baseline from which change will be measured.\n\n2. **Need (Desire)**: The character wants something—a goal, desire, or need emerges that disrupts their contentment. This want drives the entire narrative forward.\n\n3. **Go (Unfamiliar Situation)**: The character crosses a threshold into an unfamiliar situation or world. They leave their comfort zone, either by choice or by force.\n\n4. **Search (Adaptation)**: The character must adapt to this new environment. They face challenges, learn new skills, and navigate the unfamiliar terrain, often encountering allies and enemies.\n\n5. **Find (Achievement)**: The character gets what they wanted. They achieve their goal, obtain the object of their desire, or reach the destination they sought.\n\n6. **Take (Price)**: Victory comes at a heavy cost. The character must pay a price for what they've gained—sacrifice, loss, or unintended consequences emerge.\n\n7. **Return (Going Back)**: The character returns to their familiar world, bringing with them what they've gained (or lost). The journey homeward begins.\n\n8. **Change (Transformation)**: The character has been fundamentally changed by their journey. They are no longer the same person who left, and their world may also be different as a result.\n\nThe circular arrangement is significant. The top of the circle represents order, comfort, and the conscious mind, while the bottom represents chaos, the unknown, and the unconscious. Characters descend into chaos (steps 3-6) and must rise back to order (steps 7-8), transformed by their experience. This mirrors psychological concepts of growth through confronting the shadow self.\n\nHarmon used this framework extensively in Community, where each episode follows characters through mini-journeys of growth, and in Rick and Morty, where even the most absurd adventures follow this emotional structure. The framework excels in episodic television because it creates satisfying self-contained arcs while allowing for ongoing character development across seasons.\n\nBeyond television, the Story Circle applies to film, novels, video games, marketing narratives, and even personal development. Its simplicity makes it a powerful diagnostic tool—when a story feels broken, mapping it to the circle often reveals which step is weak or missing. The framework reminds writers that audiences connect not just with plot events, but with the emotional journey of transformation.",
    "tags": [
        "storytelling",
        "writing",
        "narrative",
        "television",
        "frameworks",
        "screenwriting",
        "character-development"
    ],
    "category": "Frameworks",
    "icon": "FaCircle",
    "featured": false,
    "aliases": [
        "Dan Harmon's Story Circle",
        "Harmon Story Circle",
        "Harmon's Story Circle"
    ],
    "relatedConcepts": [
        "heros-journey",
        "three-act-structure",
        "story-arcs"
    ],
    "relatedNotes": [],
    "references": [
        {
            "title": "Dan Harmon's Story Circle explained",
            "url": "https://blog.reedsy.com/guide/story-structure/dan-harmon-story-circle/",
            "type": "website"
        },
        {
            "title": "Story Circle - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Story_Circle_(narrative)",
            "type": "website"
        },
        {
            "title": "AI Ghostwriter Guide",
            "url": "https://store.dsebastien.net/product/ai-ghostwriter-guide",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        }
    ],
    "articles": [],
    "books": [
        {
            "title": "The Hero with a Thousand Faces by Joseph Campbell",
            "url": "https://www.amazon.com/dp/1577315936?tag=dsebastien00-20"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-19",
    "dateModified": "2026-01-19"
}
