{
  "id": "story-spine",
  "name": "Story Spine",
  "summary": "A storytelling framework using eight sentence prompts to create compelling narratives with clear causality and emotional arcs.",
  "explanation": "The Story Spine is a storytelling template created by playwright and improvisation teacher Kenn Adams in the 1990s. Originally developed as a tool for theatrical improvisation, it gained widespread recognition after being adopted by Pixar Animation Studios as a core technique for developing their acclaimed films.\n\nThe framework consists of eight sequential prompts that guide storytellers through a complete narrative arc:\n\n1. **Once upon a time...** - Establishes the world and introduces the protagonist in their ordinary circumstances.\n2. **Every day...** - Describes the routine or status quo, showing what normal life looks like for the character.\n3. **But one day...** - Introduces the inciting incident that disrupts the equilibrium and sets the story in motion.\n4. **Because of that...** - Shows the first consequence or reaction to the disruption.\n5. **Because of that...** - Continues the chain of cause and effect, building tension and stakes.\n6. **Because of that...** - Further escalates the situation through logical consequences.\n7. **Until finally...** - Delivers the climax where the central conflict reaches its peak.\n8. **And ever since then...** - Provides resolution and shows how the world has changed, often revealing the moral or theme.\n\nThe genius of the Story Spine lies in two critical words: \"But\" and \"Because of that.\" The word \"But\" signals a dramatic shift that breaks the established pattern, creating conflict and engagement. The repeated \"Because of that\" phrases enforce strict causality, ensuring that each story beat flows logically from the previous one rather than simply happening in sequence. This transforms a mere series of events into a cohesive narrative where actions have meaningful consequences.\n\nPixar has famously used this framework during story development, with their films demonstrating its power to create emotionally resonant narratives. The structure works because it mirrors how humans naturally process and remember stories, with clear setups, escalating tension, and satisfying resolutions.\n\nBeyond filmmaking, the Story Spine has practical applications in business presentations, product pitches, brainstorming sessions, and personal communication. When presenting an idea, the framework helps structure the message with a compelling hook, clear problem statement, logical progression of solutions, and memorable conclusion. It transforms dry information into engaging narratives that audiences can follow and remember.\n\nThe framework is particularly valuable for brainstorming because it forces creators to think through the logical implications of their ideas. By requiring each beat to cause the next, it reveals plot holes, identifies missing elements, and ensures that stories have genuine stakes and meaningful change.",
  "tags": [
    "storytelling",
    "writing",
    "narrative",
    "creativity",
    "frameworks",
    "communications",
    "presentations"
  ],
  "category": "Frameworks",
  "icon": "FaBook",
  "featured": false,
  "aliases": [
    "Pixar Story Spine",
    "Kenn Adams Story Spine"
  ],
  "relatedConcepts": [
    "story-arcs",
    "narrative-structure",
    "heros-journey"
  ],
  "relatedNotes": [],
  "references": [
    {
      "title": "Story spine - Wikipedia",
      "url": "https://en.wikipedia.org/wiki/Story_spine",
      "type": "website"
    },
    {
      "title": "AI Ghostwriter Guide",
      "url": "https://store.dsebastien.net/product/ai-ghostwriter-guide",
      "type": "other"
    },
    {
      "title": "Obsidian Starter Kit",
      "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
      "type": "other"
    },
    {
      "title": "Obsidian Starter Course",
      "url": "https://store.dsebastien.net/product/obsidian-starter-course",
      "type": "other"
    },
    {
      "title": "Knowledge Management for Beginners",
      "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
      "type": "other"
    },
    {
      "title": "Knowii Community",
      "url": "https://store.dsebastien.net/product/knowii-community",
      "type": "other"
    }
  ],
  "articles": [],
  "books": [],
  "tutorials": [],
  "datePublished": "2026-01-19",
  "dateModified": "2026-01-29"
}
