{
    "id": "structured-journaling",
    "name": "Structured Journaling",
    "summary": "An approach to journaling that uses templates, prompts, and predefined frameworks to guide and organize journal entries.",
    "explanation": "Structured journaling is the practice of using predefined templates, questions, and organizational frameworks to guide your writing, as opposed to freeform or stream-of-consciousness journaling. By providing a consistent structure, this approach reduces the friction of starting, ensures important areas of reflection are covered, and makes entries easier to review and compare over time.\n\nPopular structured journaling frameworks include the Five-Minute Journal (which uses morning gratitude and intention prompts alongside evening reflection questions), adapted morning pages with guided themes, and custom templates designed around specific goals such as habit tracking, project retrospectives, or emotional check-ins.\n\nThe benefits of structured journaling over freeform approaches include consistency (you are less likely to skip entries when a template removes the blank-page problem), targeted reflection (prompts direct your attention to areas you might otherwise overlook), and measurability (standardized entries allow you to track changes and patterns across time).\n\nHowever, structure should serve rather than constrain. The most effective approach is often to create or adapt templates that match your personal goals and evolve them as your needs change. Some practitioners combine structured and freeform sections — using templates for recurring reflections while leaving space for open-ended exploration. The key is finding the right balance between guidance and freedom that keeps your practice sustainable and meaningful.",
    "tags": [
        "journaling",
        "templates",
        "habits",
        "frameworks"
    ],
    "category": "Journaling",
    "icon": "FaClipboardList",
    "featured": false,
    "aliases": [
        "Template journaling",
        "Guided journaling"
    ],
    "relatedConcepts": [
        "journaling",
        "templates",
        "bullet-journal",
        "journal-prompts",
        "daily-notes"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Journaling Deep Dive Workshop",
            "url": "https://store.dsebastien.net/product/journaling-deep-dive",
            "type": "other"
        },
        {
            "title": "Personal Organization 101 Workshop",
            "url": "https://store.dsebastien.net/product/personal-organization-101",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-22",
    "dateModified": "2026-02-22"
}
