{
    "id": "synectics",
    "name": "Synectics",
    "summary": "Creative problem-solving method that uses analogies and metaphors to make the familiar strange and the strange familiar.",
    "explanation": "Synectics is a creative problem-solving methodology developed by William J.J. Gordon in the 1960s. The term comes from Greek, meaning \"the joining together of different and apparently irrelevant elements.\" The method systematically uses analogies and metaphors to generate innovative solutions.\n\nCore principle: Synectics works by making the familiar strange (seeing common things in new ways) and the strange familiar (making unknown problems approachable through analogy). This dual movement breaks fixed thinking patterns.\n\nFour types of analogies used in Synectics:\n\n1. Direct Analogy: Finding parallel situations in other fields. \"How does nature solve this?\" or \"What other industry faces similar challenges?\"\n\n2. Personal Analogy: Imagining yourself as the problem or element. \"If I were the product, how would I feel being used?\" This creates empathetic understanding.\n\n3. Symbolic Analogy: Using images, metaphors, or symbols. \"What color is this problem?\" or \"If this challenge were an animal, what would it be?\"\n\n4. Fantasy Analogy: Suspending reality to imagine ideal solutions. \"In a perfect world, how would this work?\" This bypasses practical constraints temporarily.\n\nThe Synectics process: Define the problem, generate analogies across multiple domains, explore how those analogies function, transfer insights back to the original problem, and develop solutions based on the transferred concepts.\n\nSynectics differs from brainstorming by using structured analogical thinking rather than free association. It's particularly effective for technical problems, product innovation, and situations where incremental thinking has plateaued.",
    "tags": [
        "creativity",
        "problem-solving",
        "analogies",
        "innovation"
    ],
    "category": "Techniques",
    "icon": "FaProjectDiagram",
    "featured": false,
    "aliases": [
        "Analogical problem solving",
        "Gordon method"
    ],
    "relatedConcepts": [
        "lateral-thinking",
        "divergent-thinking",
        "convergent-thinking",
        "forced-connections"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Synectics: The Development of Creative Capacity by William J.J. Gordon",
            "url": "https://www.amazon.com/dp/0020131003?tag=dsebastien00-20"
        },
        {
            "title": "The Practice of Creativity by George M. Prince",
            "url": "https://www.amazon.com/dp/0060134216?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Synectics - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Synectics",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-29",
    "dateModified": "2026-01-29"
}
