{
    "id": "task-switching-cost",
    "name": "Task Switching Cost",
    "summary": "The hidden cognitive penalty incurred when shifting attention between different tasks, resulting in decreased performance and lost time.",
    "explanation": "Task switching cost, also known as switch cost, refers to the measurable decrease in speed and accuracy that occurs when a person alternates between different tasks. Research in cognitive psychology has consistently demonstrated that the brain cannot truly perform multiple cognitive tasks simultaneously. Instead, it rapidly switches between them, incurring a performance penalty with each transition.\n\nSophie Leroy's research on attention residue revealed that when people switch from Task A to Task B, their attention does not immediately and fully transfer. A residue of their thoughts about Task A continues to occupy cognitive resources, reducing their effectiveness on Task B. This residue is particularly strong when Task A was left incomplete or when there was no clear stopping point.\n\nFor complex knowledge work, estimates suggest it can take 15 to 25 minutes to fully re-engage with a task after an interruption or switch. This means that frequent switching throughout the day can result in hours of lost productive time, even though each individual switch may seem brief. The cumulative effect of switching costs is often vastly underestimated.\n\nIt is important to distinguish task switching from multitasking. Multitasking implies doing multiple things at once, while task switching acknowledges that the brain handles one cognitive task at a time and pays a cost for each transition. Some strategies to minimize switching costs include time blocking, batching similar tasks together, completing tasks before moving on, using the Pomodoro Technique to maintain sustained focus, and designing workflows that reduce the need for context changes.",
    "tags": [
        "attention",
        "focus",
        "productivity",
        "cognitive-science"
    ],
    "category": "Attention & Focus",
    "icon": "FaExchangeAlt",
    "featured": false,
    "aliases": [
        "Switch cost",
        "Context switching cost",
        "Attention residue cost"
    ],
    "relatedConcepts": [
        "context-switching",
        "attention-residue",
        "deep-work",
        "flow-state",
        "maker-schedule"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Task switching (psychology) - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Task_switching_(psychology)",
            "type": "website"
        },
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Personal Knowledge Management Coaching",
            "url": "https://store.dsebastien.net/product/pkm-coaching",
            "type": "other"
        },
        {
            "title": "DeveloPassion's Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/product/clarity-101",
            "type": "other"
        },
        {
            "title": "Personal Organization 101 Workshop",
            "url": "https://store.dsebastien.net/product/personal-organization-101",
            "type": "other"
        },
        {
            "title": "AI Master Prompt Workshop",
            "url": "https://store.dsebastien.net/product/ai-master-prompt",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-21",
    "dateModified": "2026-02-21"
}
