{
    "id": "techno-solutionism",
    "name": "Techno-Solutionism",
    "summary": "The belief that technology, particularly digital technology, can provide solutions to all social, political, and economic problems.",
    "explanation": "Techno-solutionism is the ideology that complex social, political, and economic problems can be effectively solved through technological means, particularly digital technologies and software. The term was popularized by Belarusian-American writer Evgeny Morozov in his 2013 book 'To Save Everything, Click Here,' where he argued that Silicon Valley's approach to the world reduces messy human problems to neat technological puzzles with clean engineering solutions.\n\nAt its core, techno-solutionism involves reframing problems to make them amenable to technological intervention, often by simplifying or distorting their true nature. A complex social issue like homelessness might be reframed as a data problem (if only we had better data), an app problem (if only there were a platform), or an optimization problem (if only we could match resources more efficiently). While technology can certainly play a role in addressing such issues, techno-solutionism ignores the structural, political, and cultural dimensions that are often more fundamental.\n\nThe tendency is particularly pronounced in the AI era. Claims that AI will solve climate change, cure diseases, eliminate poverty, or fix education often exhibit techno-solutionist thinking by underestimating the non-technical barriers to these goals. AI washing frequently leverages techno-solutionist narratives, suggesting that adding AI to any product or process automatically makes it better.\n\nCritics of techno-solutionism highlight several recurring problems. The approach often ignores power dynamics, treating social problems as if they exist in a political vacuum. It can create new problems while solving old ones, such as surveillance technologies deployed in the name of safety. It tends to benefit those who are already privileged, as technological solutions often require access, literacy, and resources that are unequally distributed. And it can serve as a distraction from more fundamental but politically difficult reforms.\n\nTechno-solutionism is not the same as being pro-technology. It is possible to appreciate technology's genuine capabilities while recognizing that not every problem has a technological solution, and that many technological solutions work best when embedded within broader social, institutional, and political change. The distinction lies in whether technology is seen as one tool among many or as the primary or only approach to problem-solving.\n\nThe concept connects to broader intellectual traditions including technological determinism (the idea that technology drives social change rather than the reverse), instrumentalism (reducing complex issues to technical problems), and the critique of scientism (the overextension of scientific methods to domains where they may not be appropriate).",
    "tags": ["critical-thinking", "philosophy", "technologies", "ethics", "biases"],
    "category": "Philosophy & Wisdom",
    "icon": "FaLightbulb",
    "featured": false,
    "aliases": ["Technological Solutionism", "Tech Solutionism"],
    "relatedConcepts": ["ai-washing", "hype-cycle", "ai-ethics", "greenwashing", "critical-thinking", "map-is-not-the-territory"],
    "relatedNotes": [],
    "references": [
        {"title": "Technological solutionism - Wikipedia", "url": "https://en.wikipedia.org/wiki/Technological_solutionism", "type": "website"}
    ],
    "articles": [],
    "books": [],
    "tutorials": [],
    "datePublished": "2026-02-27",
    "dateModified": "2026-02-27"
}
