{
    "id": "the-1-6-4-method",
    "name": "The 1-6-4 Method",
    "summary": "A life planning framework for building a fulfilling year around 1 year-making event, 6 mini-adventures, and 4 quarterly habits.",
    "explanation": "The 1-6-4 Method, popularized by entrepreneur Jesse Itzler, is a simple but powerful framework for planning a fulfilling year. It combats the tendency to let months blur together by deliberately scheduling meaningful experiences and growth throughout the year.\n\n## The Three Components\n\n### 1 — One Year-Making Event\n\nPlan one big, defining challenge or experience that anchors your entire year. This is inspired by the Japanese concept of Misogi — an extremely challenging annual endeavor that pushes you past your perceived limits. Examples include running a marathon, launching a side business, completing a multi-day solo backpacking trip, or any transformative undertaking that forces growth. This becomes the centerpiece of your year — something you'll remember and talk about for years to come.\n\n### 6 — Six Mini-Adventures\n\nSchedule one small but exciting experience every other month (6 per year). These are not grand events but meaningful breaks from routine: camping at a national park, visiting a city you've never explored, attending a music festival, hosting a dinner party, or exploring an unfamiliar part of your own city. The key is to put them on the calendar in advance so they actually happen rather than remaining vague intentions.\n\n### 4 — Four Quarterly Habits\n\nAdd one positive, compounding habit every quarter. Rather than overwhelming yourself with a long list of New Year's resolutions, you introduce one small routine every three months: drinking more water, walking 10,000 steps daily, meditating, journaling, or any habit that incrementally improves your life. By the end of the year, you've built four new habits that compound over time.\n\n## Why It Works\n\nThe method works because it addresses a modern problem: we've become bad at leisure. The digital world provides constant low-quality stimulation that crowds out genuinely fulfilling experiences. The 1-6-4 Method creates a deliberate counterbalance — a structure of things to look forward to throughout the year. Having planned adventures on the calendar provides anticipation (which research shows is a significant component of happiness), breaks up monotony, and ensures personal growth doesn't get perpetually postponed.\n\n## Practical Tips\n\n- Plan the year-making event and mini-adventures at the start of the year\n- Put specific dates on the calendar — unscheduled plans rarely happen\n- Start each quarterly habit small — make it easy to maintain\n- Share plans with friends or family to create accountability\n- Review and adjust quarterly, but resist the urge to over-optimize",
    "tags": [
        "personal-growth",
        "well-being",
        "planning",
        "habits",
        "frameworks"
    ],
    "category": "Well-Being & Happiness",
    "icon": "FaCalendarAlt",
    "featured": false,
    "aliases": [
        "1-6-4 Method",
        "164 Method",
        "Jesse Itzler Method"
    ],
    "relatedConcepts": [
        "misogi",
        "habit-formation",
        "habit-stacking",
        "keystone-habits",
        "positive-routines",
        "compound-effect",
        "intentionality",
        "life-design",
        "life-audit",
        "goal-setting",
        "happiness-practices",
        "highlight-of-the-day",
        "digital-detox",
        "ikigai"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Living with a SEAL by Jesse Itzler",
            "url": "https://www.amazon.com/dp/1455534684?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Journaling Deep Dive Workshop",
            "url": "https://store.dsebastien.net/product/journaling-deep-dive",
            "type": "other"
        },
        {
            "title": "Personal Organization 101 Workshop",
            "url": "https://store.dsebastien.net/product/personal-organization-101",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-11",
    "dateModified": "2026-02-11"
}
