{
    "id": "theory-of-mind",
    "name": "Theory of Mind",
    "summary": "The ability to understand that others have beliefs, desires, intentions, and perspectives that are different from one's own.",
    "explanation": "Theory of Mind (ToM) is the cognitive capacity to attribute mental states to oneself and others - to recognize that other people have thoughts, feelings, and knowledge distinct from your own. This ability is fundamental to social interaction, empathy, and understanding behavior. Children typically develop ToM around age 3-5, demonstrated by passing 'false belief' tests (understanding that someone can believe something you know to be false). Levels of ToM: first-order (I know that you know), second-order (I know that you know that I know), and higher orders of recursive thinking about mental states. Applications: social interaction (predicting others' behavior based on their beliefs), empathy (understanding others' emotional states), deception (knowing you can create false beliefs in others), and communication (tailoring messages to others' knowledge). In storytelling, ToM is essential - readers use it to: track what each character knows, understand motivations, recognize dramatic irony (we know what characters don't), and appreciate unreliable narrators (characters whose beliefs differ from truth). The three-sided knowledge structure in stories exploits ToM - we simultaneously track the author's knowledge, each character's limited perspective, and our own developing understanding. ToM deficits (as in autism spectrum) make it harder to: understand others' perspectives, predict behavior, recognize deception, and follow complex narratives. For knowledge workers, strong ToM improves: stakeholder communication (understanding their perspective), conflict resolution (recognizing different mental models), teaching (modeling what learners don't yet know), and persuasion (addressing actual beliefs rather than assumed ones).",
    "tags": [
        "psychology",
        "cognition",
        "social-skills",
        "empathy",
        "mental-models",
        "communications"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaBrain",
    "featured": false,
    "aliases": [
        "Mentalizing",
        "Mind reading",
        "Perspective taking",
        "ToM"
    ],
    "relatedConcepts": [
        "empathic-listening",
        "mental-models",
        "narrative-perspective",
        "epistemic-uncertainty"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Theory of mind - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Theory_of_mind",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-06",
    "dateModified": "2026-01-18"
}
