{
    "id": "theory-of-multiple-intelligences",
    "name": "Theory of Multiple Intelligences",
    "summary": "Howard Gardner's theory proposing that intelligence is not a single general ability but consists of multiple distinct modalities including linguistic, logical-mathematical, musical, bodily-kinesthetic, spatial, interpersonal, intrapersonal, and naturalistic intelligences.",
    "explanation": "The Theory of Multiple Intelligences, developed by psychologist Howard Gardner in 1983, challenges the traditional view of intelligence as a single measurable entity (IQ). Instead of asking 'How smart are you?', Gardner's framework asks 'How are you smart?', recognizing that individuals possess different cognitive strengths. The theory identifies eight distinct intelligences: Linguistic (word smart), Logical-Mathematical (number/reasoning smart), Spatial (picture smart), Musical (music smart), Bodily-Kinesthetic (body smart), Interpersonal (people smart), Intrapersonal (self smart), and Naturalistic (nature smart). Each intelligence operates relatively independently, has neurological foundations, and can be developed through practice and education.\n\nThe theory has profound implications for education, advocating for differentiated instruction that teaches concepts through multiple modalities, recognizes students' varied strengths, and allows diverse ways to demonstrate understanding. Rather than relying solely on verbal and mathematical assessments, educators can use portfolios, performances, and projects to evaluate authentic demonstrations of competence. This approach helps students recognize their unique cognitive profiles, builds confidence in non-academic strengths, and supports personalized learning paths that leverage individual capabilities.\n\nCritics argue the theory lacks strong empirical support and that the 'intelligences' may simply be abilities or talents rather than distinct forms of intelligence. The theory is often confused with 'learning styles', though Gardner clarifies that MI concerns capabilities, not preferred learning methods. Despite scientific debates, the framework has proven valuable in broadening how we conceptualize human potential, encouraging appreciation for diverse forms of excellence, and informing educational practices that honor the full range of human cognitive abilities.",
    "tags": [
        "psychology",
        "learning",
        "education",
        "intelligence",
        "cognitive-science",
        "individual-differences",
        "teaching",
        "personal-development"
    ],
    "category": "Learning & Education",
    "icon": "FaBrain",
    "featured": false,
    "aliases": [
        "Multiple Intelligences",
        "Gardner's Multiple Intelligences",
        "MI Theory",
        "Eight Intelligences"
    ],
    "relatedConcepts": [
        "emotional-intelligence",
        "metacognition",
        "growth-mindset",
        "personalized-learning",
        "spatial-intelligence"
    ],
    "relatedNotes": [
        "https://notes.dsebastien.net/30+Areas/33+Permanent+notes/33.02+Content/Theory+of+Multiple+Intelligences"
    ],
    "articles": [],
    "books": [
        {
            "title": "Frames of Mind: The Theory of Multiple Intelligences by Howard Gardner",
            "url": "https://www.amazon.com/dp/0465024335?tag=dsebastien00-20"
        },
        {
            "title": "Multiple Intelligences: New Horizons by Howard Gardner",
            "url": "https://www.amazon.com/dp/0465047688?tag=dsebastien00-20"
        },
        {
            "title": "Intelligence Reframed: Multiple Intelligences for the 21st Century by Howard Gardner",
            "url": "https://www.amazon.com/dp/0465026117?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Theory of multiple intelligences - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Theory_of_multiple_intelligences",
            "type": "website"
        },
        {
            "title": "Howard Gardner - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Howard_Gardner",
            "type": "website"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "DeveloPassion's Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-29",
    "dateModified": "2026-01-29"
}
