{
    "id": "thick-desires",
    "name": "Thick Desires",
    "summary": "Desires that fundamentally transform you in the process of pursuing them, requiring years to cultivate and changing who you are.",
    "explanation": "Thick desires are transformative aspirations that change you in the process of pursuing them. Unlike thin desires that provide satisfaction without personal growth, thick desires fundamentally alter your capabilities, values, and worldview. Learning calculus exemplifies a thick desire - the pursuit expands your cognitive abilities and permanently changes how you see patterns and relationships. Similarly, mastering a craft, building genuine community, or developing wisdom are thick desires because they require sustained effort and transform the person pursuing them.\n\nThick desires share key characteristics: they take years to cultivate, cannot be satisfied on demand, and are inherently effortful to acquire. They resist the logic of instant gratification and optimization. Reading slowly to deeply understand, apprenticing in a craft, or building authentic relationships are thick desires because they transform the practitioner through the practice itself.\n\nThe concept, drawing on philosophical work by thinkers like Charles Taylor and Agnes Callard, contrasts with the thin desires that dominate modern consumer culture. While thin desires reproduce themselves without remainder - you check notifications, feel satisfied briefly, then return to your original state - thick desires create lasting change. They are inconvenient by nature, incompatible with marketplace logic that demands scalability and efficiency.\n\nUnderstanding thick desires helps knowledge workers recognize the difference between activities that transform and those that merely occupy. It explains why mastering your craft feels fundamentally different from consuming content, and why genuine learning resists being reduced to quick tips or life hacks. Thick desires cannot be outsourced, automated, or completed - they represent the patient, transformative work of becoming someone different.",
    "tags": [
        "well-being",
        "philosophies",
        "self-improvement",
        "learning",
        "habits",
        "intentionality",
        "values",
        "transformation",
        "growth"
    ],
    "category": "Philosophy & Wisdom",
    "icon": "FaSeedling",
    "featured": false,
    "aliases": [
        "Transformative desires",
        "Deep desires",
        "Cultivated desires"
    ],
    "relatedConcepts": [
        "thin-desires",
        "aspiration",
        "eudaimonia",
        "deliberate-practice",
        "deep-work",
        "learning-by-doing",
        "growth-mindset"
    ],
    "relatedNotes": [],
    "articles": [
        {
            "title": "Thin Desires Are Eating Your Life by JA Westenberg",
            "url": "https://www.joanwestenberg.com/thin-desires-are-eating-your-life/",
            "type": "website"
        }
    ],
    "references": [
        {
            "title": "Thick and Thin Desires - Philosophy",
            "url": "https://en.wikipedia.org/wiki/Desire",
            "type": "website"
        }
    ],
    "books": [
        {
            "title": "Aspiration: The Agency of Becoming by Agnes Callard",
            "url": "https://www.amazon.com/dp/0190881518?tag=dsebastien00-20"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-06",
    "dateModified": "2026-01-06"
}
