{
    "id": "thin-desires",
    "name": "Thin Desires",
    "summary": "Desires that provide satisfaction without personal transformation, reproducing themselves endlessly without lasting change.",
    "explanation": "Thin desires are satisfactions that leave you fundamentally unchanged. Unlike thick desires that transform who you are, thin desires reproduce themselves without remainder - you satisfy them, feel briefly content, then return to your original state, ready to desire again. Checking notifications exemplifies a thin desire: you look, get a small dopamine hit, then immediately want to check again. The cycle perpetuates itself without building anything lasting.\n\nModern consumer technology excels at extracting thin desires from thick ones. Social media mimics friendship without the transformative work of genuine connection. Productivity apps simulate accomplishment without actual results. News feeds provide the sensation of being informed without developing real understanding. These thin desires deliver 'a diet of pure sensation' - the neurological reward component separated from the effortful growth that would transform you.\n\nThin desires share key characteristics: they can be satisfied instantly, require no skill development, scale infinitely, and optimize for maximum consumption. They fit marketplace logic perfectly - they're efficient to deliver, endlessly reproducible, and keep users wanting more. Where thick desires resist commodification because they require patient transformation, thin desires thrive in attention economies precisely because they never transform their host.\n\nUnderstanding thin desires helps knowledge workers recognize what JA Westenberg calls the infrastructure problem: modern systems systematically dismantle spaces for thick desires (workshops, communities, apprenticeships) while making thin-desire infrastructure inescapable. Awareness of this distinction enables intentional resistance - choosing activities that build rather than merely stimulate, that transform rather than merely satisfy. It explains the correlation between unprecedented connectivity and rising anxiety: thin desires proliferate while thick desires starve.",
    "tags": [
        "well-being",
        "philosophies",
        "attention-management",
        "habits",
        "intentionality",
        "values",
        "technology",
        "consumerism",
        "awareness"
    ],
    "category": "Philosophy & Wisdom",
    "icon": "FaRedoAlt",
    "featured": false,
    "aliases": [
        "Shallow desires",
        "Superficial desires",
        "Non-transformative desires"
    ],
    "relatedConcepts": [
        "thick-desires",
        "hedonic-adaptation",
        "attention-economy",
        "digital-minimalism",
        "shiny-object-syndrome",
        "instant-gratification",
        "mimetic-desire"
    ],
    "relatedNotes": [],
    "articles": [
        {
            "title": "Thin Desires Are Eating Your Life by JA Westenberg",
            "url": "https://www.joanwestenberg.com/thin-desires-are-eating-your-life/",
            "type": "website"
        }
    ],
    "references": [
        {
            "title": "Desire - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Desire",
            "type": "website"
        },
        {
            "title": "Hedonic treadmill - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Hedonic_treadmill",
            "type": "website"
        }
    ],
    "books": [
        {
            "title": "The Attention Merchants by Tim Wu",
            "url": "https://www.amazon.com/dp/0804170045?tag=dsebastien00-20"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-06",
    "dateModified": "2026-01-06"
}
