{
    "id": "three-marks-of-existence",
    "name": "Three Marks of Existence",
    "summary": "Buddhist teaching of three fundamental characteristics shared by all conditioned phenomena: impermanence, suffering, and non-self.",
    "explanation": "The Three Marks of Existence (tilakkhaṇa in Pali) are the three characteristics that the Buddha taught are shared by all conditioned phenomena. Understanding these marks deeply leads to wisdom and liberation from suffering.\n\n**The Three Marks:**\n\n1. **Anicca (Impermanence)**: All conditioned things are transient - arising, persisting briefly, and passing away. Nothing stays the same. Bodies age, thoughts pass, relationships evolve, civilizations rise and fall.\n\n2. **Dukkha (Suffering/Unsatisfactoriness)**: Conditioned existence is inherently unsatisfying. Even pleasant experiences end, and clinging to what changes causes suffering. Life includes inevitable difficulties, and grasping for permanent satisfaction is futile.\n\n3. **Anatta (Non-self)**: There is no permanent, unchanging, independent self or soul. What we call 'self' is a constantly changing collection of physical and mental processes.\n\n**Why these three together:**\n\nThe marks are interconnected: because things are impermanent (anicca), clinging to them causes suffering (dukkha). Because there is no fixed self (anatta), there's nothing that needs to cling or resist change. Understanding all three together reveals why suffering arises and how liberation is possible.\n\n**Practical applications:**\n\n- Contemplate impermanence to reduce attachment\n- Acknowledge dukkha to stop seeking satisfaction in the wrong places\n- Investigate anatta to release ego-driven suffering\n- Use all three as meditation themes\n- Apply understanding to daily life situations\n\nFor knowledge workers, the three marks help: accept project endings, normalize career difficulties, adapt to organizational change, and maintain equanimity amid uncertainty.\n\nThe teaching isn't pessimistic but liberating - seeing reality clearly enables appropriate responses rather than futile resistance or grasping.",
    "tags": [
        "buddhism",
        "philosophies",
        "wisdom",
        "frameworks",
        "mindfulness"
    ],
    "category": "Philosophy & Wisdom",
    "icon": "FaDharmachakra",
    "featured": false,
    "aliases": [
        "Tilakkhaṇa",
        "Three Characteristics",
        "Three Universal Truths",
        "Trilakshana"
    ],
    "relatedConcepts": [
        "impermanence",
        "dukkha",
        "anatta",
        "four-noble-truths",
        "non-attachment"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Three marks of existence - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Three_marks_of_existence",
            "type": "website"
        },
        {
            "title": "Journaling Deep Dive Workshop",
            "url": "https://store.dsebastien.net/product/journaling-deep-dive",
            "type": "other"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/product/clarity-101",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-18",
    "dateModified": "2026-01-18"
}
