{
  "id": "tipping-point",
  "name": "Tipping Point",
  "summary": "The critical threshold at which small changes accumulate to cause a significant, often irreversible shift in a system.",
  "explanation": "A tipping point is the moment when gradual changes accumulate to produce a sudden, dramatic shift. Popularized by Malcolm Gladwell's book of the same name, the concept describes how small causes can have large effects once a critical threshold is crossed. What seemed stable suddenly transforms, often irreversibly.\n\nThe concept applies across domains: in epidemics, tipping points determine when diseases become pandemics; in social change, they mark when behaviors spread from early adopters to mainstream; in climate science, they represent thresholds beyond which feedback loops accelerate change; in business, they signal when products achieve critical mass.\n\nGladwell identified three key factors that create tipping points: the Law of the Few (small numbers of influential people - Connectors, Mavens, and Salesmen - drive change), the Stickiness Factor (the message must be memorable enough to spur action), and the Power of Context (environment and circumstances matter enormously).\n\nTipping points are related to phase transitions in physics, where systems undergo sudden state changes (water freezing at exactly 0°C). They connect to the concept of 'gradually, then suddenly' - the pattern where change accumulates invisibly until crossing a threshold where it becomes obvious and rapid.\n\nFor knowledge workers and leaders, understanding tipping points means: recognizing that big changes often result from small interventions at the right moment, identifying leverage points where small pushes have outsized effects, and understanding that systems can appear stable while approaching critical thresholds. The challenge is that tipping points are often only visible in retrospect.",
  "tags": [
    "systems-thinking",
    "change",
    "strategies"
  ],
  "category": "Psychology & Mental Models",
  "icon": "FaBalanceScale",
  "featured": false,
  "aliases": [
    "Critical Mass",
    "Inflection Point",
    "Phase Transition"
  ],
  "relatedConcepts": [
    "gradually-then-suddenly",
    "network-effects",
    "butterfly-effect",
    "exponential-change"
  ],
  "relatedNotes": [],
  "articles": [],
  "references": [
    {
      "title": "Tipping point (sociology) - Wikipedia",
      "url": "https://en.wikipedia.org/wiki/Tipping_point_(sociology)",
      "type": "website"
    }
  ],
  "books": [
    {
      "title": "The Tipping Point by Malcolm Gladwell",
      "url": "https://www.amazon.com/dp/0316346624"
    }
  ],
  "tutorials": [],
  "datePublished": "2026-01-20",
  "dateModified": "2026-01-20"
}
