{
    "id": "transferable-skills",
    "name": "Transferable Skills",
    "summary": "Abilities that can be applied across different jobs, industries, and contexts.",
    "explanation": "Transferable skills are abilities that remain valuable regardless of the specific job, industry, or context. They travel with you throughout your career and can be applied in new situations. Examples include critical thinking, problem-solving, communication, project management, data analysis, writing, and leadership.\n\nThese skills provide career flexibility and resilience. When industries shrink or jobs disappear, transferable skills allow professionals to pivot. A project manager's organizational abilities work in tech, healthcare, or construction. A writer's communication skills apply to marketing, documentation, or journalism. This portability becomes increasingly valuable in a rapidly changing economy.\n\nTransferable skills exist on a spectrum. Some are highly universal (communication, critical thinking), while others transfer within related domains (financial analysis transfers between industries but requires some adaptation). The most transferable skills tend to be foundational cognitive and interpersonal abilities rather than narrow technical competencies.\n\nIdentifying your transferable skills requires looking beyond job titles and specific tasks to the underlying capabilities you've developed. Someone who 'managed a team of developers' has transferable skills in leadership, delegation, conflict resolution, and performance management—applicable far beyond software development. Career changers and job seekers benefit from explicitly articulating their transferable skills to demonstrate value in new contexts.",
    "tags": [
        "skills",
        "careers",
        "professional-development",
        "learning",
        "adaptability"
    ],
    "category": "Learning & Education",
    "icon": "FaExchangeAlt",
    "featured": false,
    "aliases": [
        "Portable Skills",
        "Universal Skills",
        "Cross-Functional Skills"
    ],
    "relatedConcepts": [
        "hard-skills",
        "soft-skills",
        "t-shaped-skills",
        "meta-skills"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "So Good They Can't Ignore You by Cal Newport",
            "url": "https://www.amazon.com/dp/1455509124"
        },
        {
            "title": "Range by David Epstein",
            "url": "https://www.amazon.com/dp/0735214484"
        }
    ],
    "references": [
        {
            "title": "Transferable Skills - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Transferable_skills_analysis",
            "type": "website"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/product/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "DeveloPassion's Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-25",
    "dateModified": "2026-01-25"
}
