{
    "id": "transcendental-meditation",
    "name": "Transcendental Meditation",
    "summary": "Mantra-based meditation technique practiced 20 minutes twice daily to access deep rest and reduce stress.",
    "explanation": "Transcendental Meditation (TM) is a specific form of mantra meditation introduced by Maharishi Mahesh Yogi in 1955. It involves silently repeating a personalized mantra for 15-20 minutes twice daily while sitting comfortably with eyes closed.\n\nHow TM works:\n\n1. Sit comfortably with eyes closed\n2. Silently repeat your assigned mantra\n3. When thoughts arise, gently return to the mantra\n4. Allow the mind to settle naturally\n5. Practice for 20 minutes, twice daily\n\nKey characteristics:\n- Effortless technique (no concentration or contemplation)\n- Uses specific mantras assigned by certified teachers\n- Standardized instruction through official TM organization\n- Morning and evening practice schedule\n\nThe TM perspective: Unlike focused attention meditation, TM emphasizes effortlessness. The mantra serves as a vehicle to transcend thought and access \"pure consciousness\" - a state of restful alertness. Thoughts are not suppressed but naturally settle.\n\nResearch findings: TM has extensive published research showing benefits for stress reduction, blood pressure, anxiety, and cognitive function. The American Heart Association has acknowledged it may lower blood pressure. Studies show unique brain coherence patterns during practice.\n\nPractical considerations: TM requires learning from a certified instructor (standardized 4-day course). The organization charges fees for instruction. The technique itself is simple once learned, requiring no special conditions or equipment.\n\nCriticism and alternatives: Some argue the technique is essentially mantra meditation available through other traditions for free. Supporters emphasize the importance of proper instruction and the specific TM methodology.",
    "tags": [
        "meditation",
        "relaxation",
        "practices",
        "well-being"
    ],
    "category": "Well-Being & Happiness",
    "icon": "FaOm",
    "featured": false,
    "aliases": [
        "TM",
        "Maharishi meditation"
    ],
    "relatedConcepts": [
        "mindfulness",
        "relaxation-response",
        "focused-attention-meditation"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Strength in Stillness by Bob Roth",
            "url": "https://www.amazon.com/dp/1501161210?tag=dsebastien00-20"
        },
        {
            "title": "Transcendence by Norman Rosenthal",
            "url": "https://www.amazon.com/dp/1585429929?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Transcendental Meditation - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Transcendental_Meditation",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-29",
    "dateModified": "2026-01-29"
}
