{
    "id": "tunneling",
    "name": "Tunneling",
    "summary": "The tendency for scarcity to focus attention narrowly on immediate needs while neglecting important long-term concerns.",
    "explanation": "Tunneling is a cognitive phenomenon identified by Mullainathan and Shafir in their scarcity research, where perceived scarcity causes people to focus intensely on the most pressing shortage while neglecting other important areas of life. Like looking through a tunnel, the person sees what's directly ahead with great clarity but loses peripheral vision entirely.\n\nWhen you're short on money, you tunnel on financial concerns and may neglect health, relationships, or career development. When you're short on time, you tunnel on the immediate deadline and neglect exercise, sleep, or strategic planning. The irony is that tunneling often worsens the very scarcity that triggered it, creating a vicious cycle.\n\nTunneling has both benefits and costs. The benefit is a 'focus dividend': scarcity makes people remarkably efficient at addressing the immediate shortage. A person with a tight deadline often produces remarkably focused work. But the cost - the 'tunneling tax' - is neglecting everything outside the tunnel, leading to: missed appointments, forgotten bills, deferred maintenance, overlooked opportunities, and accumulated problems in neglected areas.\n\nFor knowledge workers, tunneling is particularly dangerous because the most important work is often non-urgent: building systems, developing skills, nurturing relationships, and strategic thinking. These activities get consistently pushed aside when someone tunnels on immediate deliverables.\n\nCountering tunneling requires: building slack so scarcity doesn't trigger the tunnel, using checklists and systems to protect important-but-not-urgent activities, scheduling non-negotiable time for strategic and maintenance tasks, and recognizing tunneling in yourself as a signal to step back and rebalance.",
    "tags": [
        "psychology",
        "cognition",
        "scarcity",
        "attention",
        "decision-making"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaSearchMinus",
    "featured": false,
    "aliases": [
        "Tunnel Vision (Scarcity)",
        "Scarcity Tunnel",
        "Attentional Narrowing"
    ],
    "relatedConcepts": [
        "scarcity",
        "scarcity-mindset",
        "bandwidth-tax",
        "slack-resources",
        "continuous-partial-attention",
        "time-scarcity-mindset",
        "eisenhower-matrix"
    ],
    "relatedNotes": [
        "https://notes.dsebastien.net/30+Areas/33+Permanent+notes/33.02+Content/Scarcity"
    ],
    "articles": [],
    "books": [
        {
            "title": "Scarcity by Sendhil Mullainathan and Eldar Shafir",
            "url": "https://www.amazon.com/dp/125005611X?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Attentional control - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Attentional_control",
            "type": "website"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/product/clarity-101",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-20",
    "dateModified": "2026-02-20"
}
