{
    "id": "utilitarianism",
    "name": "Utilitarianism",
    "summary": "An ethical theory that judges the morality of actions based on their consequences, aiming to maximize overall well-being or happiness for the greatest number.",
    "explanation": "Utilitarianism is one of the most influential ethical theories in Western philosophy, holding that the right action is the one that produces the greatest good for the greatest number of people. Developed primarily by Jeremy Bentham and John Stuart Mill in the 18th and 19th centuries, it remains a cornerstone of moral philosophy and practical ethics.\n\nAt its core, utilitarianism is a form of consequentialism - it evaluates actions solely by their outcomes rather than by intentions, rules, or inherent qualities of the act itself. The 'utility' in question is typically understood as well-being, happiness, or preference satisfaction, though different variants define it differently.\n\nMajor variants include:\n\n**Act utilitarianism**: Each individual action should be evaluated based on whether it maximizes utility in that specific situation.\n\n**Rule utilitarianism**: We should follow rules that, if generally adopted, would produce the greatest overall utility, even if breaking them might produce more utility in a specific case.\n\n**Preference utilitarianism**: Rather than maximizing happiness, we should maximize the satisfaction of people's informed preferences.\n\n**Negative utilitarianism**: Focuses on minimizing suffering rather than maximizing happiness.\n\nUtilitarianism has profoundly influenced public policy, economics (through welfare economics and cost-benefit analysis), animal ethics (Peter Singer's arguments for animal liberation), and the effective altruism movement. Its emphasis on impartial consideration of all affected parties and on measurable outcomes makes it particularly useful for policy decisions.\n\nHowever, utilitarianism faces significant philosophical challenges. The demandingness objection argues it requires too much self-sacrifice. The justice objection notes it could justify harming minorities if doing so benefits the majority. The measurement problem questions whether utility can be meaningfully compared across individuals. And the integrity objection, raised by Bernard Williams, argues it can require people to abandon their deepest personal commitments.\n\nDespite these criticisms, utilitarian thinking remains indispensable in ethics, economics, and governance as a framework for systematically weighing costs and benefits of decisions.",
    "tags": [
        "ethics",
        "philosophy",
        "decision-making"
    ],
    "category": "Philosophy & Wisdom",
    "icon": "FaBalanceScale",
    "featured": false,
    "aliases": [
        "Utility Theory",
        "Greatest Happiness Principle"
    ],
    "relatedConcepts": [
        "effective-altruism",
        "expected-value",
        "altruism",
        "scope-insensitivity"
    ],
    "relatedNotes": [],
    "references": [
        {
            "title": "Utilitarianism - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Utilitarianism",
            "type": "website"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/product/knowledge-management-for-beginners",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/product/clarity-101",
            "type": "other"
        }
    ],
    "articles": [],
    "books": [
        {
            "title": "Utilitarianism by John Stuart Mill",
            "url": "https://www.amazon.com/dp/1548160687?tag=dsebastien00-20"
        },
        {
            "title": "Practical Ethics by Peter Singer",
            "url": "https://www.amazon.com/dp/0521707684?tag=dsebastien00-20"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-08",
    "dateModified": "2026-02-08"
}
