{
    "id": "value-chain",
    "name": "Value Chain",
    "summary": "Framework for analyzing the activities a company performs to deliver a valuable product or service.",
    "explanation": "The value chain, introduced by Michael Porter in 1985, is a framework for analyzing the sequence of activities that a company performs to design, produce, market, deliver, and support its product. It divides activities into two categories: primary activities (inbound logistics, operations, outbound logistics, marketing and sales, service) and support activities (firm infrastructure, human resource management, technology development, procurement). Each activity adds value to the product, and competitive advantage comes from performing these activities better or differently than competitors. Understanding your value chain helps identify: where you create the most value, which activities to outsource, where costs can be reduced, and opportunities for differentiation. For knowledge workers, value chain analysis applies to personal productivity - understanding which activities in your workflow create the most value helps prioritize and optimize your efforts.",
    "tags": [
        "strategies",
        "businesses",
        "frameworks",
        "analysis",
        "operations"
    ],
    "category": "Business & Economics",
    "icon": "FaLink",
    "featured": false,
    "aliases": [
        "Porter's Value Chain",
        "Value Chain Analysis"
    ],
    "relatedConcepts": [
        "competitive-advantage",
        "outsourcing",
        "core-competencies",
        "disruptive-innovation"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Competitive Advantage by Michael Porter",
            "url": "https://www.amazon.com/dp/0684841460?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Value chain - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Value_chain",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-03",
    "dateModified": "2026-02-03"
}
