{
    "id": "virtue-signaling",
    "name": "Virtue Signaling",
    "summary": "Publicly expressing moral values or opinions primarily to demonstrate one's good character to others.",
    "explanation": "Virtue signaling refers to the public expression of moral values, political opinions, or support for causes primarily to signal one's virtue or group membership to others, rather than to effect actual change. While the term is often used pejoratively, it describes a genuine phenomenon rooted in signaling theory. Humans are social creatures who benefit from being perceived as moral, trustworthy, and aligned with their in-group. Publicly expressing approved opinions is a low-cost way to signal these qualities. Examples include social media posts supporting causes, displaying awareness ribbons, using certain language or hashtags, or publicly condemning wrongdoers. The criticism of virtue signaling centers on the gap between expression and action: it's easier to post support than to volunteer, donate, or make personal sacrifices. However, some argue that even purely expressive support can shift norms and encourage others. The concept also raises questions about authenticity: when does genuine moral expression become mere signaling? And does questioning someone's motives dismiss legitimate moral concerns? Understanding virtue signaling helps recognize when public moral discourse may be more about social positioning than substantive ethics.",
    "tags": [
        "social-psychology",
        "communications",
        "ethics",
        "social-media",
        "behaviors"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaHeart",
    "featured": false,
    "aliases": [
        "Moral grandstanding",
        "Performative morality"
    ],
    "relatedConcepts": [
        "signaling",
        "costly-signaling-theory",
        "in-group-bias",
        "social-proof",
        "slacktivism",
        "performative-activism",
        "cheap-talk",
        "moral-licensing"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Virtue signalling - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Virtue_signalling",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-13",
    "dateModified": "2026-02-20"
}
