{
    "id": "visual-communication",
    "name": "Visual Communication",
    "summary": "The transmission of ideas and information through visual forms including images, typography, color, symbols, and spatial arrangement.",
    "explanation": "Visual Communication is the conveyance of meaning through visual elements rather than words alone. Unlike verbal or written language, visual communication leverages the brain's capacity to process images rapidly and holistically, often conveying meaning that would require many words to express. The field encompasses graphic design, data visualization, information design, photography, and user interface design.\n\nThe study of visual communication draws from semiotics (the science of signs), Gestalt psychology (how we perceive patterns), and cognitive psychology (how we process visual information). Pioneers like Otto Neurath (ISOTYPE), Edward Tufte (analytical design), and Harry Beck (schematic transit maps) demonstrated how thoughtful visual design can make complex information accessible.\n\nVisual communication relies on fundamental elements: line (direction and movement), shape (categorization and containment), color (emotion and emphasis), typography (hierarchy and tone), space (grouping and breathing room), texture (depth and interest), and scale (importance and relationships). Gestalt principles—proximity, similarity, closure, continuity, and figure/ground—explain how we perceive and group visual elements.\n\nApplications span marketing and branding, education and visual aids, journalism and infographics, wayfinding and signage, digital product design, and scientific visualization. In the digital age, visual literacy—the ability to interpret and create visual messages—has become as essential as reading and writing.",
    "tags": [
        "communications",
        "design",
        "visualization",
        "information-design",
        "visual-thinking"
    ],
    "category": "Communication",
    "icon": "FaEye",
    "featured": false,
    "aliases": [
        "Visual Language",
        "Graphic Communication"
    ],
    "relatedConcepts": [
        "data-visualization",
        "information-design",
        "gestalt-psychology",
        "cognitive-psychology"
    ],
    "relatedNotes": [
        "https://notes.dsebastien.net/Visual+Communication"
    ],
    "articles": [],
    "books": [
        {
            "title": "A Primer of Visual Literacy by Donis A. Dondis",
            "url": "https://www.amazon.com/dp/0262540290?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Visual communication - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Visual_communication",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-28",
    "dateModified": "2026-01-29"
}
