{
    "id": "weekly-review",
    "name": "Weekly Review",
    "summary": "A structured weekly practice from Getting Things Done for clearing inboxes, reviewing projects, and resetting your productivity system.",
    "explanation": "The weekly review is the cornerstone habit of David Allen's Getting Things Done (GTD) methodology. It is a recurring process designed to help you get current, get clear, and get creative about your work and life commitments. Allen considers it the critical success factor for making GTD work, because without regular maintenance, any productivity system gradually falls out of date and loses trust.\n\nThe weekly review follows a structured sequence of steps. First, you collect loose papers, notes, and materials that have accumulated during the week. Next, you process your inboxes to zero, making decisions about each item. Then you review your calendar for the past and upcoming weeks to catch any triggered actions or preparation needs. You update your project lists, ensuring each active project has a clear next action. You review your waiting-for list to follow up on delegated items. Finally, you scan your someday/maybe list for anything that should become active.\n\nThe process typically takes between thirty minutes and two hours, depending on how consistently it is maintained. Many practitioners schedule a fixed time each week, often Friday afternoon or Sunday evening, to ensure it happens reliably.\n\nBy systematically reviewing all commitments and open loops, the weekly review restores confidence that nothing is slipping through the cracks. It provides the mental clarity needed to make better decisions about priorities and helps maintain the balance between urgent tasks and important long-term goals.",
    "tags": [
        "productivity",
        "reviews",
        "planning",
        "getting-things-done"
    ],
    "category": "Productivity",
    "icon": "FaCalendarWeek",
    "featured": false,
    "aliases": [
        "GTD weekly review",
        "Weekly planning"
    ],
    "relatedConcepts": [
        "daily-review",
        "periodic-reviews",
        "inbox-zero"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Getting Things Done by David Allen",
            "url": "https://www.amazon.com/dp/0143126563?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Personal Knowledge Management Coaching",
            "url": "https://store.dsebastien.net/product/pkm-coaching",
            "type": "other"
        },
        {
            "title": "DeveloPassion's Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        },
        {
            "title": "Personal Organization 101 Workshop",
            "url": "https://store.dsebastien.net/product/personal-organization-101",
            "type": "other"
        },
        {
            "title": "AI Master Prompt Workshop",
            "url": "https://store.dsebastien.net/product/ai-master-prompt",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-21",
    "dateModified": "2026-02-21"
}
