{
    "id": "why-now",
    "name": "Why Now",
    "summary": "The critical question investors ask about market timing—why is this the right moment for this particular solution to succeed.",
    "explanation": "Why now is a fundamental question in venture capital and entrepreneurship that probes whether current conditions make success possible in ways they weren't before. It's not enough to have a good idea—founders must articulate what has changed to make this the right moment. Strong 'why now' answers typically involve: technological shifts (costs dropping, capabilities emerging), regulatory changes (new permissions or restrictions), behavioral changes (consumer habits evolving), infrastructure availability (platforms, payment systems, distribution), or market timing (incumbents vulnerable, timing windows opening). The question filters out ideas that could have succeeded years ago (suggesting nothing unique about now) and those requiring conditions that don't yet exist. Examples: Uber succeeded because smartphones with GPS became ubiquitous; Airbnb worked because the financial crisis made people willing to rent spare rooms; streaming services thrived because broadband reached critical mass. The 'why now' question connects directly to the idea maze—understanding market history reveals why previous attempts failed and what's different today. For founders, developing a compelling 'why now' narrative requires deep understanding of technological, economic, and social trends.",
    "tags": [
        "startups",
        "entrepreneurship",
        "timing",
        "fundraising",
        "strategies"
    ],
    "category": "Business & Economics",
    "icon": "FaQuestionCircle",
    "featured": false,
    "aliases": [
        "Why now moment",
        "Market timing question",
        "Timing thesis"
    ],
    "relatedConcepts": [
        "idea-maze",
        "market-timing",
        "product-market-fit",
        "first-mover-advantage",
        "crossing-the-chasm",
        "innovators-dilemma"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Zero to One by Peter Thiel",
            "url": "https://www.amazon.com/dp/0804139296?tag=dsebastien00-20"
        },
        {
            "title": "The Lean Startup by Eric Ries",
            "url": "https://www.amazon.com/dp/0307887898?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Sequoia - Writing a Business Plan",
            "url": "https://www.sequoiacap.com/article/writing-a-business-plan/",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-16",
    "dateModified": "2026-01-16"
}
