{
    "id": "work-routine",
    "name": "Work Routine",
    "summary": "A consistent daily structure of habits and rituals designed to support sustained deep work and productive output.",
    "explanation": "A work routine is a repeatable daily structure that organizes your time, energy, and attention to support productive work. Rather than relying on willpower or motivation to decide what to do and when, a well-designed routine automates these decisions through habits, reducing decision fatigue and freeing mental resources for the work itself.\n\nEffective work routines typically include a morning startup ritual that transitions you into focused work, dedicated blocks for deep work during peak energy hours, scheduled times for communication and administrative tasks, and a shutdown ritual that signals the end of the workday. Managing energy throughout the day is just as important as managing time, which means aligning demanding cognitive tasks with natural periods of high alertness and reserving lower-energy periods for routine work.\n\nMany famously productive creators have relied on strict routines. Writers like Haruki Murakami and Maya Angelou followed disciplined daily schedules. Scientists like Charles Darwin structured their days around specific work blocks interspersed with walks and rest. The common thread is not a single ideal routine but the consistency of having one.\n\nThe key benefits of a work routine include reducing the friction of getting started each day, creating reliable conditions for flow states, establishing clear boundaries between work and rest, and building momentum through repeated practice. The most sustainable routines are ones that account for recovery, social needs, and personal energy patterns rather than simply maximizing hours worked.",
    "tags": [
        "productivity",
        "habits",
        "routines",
        "self-management"
    ],
    "category": "Productivity",
    "icon": "FaRedo",
    "featured": false,
    "aliases": [
        "Daily routine",
        "Productive routine",
        "Work schedule"
    ],
    "relatedConcepts": [
        "deep-work",
        "habit-loop",
        "decision-fatigue",
        "flow-state",
        "pomodoro-technique",
        "daily-review"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Daily Rituals by Mason Currey",
            "url": "https://www.amazon.com/dp/0307273601?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/product/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/product/knowii-community",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/product/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Personal Knowledge Management Coaching",
            "url": "https://store.dsebastien.net/product/pkm-coaching",
            "type": "other"
        },
        {
            "title": "DeveloPassion's Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        },
        {
            "title": "Journaling Deep Dive Workshop",
            "url": "https://store.dsebastien.net/product/journaling-deep-dive",
            "type": "other"
        },
        {
            "title": "Personal Organization 101 Workshop",
            "url": "https://store.dsebastien.net/product/personal-organization-101",
            "type": "other"
        },
        {
            "title": "AI Master Prompt Workshop",
            "url": "https://store.dsebastien.net/product/ai-master-prompt",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-02-22",
    "dateModified": "2026-02-22"
}
