{
    "id": "zen",
    "name": "Zen",
    "summary": "A school of Mahayana Buddhism emphasizing meditation practice and direct experiential insight into one's true nature beyond intellectual understanding.",
    "explanation": "Zen (禅, from Sanskrit dhyāna meaning 'meditation') is a school of Mahayana Buddhism that originated in China as Chan Buddhism (6th century CE), later spreading to Japan, Korea (as Seon), and Vietnam (as Thiền). Zen emphasizes direct experiential insight into the nature of reality and one's own mind, rather than reliance on scripture, doctrine, or intellectual analysis.\n\nCore principles of Zen include:\n\n**Direct pointing at the mind**: Zen aims to transmit understanding through direct experience rather than through words, concepts, or logical reasoning. The famous description attributed to Bodhidharma captures this: 'A special transmission outside the scriptures; not dependent on words and letters; pointing directly at the mind; seeing into one's nature and attaining Buddhahood.'\n\n**Zazen as central practice**: Seated meditation (zazen) is the foundation of Zen practice. In the Soto school, shikantaza ('just sitting') emphasizes practice itself as the expression of enlightenment. In the Rinzai school, kōan practice uses paradoxical questions to break through conceptual thinking.\n\n**Everyday mind is the Way**: Zen does not separate spiritual practice from daily life. Eating, walking, working, and cleaning are all opportunities for practice. The famous saying 'Before enlightenment, chop wood, carry water. After enlightenment, chop wood, carry water' expresses this integration.\n\n**Non-duality**: Zen points beyond the dualistic distinctions that organize ordinary thinking - self/other, subject/object, sacred/mundane, practice/enlightenment. These categories are useful but ultimately empty of inherent existence.\n\nKey Zen concepts include:\n\n- **Satori/Kensho**: Sudden awakening or insight into one's true nature\n- **Mu**: The response that transcends yes and no\n- **Shoshin**: Beginner's mind - openness and lack of preconceptions\n- **Wu wei**: Effortless action, acting in harmony with the natural flow\n- **Mushin**: No-mind - a state of mental readiness without fixation\n\nZen has profoundly influenced East Asian art, aesthetics, martial arts, tea ceremony, calligraphy, garden design, and architecture. Its aesthetic principles of simplicity, asymmetry, naturalness, and empty space have shaped design thinking worldwide.\n\nIn Western contexts, Zen principles have influenced psychotherapy (particularly ACT and mindfulness-based approaches), creativity research, sports psychology, and management philosophy. The emphasis on present-moment awareness, non-attachment to outcomes, and the integration of practice into daily life resonates with contemporary approaches to well-being and peak performance.",
    "tags": ["philosophy", "psychology", "cognition"],
    "category": "Philosophy & Wisdom",
    "icon": "FaYinYang",
    "featured": false,
    "aliases": ["Zen Buddhism", "Chan Buddhism", "Seon"],
    "relatedConcepts": ["zazen", "koan", "mu", "satori", "beginners-mind", "wu-wei", "non-attachment", "dharma", "mindfulness", "meditation", "wabi-sabi"],
    "relatedNotes": [],
    "references": [{"title": "Zen - Wikipedia", "url": "https://en.wikipedia.org/wiki/Zen", "type": "website"}],
    "articles": [],
    "books": [{"title": "Zen Mind, Beginner's Mind by Shunryu Suzuki", "url": "https://www.amazon.com/dp/1611808413?tag=dsebastien00-20"}, {"title": "The Three Pillars of Zen by Philip Kapleau", "url": "https://www.amazon.com/dp/0385260938?tag=dsebastien00-20"}],
    "tutorials": [],
    "datePublished": "2026-02-08",
    "dateModified": "2026-02-08"
}
